{
  "newProducts": [
    {
      "title": "Google Antigravity",
      "description": "Google's new agent-first AI coding tool powered by Gemini 3. Enables autonomous AI agents to write code, manage tasks, and execute complex multi-tool software tasks across editor, terminal, and filesystem. Features agent manager & editor shared workflows, natural language code commands, and configurable context-aware agents.",
      "url": "https://antigravity.google/",
      "source": "News",
      "category": "Autonomous Agent"
    },
    {
      "title": "Chad: The Brainrot IDE",
      "description": "Y Combinator-backed controversial AI-powered coding environment that pairs 'vibe coding' with entertainment activities like gambling, watching TikToks, and playing games while AI coding assistants work. Represents a unique approach to AI-assisted development with gamification elements.",
      "url": "https://howaiworks.ai/blog/chad-brainrot-ide-y-combinator-2025",
      "source": "News",
      "category": "IDE"
    },
    {
      "title": "Meta DevMate",
      "description": "Meta's sophisticated AI coding assistant that goes beyond code completion. Scans entire codebases, suggests fixes, refactors legacy code, and performs debugging. Integrates models from multiple providers including Anthropic's Claude, offering advanced coding assistance and program analysis.",
      "url": "https://aiseotoolshub.com/news/meta-devmate-ai-coding-assistant-claude/",
      "source": "News",
      "category": "IDE Extension"
    },
    {
      "title": "Microsoft Agent Framework",
      "description": "Microsoft's open-source framework for building, orchestrating, and deploying AI agents and multi-agent workflows with support for Python and .NET. Includes VS Code AI Toolkit integration and Azure AI Foundry Agent Service for managed runtime hosting of agents and multi-agent workflows.",
      "url": "https://github.com/microsoft/agent-framework",
      "source": "News",
      "category": "Framework"
    },
    {
      "title": "Windsurf Cascade",
      "description": "Formerly Codeium, Windsurf features Cascade - an AI agent that codes, fixes, and thinks 10 steps ahead. Enhanced AI-native IDE with Fast Context technology, improved third-party extension diagnostics, and collaborative flow between developers and AI.",
      "url": "https://windsurf.com/",
      "source": "Product Update",
      "category": "IDE"
    },
    {
      "title": "AI Toolkit Extension Pack for VS Code",
      "description": "Microsoft's comprehensive VS Code extension for building next-generation agentic AI applications. Streamlined experience for building with Microsoft Agent Framework, enabling developers to create powerful AI agents and workflows directly within VS Code.",
      "url": "https://techcommunity.microsoft.com/blog/azuredevcommunityblog/ai-toolkit-extension-pack-for-visual-studio-code-ignite-2025-update/4471050",
      "source": "News",
      "category": "IDE Extension"
    },
    {
      "title": "Google AI Studio Build",
      "description": "Part of Google's Gemini 3 launch, this online AI coding tool helps developers quickly turn ideas into runnable web applications. Features 'vibe coding' capabilities and integrates with Antigravity for comprehensive development workflows.",
      "url": "https://aistudio.google.com/",
      "source": "News",
      "category": "CLI Tool"
    }
  ],
  "whitelistUpdates": [
    {
      "productName": "Claude Code",
      "title": "Advanced Tool Use and Autonomy Features",
      "description": "Added three new beta features that let Claude discover, learn, and use tools more autonomously, along with improved status visibility and searchable prompt history (Ctrl+r)",
      "updateType": "feature",
      "url": "https://www.anthropic.com/engineering/advanced-tool-use",
      "date": "2025-11-24"
    },
    {
      "productName": "Cursor",
      "title": "Cursor 2.0 with Composer AI Model",
      "description": "Major update introducing Cursor's own frontier coding model called Composer and a redesigned interface built around agentic workflows with multi-agent support",
      "updateType": "release",
      "url": "https://cursor.com/blog/2-0",
      "date": "2025-10-29"
    },
    {
      "productName": "GitHub Copilot",
      "title": "Agent Mode and Planning Features",
      "description": "New Agent Mode for handling larger, multi-step coding tasks with structured reasoning, plus planning features in Copilot Chat and unified agent experience in VS Code",
      "updateType": "feature",
      "url": "https://code.visualstudio.com/blogs/2025/11/03/unified-agent-experience",
      "date": "2025-11-03"
    },
    {
      "productName": "Windsurf",
      "title": "Falcon Alpha Model and Cascade Hooks",
      "description": "Introduced Falcon Alpha, a new stealth agentic model designed for speed, and made Cascade Hooks feature available to all tiers for enhanced workflow automation",
      "updateType": "feature",
      "url": "https://windsurf.com/changelog",
      "date": "2025-10-25"
    },
    {
      "productName": "Devin",
      "title": "DeepWiki Codemaps Interactive Visualization",
      "description": "Added interactive code visualization in DeepWiki, allowing developers to explore codebases visually with intuitive mode switching for repository documentation",
      "updateType": "feature",
      "url": "https://docs.devin.ai/release-notes/overview",
      "date": "2025-10-24"
    },
    {
      "productName": "Continue",
      "title": "Instant Edits and GPT-5 Codex Support",
      "description": "Added Instant Edits functionality, GPT-5 Codex support, and Grok Code Fast 1 integration for enhanced coding performance and developer experience",
      "updateType": "feature",
      "url": "https://changelog.continue.dev/",
      "date": "2025-11-03"
    },
    {
      "productName": "Aider",
      "title": "Tree-sitter Language Pack Integration",
      "description": "Major upgrade adding support for 130 new languages with linter support and 20 new languages with repo-map capabilities through tree-sitter-language-pack adoption",
      "updateType": "feature",
      "url": "https://aider.chat/HISTORY.html",
      "date": "2025-10-15"
    }
  ],
  "insights": [],
  "generatedAt": "2025-11-29T06:11:09.493Z"
}