[
  {
    "title": "Your job is to deliver code you have proven to work",
    "description": "Willison argues that regardless of AI assistance, developers' fundamental responsibility remains delivering proven, working code. He warns against the 'depressing anecdote' of junior engineers relying on AI tools without proper verification, emphasizing that coding agents still require skilled operators who understand how to test and validate code functionality.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/18/code-proven-to-work/",
    "published_date": "2025-12-18",
    "topics": ["AI coding", "coding agents", "code verification", "developer responsibility"],
    "type": "opinion"
  },
  {
    "title": "The State of AI Coding Report 2025",
    "description": "Comprehensive report from an AI code review agent analyzing about a billion lines of code across 2,000 companies including PostHog, Brex, and Partiful. The report provides insights into how AI tools are being used in production and their impact on code quality and development workflows.",
    "author": "Hacker News Community",
    "source": "Community",
    "url": "https://news.ycombinator.com/item?id=46301886",
    "published_date": "2025-12-18",
    "topics": ["AI code review", "code quality", "production AI usage", "development metrics"],
    "type": "discussion"
  },
  {
    "title": "AWS CEO says replacing junior devs with AI is 'one of the dumbest' ideas",
    "description": "Discussion defending the value of junior developers beyond being 'cheap hands on keyboards.' The community debates the limitations of AI in replacing human developers' learning process, creativity, and long-term team value.",
    "author": "Hacker News Community",
    "source": "Community",
    "url": "https://news.ycombinator.com/item?id=46302267",
    "published_date": "2025-12-18",
    "topics": ["junior developers", "AI limitations", "developer value", "team dynamics"],
    "type": "discussion"
  },
  {
    "title": "Skills and Progressive Disclosure in AI-Assisted Development",
    "description": "Insights from OpenAI Codex CLI showing a structured approach to using skills with progressive disclosure. The workflow emphasizes reading just enough documentation, loading only necessary files, and reusing existing templates instead of recreating from scratch.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/13/",
    "published_date": "2025-12-13",
    "topics": ["AI coding", "prompt engineering", "progressive disclosure", "Codex CLI", "skill systems"],
    "type": "technical"
  },
  {
    "title": "When coding becomes the least interesting part of the work",
    "description": "Obie Fernandez explores how AI agents are changing the programming experience. For experienced developers, agents clear space for decision-making and judgment while handling mechanical code expression. The debate centers on whether the value lies in writing code or in the architectural decisions and tradeoffs.",
    "author": "Simon Willison (quoting Obie Fernandez)",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/13/",
    "published_date": "2025-12-13",
    "topics": ["AI agents", "programming philosophy", "developer experience", "value proposition"],
    "type": "discussion"
  }
]