[
  {
    "title": "Your job is to deliver code you have proven to work",
    "description": "Willison argues that regardless of AI assistance, developers' fundamental responsibility remains delivering proven, working code. He warns against the 'depressing anecdote' of junior engineers relying on AI tools without proper verification, emphasizing that coding agents still require skilled operators who understand how to test and validate code functionality.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/18/code-proven-to-work/",
    "published_date": "2025-12-18",
    "topics": ["AI coding", "coding agents", "code verification", "developer responsibility"],
    "type": "opinion"
  },
  {
    "title": "The State of AI Coding Report 2025",
    "description": "Comprehensive report from an AI code review agent analyzing about a billion lines of code across 2,000 companies including PostHog, Brex, and Partiful. The report provides insights into how AI tools are being used in production and their impact on code quality and development workflows.",
    "author": "Hacker News Community",
    "source": "Community",
    "url": "https://news.ycombinator.com/item?id=46301886",
    "published_date": "2025-12-18",
    "topics": ["AI code review", "code quality", "production AI usage", "development metrics"],
    "type": "discussion"
  },
  {
    "title": "AWS CEO says replacing junior devs with AI is 'one of the dumbest' ideas",
    "description": "Discussion defending the value of junior developers beyond being 'cheap hands on keyboards.' The community debates the limitations of AI in replacing human developers' learning process, creativity, and long-term team value.",
    "author": "Hacker News Community",
    "source": "Community",
    "url": "https://news.ycombinator.com/item?id=46302267",
    "published_date": "2025-12-18",
    "topics": ["junior developers", "AI limitations", "developer value", "team dynamics"],
    "type": "discussion"
  },
  {
    "title": "AI Dev Tool Power Rankings & Comparison - December 2025",
    "description": "Updated rankings showing Gemini 3 Pro as the new performance leader and Claude Sonnet 4.5 as the consistency champion. The analysis includes detailed comparisons of AI coding assistants' capabilities, pricing, and real-world performance metrics.",
    "author": "LogRocket Blog",
    "source": "Blog",
    "url": "https://blog.logrocket.com/ai-dev-tool-power-rankings/",
    "published_date": "2025-12-15",
    "topics": ["AI benchmarks", "Gemini 3 Pro", "Claude Sonnet 4.5", "developer productivity"],
    "type": "technical"
  },
  {
    "title": "Ask HN: How can I get better at using AI for programming?",
    "description": "Community discussion sharing best practices for AI-assisted programming. Key suggestions include having LLMs create development plans, tackling each step in separate conversations, and using AI for specific problems rather than entire projects.",
    "author": "Hacker News Community",
    "source": "Community",
    "url": "https://news.ycombinator.com/item?id=46255285",
    "published_date": "2025-12-14",
    "topics": ["AI best practices", "programming workflows", "LLM techniques"],
    "type": "discussion"
  },
  {
    "title": "Google's Vibe-Coding Play: Replit CEO Amjad Masad Discusses AI Partnership",
    "description": "Masad discusses Replit's partnership with Google Cloud and the future of AI coding tools. After nine years of development, Replit has found its market in the AI era, enabling anyone to build apps in 60 seconds from their phone. The discussion covers how AI is democratizing software development and changing who can create applications.",
    "author": "Amjad Masad",
    "source": "Podcast",
    "url": "https://podscan.fm/podcasts/techcheck/episodes/googles-vibe-coding-play-12425",
    "published_date": "2025-12-04",
    "topics": ["AI coding", "Replit", "Google Cloud partnership", "democratized development"],
    "type": "discussion"
  },
  {
    "title": "Best AI Tools for Coding in December 2025: Complete Guide",
    "description": "Comprehensive review of AI coding tools including Antigravity, Cursor, Claude Code, GPT‑5.1, and Copilot. The guide covers AI testing pipelines, integration capabilities, and performance benchmarks, highlighting how these tools are shaping the future of software development.",
    "author": "ThePromptBuddy",
    "source": "Blog",
    "url": "https://www.thepromptbuddy.com/prompts/best-ai-tools-for-coding-in-december-2025-complete-guide-to-ai-powered-development",
    "published_date": "2025-12-01",
    "topics": ["AI coding tools", "developer tools", "AI benchmarks", "Antigravity", "Cursor"],
    "type": "technical"
  },
  {
    "title": "How to make vibe coding not suck… 7 MCP Servers Every Developer Needs",
    "description": "Fireship breaks down how to improve AI-assisted development using Model Context Protocol (MCP) servers. The video provides practical tools and techniques to make AI coding more effective, addressing common frustrations with current AI coding assistants and offering concrete solutions for better developer experience.",
    "author": "Fireship",
    "source": "YouTube",
    "url": "https://www.youtube.com/watch?v=PLKrSVuT-Dg",
    "published_date": "2025-10-19",
    "topics": ["AI coding", "vibe coding", "MCP servers", "developer tools"],
    "type": "tutorial"
  },
  {
    "title": "Vibe Coding: Andrej Karpathy's AI-Assisted Development Paradigm",
    "description": "Karpathy's 'vibe coding' approach gained mainstream recognition in 2025, describing a method where developers 'fully give in to the vibes' and work conversationally with AI models to build applications without examining the underlying code. The approach eliminates manual coding and focuses on iterative experimentation through natural language instructions.",
    "author": "Andrej Karpathy",
    "source": "Blog | Wikipedia | Twitter",
    "url": "https://en.wikipedia.org/wiki/Vibe_coding",
    "published_date": "2025-09-02",
    "topics": ["AI coding", "LLM development", "vibe coding", "Software 3.0"],
    "type": "technical"
  }
]