[
  {
    "name": "Xcode 26.3",
    "url": "https://apple.com/xcode",
    "description": "Apple's major IDE update unlocking 'agentic coding' capabilities, allowing developers to harness agents like Anthropic's Claude Agent and OpenAI's Codex directly within Xcode to tackle complex tasks autonomously.",
    "release_date": "2026-02-03",
    "category": "AI IDE",
    "sources": ["Apple Newsroom", "Apple Developer Documentation", "InfoQ"],
    "community_quotes": [
      "Xcode 26.3 unlocks the power of agentic coding",
      "Developers can harness agents like Anthropic's Claude Agent and OpenAI's Codex directly in Xcode",
      "AI agents can autonomously navigate projects, generate code, and run tasks"
    ]
  },
  {
    "name": "Claude Opus 4.6",
    "url": "https://anthropic.com/claude",
    "description": "Anthropic's latest model release featuring 1 million token context window and 'Agent Teams' functionality that enables multiple AI agents to work in parallel on complex coding tasks.",
    "release_date": "2026-02-05",
    "category": "AI coding agent",
    "sources": ["VentureBeat", "SD Times", "LinkedIn"],
    "community_quotes": [
      "Anthropic's Claude Opus 4.6 brings 1M token context and agent teams",
      "Enhanced code reasoning and multi-file editing capabilities"
    ]
  },
  {
    "name": "GPT-5.3-Codex",
    "url": "https://openai.com/codex",
    "description": "OpenAI's latest specialized coding agent, released as part of the February 2026 wave of agentic AI tools. Focuses on autonomous code generation and software development tasks.",
    "release_date": "2026-02-05",
    "category": "AI coding agent",
    "sources": ["TeamDay Blog", "NotebookCheck", "Instagram"],
    "community_quotes": [
      "GPT-5.3-Codex is the shift from 'AI wrote code' to AI completes work",
      "The day AI coding jumped the shark"
    ]
  },
  {
    "name": "GitHub Agent HQ",
    "url": "https://github.com/features/agent-hq",
    "description": "Platform that unites Claude and Codex directly in GitHub & VS Code. Brings order to AI-powered coding by providing centralized agent management with governance, security, and audit capabilities. Public preview launched for Copilot Pro+ and Enterprise subscribers.",
    "release_date": "2026-02-04",
    "category": "AI coding CLI",
    "sources": ["GitHub Blog", "InfoWorld", "DEVOPSdigest"],
    "community_quotes": [
      "Pick your agent: Use Claude and Codex on Agent HQ",
      "GitHub previews support for Claude and Codex coding agents"
    ]
  },
  {
    "name": "OpenAI Codex App for macOS",
    "url": "https://openai.com/codex-app",
    "description": "Standalone AI coding workspace designed specifically for agent-based software development. Functions as a desktop command center with multi-agent workflows, running multiple AI coding agents in parallel.",
    "release_date": "2026-02-02",
    "category": "AI IDE",
    "sources": ["dplooy Blog", "LinkedIn"],
    "community_quotes": [
      "OpenAI Codex App Launch: Agentic Coding Revolution",
      "Desktop command center for AI coding with multi-agent workflows"
    ]
  },
  {
    "name": "cursor-agent-factory",
    "url": "https://github.com/gitwalter/cursor-agent-factory",
    "description": "Configurable factory for generating Cursor IDE development agent systems. Creates .cursorrules, agents, skills, workflows, and templates to orchestrate AI agents within Cursor development environment.",
    "release_date": "2026-02-01",
    "category": "open-source AI coding agent",
    "sources": ["GitHub"],
    "community_quotes": []
  }
]
