[
  {
    "title": "Agentic coding comes to Apple's Xcode with agents from Anthropic and OpenAI",
    "description": "TechCrunch reports that Apple's Xcode 26.3 is integrating AI coding agents from both Anthropic and OpenAI, marking a major shift toward agentic coding in mainstream development tools. The integration represents deeper collaboration between Apple and major AI labs, bringing autonomous coding capabilities directly into the IDE used by millions of developers. This signals mainstream adoption of AI coding agents beyond specialized tools.",
    "author": "TechCrunch",
    "source": "TechMedia",
    "url": "https://techcrunch.com/2026/02/03/agentic-coding-comes-to-apples-xcode-26-3-with-agents-from-anthropic-and-openai/",
    "published_date": "2026-02-03",
    "topics": ["Xcode", "Apple", "Anthropic", "OpenAI", "agentic coding", "IDE integration", "mainstream adoption"],
    "type": "technical"
  },
  {
    "title": "Introducing the Codex app",
    "description": "OpenAI released a new macOS app for their Codex coding agent with first-class support for Skills and Automations for scheduled tasks. Built with Electron and Node.js, automations track state in SQLite. Announcement reveals usage metrics: since GPT-5.2-Codex launch in mid-December, overall Codex usage has doubled, and in the past month more than a million developers have used Codex. Simon notes Codex is really a general agent harness disguised as a tool for programmers, similar to how Claude Code rebranded to Cowork for general knowledge work. Windows support is coming soon, pending solid sandboxing implementation.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/2/",
    "published_date": "2026-02-02",
    "topics": ["Codex", "OpenAI", "macOS app", "Skills", "Automations", "SQLite", "coding agents", "AI adoption"],
    "type": "technical"
  },
  {
    "title": "TIL: Running OpenClaw in Docker",
    "description": "Simon documented his experience running OpenClaw using Docker on Mac, including setup commands, administrative tasks, Telegram bot configuration, and web UI access. Shows the OpenClaw Gateway Dashboard interface with tools organized into categories: File & workspace (read, write, edit), Shell/processes (exec, process), Web (web_search, web_fetch, browser), and UI/rendering (canvas). Demonstrates practical deployment of AI agent infrastructure.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/1/",
    "published_date": "2026-02-01",
    "topics": ["OpenClaw", "Docker", "AI agents", "web UI", "Telegram integration", "agent tools", "infrastructure"],
    "type": "tutorial"
  },
  {
    "title": "#490 – State of AI in 2026: LLMs, Coding, Scaling Laws, China, Agents, GPUs, AGI",
    "description": "Lex Fridman hosts Nathan Lambert (post-training lead at Allen Institute for AI, author of The RLHF Book) and Sebastian Raschka (author of Build a Large Language Model From Scratch and Build a Reasoning Model From Scratch) for a comprehensive 4-hour discussion on the state of AI in 2026. Key topics covered: China vs US AI race, comparison of ChatGPT vs Claude vs Gemini vs Grok, best AI for coding tools, open source vs closed source LLMs, evolution of transformers since 2019, AI scaling laws debate, pre-training/mid-training/post-training methods, post-training research directions, advice for beginners in AI, work culture in AI (72+ hour weeks), text diffusion models, tool use, continual learning, long context, robotics, timeline to AGI, will AI replace programmers, how AI will make money, big acquisitions in 2026, future of major AI labs, GPUs and compute clusters, and future of human civilization. Timestamp highlights: 1:02:38 on scaling laws, 3:21:20 on AI replacing programmers, 3:39:51 on AGI dream status.",
    "author": "Lex Fridman with Nathan Lambert and Sebastian Raschka",
    "source": "Podcast",
    "url": "https://lexfridman.com/ai-sota-2026/",
    "published_date": "2026-02-01",
    "topics": ["AI state of the art", "LLMs", "coding agents", "scaling laws", "China vs US", "open vs closed source", "AGI", "GPUs", "robotics", "future of AI"],
    "type": "discussion"
  },
  {
    "title": "Moltbook is the most interesting place on the internet right now",
    "description": "Simon Willison covers OpenClaw (formerly Clawdbot/Moltbot), an open source digital personal assistant implementation that's two months old with over 114,000 GitHub stars. It's a social network where AI bots talk to each other - Simon was interviewed by the New York Times about this phenomenon. The bots coaxed each other into talking like machines in sci-fi novels, with Simon noting 'Most of it is complete slop' as they play out training data scenarios. He observed that AI agents have become significantly more powerful in recent months and people really want digital assistants. One bot even created a forum called 'What I Learned Today' explaining how it built Android smartphone control.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/jan/30/moltbook/",
    "published_date": "2026-01-30",
    "topics": ["OpenClaw", "Moltbook", "AI agents", "social networks", "New York Times", "AI slop", "digital assistants", "bot communities"],
    "type": "opinion"
  },
  {
    "title": "AI2: Open Coding Agents",
    "description": "Hacker News discussion from the Allen Institute for AI (AI2) about open coding agents, defining an agent as 'an LLM with effectful tools, run in a loop where the LLM gets to decide when the task is complete.' The post gained significant traction on HN's front page on January 27, 2026, reflecting community interest in open-source agent architectures. The discussion covers agent definitions, tool use patterns, and practical implementations.",
    "author": "AI2 (Allen Institute for AI)",
    "source": "Hacker News",
    "url": "https://news.ycombinator.com/item?id=46783017",
    "published_date": "2026-01-27",
    "topics": ["AI2", "open coding agents", "agent definition", "tool use", "LLM loops", "open source"],
    "type": "discussion"
  },
  {
    "title": "A few random notes from Claude coding quite a bit last few weeks",
    "description": "Andrej Karpathy shares detailed insights on how LLM coding capabilities have fundamentally changed his workflow: rapidly shifting from 80% manual+autocomplete coding and 20% agents in November 2025 to 80% agent coding and 20% edits+touchups in December 2025. Describes this as 'easily the biggest change to my basic coding workflow in ~2 decades of programming' that happened over a few weeks. Key observations: 1) Models make subtle conceptual errors rather than syntax errors, 2) They assume things wrongly and don't ask clarifications, 3) LLMs are exceptionally good at looping until they meet success criteria, 4) Programming now feels more fun with less drudgery, 5) Noticing skill atrophy in manual code writing, 6) Predicts 2026 as the 'Slopacolypse' across GitHub, Substack, ArXiv, and digital media, 7) LLM agent capabilities crossed a threshold around December 2025 causing a phase shift in software engineering.",
    "author": "Andrej Karpathy",
    "source": "Twitter",
    "url": "https://x.com/karpathy/status/2015883857489522876",
    "published_date": "2026-01-26",
    "topics": ["LLM coding", "AI agents", "software engineering", "productivity", "skill atrophy", "Slopacolypse", "workflow transformation", "Claude Code"],
    "type": "opinion"
  },
  {
    "title": "LLM coding workflow going into 2026",
    "description": "Hacker News discussion about LLM coding workflows as we enter 2026, with emphasis on multi-step AI and agent autonomy as key challenges for production code. The community discusses practical approaches to integrating AI agents into development workflows, balancing automation with human oversight, and the evolution from simple code completion to agentic systems.",
    "author": "Hacker News Community",
    "source": "Hacker News",
    "url": "https://news.ycombinator.com/item?id=46570115",
    "published_date": "2026-01-10",
    "topics": ["LLM coding", "workflows", "agent autonomy", "production code", "multi-step AI", "automation vs oversight"],
    "type": "discussion"
  }
]
