[
  {
    "name": "Opsera Agentic DevOps",
    "url": "https://www.opsera.io/",
    "description": "AI-powered DevOps platform with CI/CD and AutoInfra capabilities. Features agents that learn from every deployment and incident to optimize delivery pipelines.",
    "release_date": "2026-01-27",
    "category": "CI/CD automation agent",
    "sources": ["SD Times", "LinkedIn"],
    "community_quotes": [
      "Agents learn from every deployment and incident",
      "AI-powered delivery with CI/CD and AutoInfra",
      "Address AI-assisted coding issues in DevOps workflows"
    ]
  },
  {
    "name": "JDoodle.ai 2.0",
    "url": "https://www.jdoodle.ai/",
    "description": "AI-powered website builder that allows cloning websites from URLs or converting Figma designs and images into editable starting points. Includes built-in database, automatic free bug fixes, and pay-as-you-go pricing.",
    "release_date": "2026-01-26",
    "category": "Vibe coding builder",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Clone websites and Figma designs into editable sites",
      "See a website you like? Start from it",
      "A faster, simpler way to launch without starting from scratch"
    ]
  },
  {
    "name": "Doctective",
    "url": "https://doctective.dev/",
    "description": "Automated documentation tool that auto-updates all documentation from code, ensuring docs never go stale. Install once and have documentation that stays accurate as code changes.",
    "release_date": "2026-01-26",
    "category": "Documentation automation",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Stop Updating Documentation. We Do It Accurately For You",
      "Install once, document forever",
      "Auto-updates all your documentation from your code"
    ]
  },
  {
    "name": "Verdent",
    "url": "https://verdent.dev/",
    "description": "An AI coding assistant built for deep focus with a clean, chat-first experience and no distractions. It asks clarifying questions early, helps developers handle multiple tasks at once, and clearly shows what changed in code.",
    "release_date": "2026-01-26",
    "category": "AI coding assistant",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Your AI-native partner for the new way to build software",
      "Bring the joy back to coding with deep focus",
      "Shows what changed in your code so you can spend more time creating"
    ]
  },
  {
    "name": "Zenflow by Zencoder",
    "url": "https://zencoder.ai/",
    "description": "A specification-driven AI orchestration platform that brings engineering discipline to AI coding with multi-agent verification and structured workflows to end 'vibe coding'. Coordinates multiple AI agents to produce verified, production-grade results.",
    "release_date": "2026-01-22",
    "category": "AI orchestration platform",
    "sources": ["Product Hunt", "VentureBeat", "SD Times"],
    "community_quotes": [
      "Zencoder drops Zenflow, a free AI orchestration tool that pits Claude against other models",
      "Brings engineering discipline to AI coding by ending the era of vibe coding",
      "Multi-agent verification compounds quality instead of degrading it"
    ]
  },
  {
    "name": "Demonstrate by Notte",
    "url": "https://www.notte.cc/",
    "description": "Browser workflow automation platform that converts manual browser actions into reliable cloud automation through a 'teach by demonstration' approach. Features an open-source framework for building and deploying web-based AI agents at scale.",
    "release_date": "2026-01-22",
    "category": "Browser automation agent",
    "sources": ["Product Hunt", "Show HN", "GitHub"],
    "community_quotes": [
      "Build Web Automations via Demonstration - captures every browser interaction",
      "Converts browser clicks into reliable cloud automation instantly",
      "Full-stack framework combining AI for building and deploying AI agents"
    ]
  },
  {
    "name": "InsForge",
    "url": "https://insforge.dev/",
    "description": "AI-native backend platform specifically designed for AI coding agents, providing databases, authentication, storage, serverless functions, and AI capabilities through MCP (Model Context Protocol) server integration.",
    "release_date": "2026-01-22",
    "category": "Backend platform for AI agents",
    "sources": ["Product Hunt", "GitHub", "LinkedIn"],
    "community_quotes": [
      "Backend primitives built for AI agents, not humans",
      "Exposes backend through MCP server for structured access",
      "Transforms coding agents into full-stack builders that can ship real apps in seconds"
    ]
  },
  {
    "name": "Harness Incident Response AI Agent",
    "url": "https://www.harness.io/",
    "description": "AI agent specifically trained to help DevOps teams investigate incidents. Automates incident response and provides intelligent analysis.",
    "release_date": "2026-01-20",
    "category": "Incident response agent",
    "sources": ["DevOps.com"],
    "community_quotes": [
      "AI agent trained to investigate incidents",
      "Helps DevOps teams respond faster",
      "Automated incident investigation and analysis"
    ]
  }
]
