[
  {
    "name": "Zenflow by Zencoder",
    "url": "https://zencoder.ai/",
    "description": "A specification-driven AI orchestration platform that brings engineering discipline to AI coding with multi-agent verification and structured workflows to end 'vibe coding'. Coordinates multiple AI agents to produce verified, production-grade results.",
    "release_date": "2026-01-22",
    "category": "AI orchestration platform",
    "sources": ["Product Hunt", "VentureBeat", "SD Times"],
    "community_quotes": [
      "Zencoder drops Zenflow, a free AI orchestration tool that pits Claude against other models",
      "Brings engineering discipline to AI coding by ending the era of vibe coding",
      "Multi-agent verification compounds quality instead of degrading it"
    ]
  },
  {
    "name": "Demonstrate by Notte",
    "url": "https://www.notte.cc/",
    "description": "Browser workflow automation platform that converts manual browser actions into reliable cloud automation through a 'teach by demonstration' approach. Features an open-source framework for building and deploying web-based AI agents at scale.",
    "release_date": "2026-01-22",
    "category": "Browser automation agent",
    "sources": ["Product Hunt", "Show HN", "GitHub"],
    "community_quotes": [
      "Build Web Automations via Demonstration - captures every browser interaction",
      "Converts browser clicks into reliable cloud automation instantly",
      "Full-stack framework combining AI for building and deploying AI agents"
    ]
  },
  {
    "name": "InsForge",
    "url": "https://insforge.dev/",
    "description": "AI-native backend platform specifically designed for AI coding agents, providing databases, authentication, storage, serverless functions, and AI capabilities through MCP (Model Context Protocol) server integration.",
    "release_date": "2026-01-22",
    "category": "Backend platform for AI agents",
    "sources": ["Product Hunt", "GitHub", "LinkedIn"],
    "community_quotes": [
      "Backend primitives built for AI agents, not humans",
      "Exposes backend through MCP server for structured access",
      "Transforms coding agents into full-stack builders that can ship real apps in seconds"
    ]
  },
  {
    "name": "Web search API by Crustdata",
    "url": "https://crustdata.com/",
    "description": "Web search API specifically designed for AI agents with real-time data retrieval, domain filtering, and structured output for RAG (Retrieval-Augmented Generation) workflows.",
    "release_date": "2026-01-22",
    "category": "Developer API for AI agents",
    "sources": ["Product Hunt", "LinkedIn"],
    "community_quotes": [
      "The fastest and most accurate web search interface for intelligent agents",
      "Web search APIs are becoming core infrastructure for AI development",
      "Gives AI agents real-time web results with structured, production-ready data"
    ]
  }
]
