[
  {
    "title": "uv-init-demos: Using GitHub Actions and Claude Code for automated project demos",
    "description": "Simon Willison created a GitHub repository demonstrating different options of the `uv init` command for setting up Python projects. The repository was generated using an update-projects.sh script (built with help from Claude) that runs on a schedule via GitHub Actions to capture any changes made by future releases of uv. This showcases the pattern of combining AI coding tools with automation for documentation and testing.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/24/uv-init-demos/",
    "published_date": "2025-12-24",
    "topics": ["projects", "python", "github-actions", "git-scraping", "uv", "ai", "claude-code", "automation"],
    "type": "technical"
  },
  {
    "title": "How AI coding agents work—and what to remember if you use them",
    "description": "Comprehensive technical deep-dive into how AI coding agents function under the hood. Explains the multi-agent architecture (supervising LLM that delegates to parallel LLMs with tools), context management challenges ('context rot' and diminishing returns), context compression techniques to handle token limits, and the orchestrator-worker pattern. Highlights that agents typically use 4x more tokens than chatbots, and multi-agent systems use 15x more. Warns against 'vibe coding' for production and emphasizes human planning and oversight. Includes METR study finding experienced developers were actually 19% slower with AI tools despite believing they were faster.",
    "author": "Benj Edwards",
    "source": "TechMedia",
    "url": "https://arstechnica.com/information-technology/2025/12/how-do-ai-coding-agents-work-we-look-under-the-hood/",
    "published_date": "2025-12-24",
    "topics": ["ai-agents", "ai-coding", "anthropic", "claude-code", "codex", "context-windows", "large-language-models", "openai", "programming-2", "software-development", "vibe-coding"],
    "type": "technical"
  },
  {
    "title": "MicroQuickJS as a robust sandbox for LLM-generated code",
    "description": "Simon Willison used Claude Code to conduct an asynchronous research project investigating MicroQuickJS (a tiny JavaScript engine for embedded systems) as a potential sandboxing environment for running untrusted code from LLMs. Key findings: MicroQuickJS is very well suited for sandboxing with robust memory/time limits, no filesystem or network access, and a regex engine that protects against exhaustion attacks. Claude successfully built and tested Python libraries, WebAssembly versions for Node.js, Deno, and Pyodide, and created an interactive web playground.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/23/microquickjs/",
    "published_date": "2025-12-23",
    "topics": ["sandboxing", "javascript", "python", "webassembly", "ai", "claude-code", "llms", "security"],
    "type": "technical"
  },
  {
    "title": "Cooking with Claude: Vibe-coding custom applications",
    "description": "Simon Willison describes using LLMs (Claude) for cooking, progressing from basic recipes to advanced tasks. Most notably, he had Claude 'vibe-code up a custom application' to help with timing for complicated meal preparation. This demonstrates the emerging pattern of using AI coding agents to quickly build ephemeral, single-purpose tools tailored to specific needs.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/23/cooking-with-claude/",
    "published_date": "2025-12-23",
    "topics": ["cooking", "tools", "ai", "generative-ai", "llms", "anthropic", "claude", "vision-llms", "vibe-coding"],
    "type": "opinion"
  },
  {
    "title": "First successful use of browser agent (Claude in Chrome) to solve real problem",
    "description": "Simon Willison successfully used the Claude in Chrome extension to navigate the Cloudflare dashboard and find how CORS policies were configured for a specific directory. The agent took 1m45s to locate the exact Transform Rule needed. While Simon remains skeptical of browser agents due to prompt injection risks and watched it 'like a hawk', he admits this was a very positive experience, demonstrating practical utility despite concerns.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/22/claude-chrome-cloudflare/",
    "published_date": "2025-12-22",
    "topics": ["anthropic", "claude", "browser-agents", "cors", "ai", "llms", "generative-ai", "chrome", "cloudflare", "prompt-injection", "ai-agents"],
    "type": "opinion"
  }
]
