[
  {
    "title": "A new way to extract detailed transcripts from Claude Code",
    "description": "Simon Willison released `claude-code-transcripts`, a Python CLI tool that converts Claude Code conversation transcripts into shareable HTML pages. The tool provides better interfaces for understanding what Claude Code did than Claude Code's own interface and includes features for GitHub Gists integration and reverse-engineering Claude Code's private API. Being able to have an idea on a walk and turn that into working, tested and documented code from a couple of prompts on a phone is described as 'a truly science fiction way of working.'",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/25/claude-code-transcripts/",
    "published_date": "2025-12-25",
    "topics": ["claude-code", "transcripts", "python", "cli-tools", "api-reverse-engineering", "ai-workflows", "documentation"],
    "type": "technical"
  },
  {
    "title": "uv-init-demos: Using GitHub Actions and Claude Code for automated project demos",
    "description": "Simon Willison created a GitHub repository demonstrating different options of the `uv init` command for setting up Python projects. The repository was generated using an update-projects.sh script (built with help from Claude) that runs on a schedule via GitHub Actions to capture any changes made by future releases of uv. This showcases the pattern of combining AI coding tools with automation for documentation and testing.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/24/uv-init-demos/",
    "published_date": "2025-12-24",
    "topics": ["projects", "python", "github-actions", "git-scraping", "uv", "ai", "claude-code", "automation"],
    "type": "technical"
  },
  {
    "title": "How AI coding agents work—and what to remember if you use them",
    "description": "Comprehensive technical deep-dive into how AI coding agents function under the hood. Explains the multi-agent architecture (supervising LLM that delegates to parallel LLMs with tools), context management challenges ('context rot' and diminishing returns), context compression techniques to handle token limits, and the orchestrator-worker pattern. Highlights that agents typically use 4x more tokens than chatbots, and multi-agent systems use 15x more. Warns against 'vibe coding' for production and emphasizes human planning and oversight. Includes METR study finding experienced developers were actually 19% slower with AI tools despite believing they were faster.",
    "author": "Benj Edwards",
    "source": "TechMedia",
    "url": "https://arstechnica.com/information-technology/2025/12/how-do-ai-coding-agents-work-we-look-under-the-hood/",
    "published_date": "2025-12-24",
    "topics": ["ai-agents", "ai-coding", "anthropic", "claude-code", "codex", "context-windows", "large-language-models", "openai", "programming", "software-development", "vibe-coding"],
    "type": "technical"
  },
  {
    "title": "MicroQuickJS as a robust sandbox for LLM-generated code",
    "description": "Simon Willison used Claude Code to conduct an asynchronous research project investigating MicroQuickJS (a tiny JavaScript engine for embedded systems) as a potential sandboxing environment for running untrusted code from LLMs. Key findings: MicroQuickJS is very well suited for sandboxing with robust memory/time limits, no filesystem or network access, and a regex engine that protects against exhaustion attacks. Claude successfully built and tested Python libraries, WebAssembly versions for Node.js, Deno, and Pyodide, and created an interactive web playground.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/23/microquickjs/",
    "published_date": "2025-12-23",
    "topics": ["sandboxing", "javascript", "python", "webassembly", "ai", "claude-code", "llms", "security"],
    "type": "technical"
  },
  {
    "title": "Cooking with Claude: Vibe-coding custom applications",
    "description": "Simon Willison describes using LLMs (Claude) for cooking, progressing from basic recipes to advanced tasks. Most notably, he had Claude 'vibe-code up a custom application' to help with timing for complicated meal preparation. This demonstrates the emerging pattern of using AI coding agents to quickly build ephemeral, single-purpose tools tailored to specific needs.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/23/cooking-with-claude/",
    "published_date": "2025-12-23",
    "topics": ["cooking", "tools", "ai", "generative-ai", "llms", "anthropic", "claude", "vision-llms", "vibe-coding"],
    "type": "opinion"
  },
  {
    "title": "AI Code in the Wild: Measuring Security Risks and Ecosystem Shifts",
    "description": "Research paper analyzing security implications and ecosystem impacts of AI-generated code in real-world software projects. The study examines how AI coding tools are changing software development practices and identifies potential security vulnerabilities introduced by AI-generated code.",
    "author": "Research Team",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2512.18567",
    "published_date": "2025-12-23",
    "topics": ["ai-security", "code-generation", "llms", "software-ecosystem", "security-research", "ai-coding"],
    "type": "technical"
  },
  {
    "title": "Top 18 AI Coding Assistant Tools in 2025",
    "description": "Comprehensive overview and comparison of AI coding assistants available to developers in 2025. Covers major tools including Claude Code, Cursor, GitHub Copilot, and others, comparing their features, capabilities, and use cases.",
    "author": "Apidog Team",
    "source": "TechMedia",
    "url": "https://apidog.com/blog/top-ai-coding-assistant-tools/",
    "published_date": "2025-12-26",
    "topics": ["ai-coding", "tools-comparison", "developer-tools", "claude-code", "cursor", "github-copilot"],
    "type": "technical"
  },
  {
    "title": "AI agents arrived in 2025 – here's what happened and challenges ahead",
    "description": "Comprehensive analysis of how AI agents moved from theory to infrastructure in 2025. Discusses the major developments in AI agent technology, real-world applications, and the challenges that lie ahead for 2026. Covers the shift from chatbots to autonomous agents that can complete workflows.",
    "author": "The Conversation",
    "source": "TechMedia",
    "url": "https://theconversation.com/ai-agents-arrived-in-2025-heres-what-happened-and-the-challenges-ahead-in-2026-272325",
    "published_date": "2025-12-29",
    "topics": ["ai-agents", "autonomous-agents", "2025-review", "infrastructure", "chatbots", "workflow-automation"],
    "type": "opinion"
  },
  {
    "title": "Best Free AI Coding Tools 2025: ChatGPT vs Gemini",
    "description": "Detailed comparison of free AI coding tools available in 2025, specifically comparing ChatGPT and Google Gemini for code generation tasks. Analyzes their strengths, weaknesses, and best use cases for developers looking for free AI coding assistance.",
    "author": "Zoer.ai Team",
    "source": "TechMedia",
    "url": "https://zoer.ai/posts/zoer/best-free-ai-coding-tools-2025-4084",
    "published_date": "2025-12-27",
    "topics": ["ai-coding", "tools-comparison", "chatgpt", "gemini", "free-tools", "code-generation"],
    "type": "technical"
  }
]
