[
  {
    "productName": "Devin",
    "title": "Devin December '24 Product Update (Part 2) - General Availability",
    "description": "Devin is now generally available for all engineering teams at $500/month. The update made Devin ~10% faster and ~10% more cost-efficient, with fixes for crashing/stuck issues. Added customization options for session filters, PR comment controls, and Slack notifications. Introduced pinned and auto-updated Knowledge features.",
    "updateType": "release",
    "url": "https://cognition.ai/blog/dec-24-product-update-2",
    "date": "2024-12-20",
    "community_feedback": [
      {
        "quote": "Interesting as tech, but skeptical about the replacement narrative compared to human engineers.",
        "source": "HN",
        "sentiment": "neutral"
      },
      {
        "quote": "Described as a collaborative AI teammate that can be added to repos and Slack, useful for code reviews, refactoring, and catching bugs, but not a replacement for human engineers.",
        "source": "Reddit",
        "sentiment": "neutral"
      }
    ]
  },
  {
    "productName": "Windsurf",
    "title": "Changelist: December 2024 - Cascade Improvements",
    "description": "December 2024 brought a series of updates and refinements to Windsurf and Codeium for Enterprise, focused on improving Cascade on Windsurf. The update included various enhancements to the Cascade feature.",
    "updateType": "feature",
    "url": "https://windsurf.com/blog/changelist-dec24",
    "date": "2024-12-20",
    "community_feedback": [
      {
        "quote": "A cascade of errors, bugs, problems and lack of support started to happen in December 2024.",
        "source": "Reddit",
        "sentiment": "negative"
      },
      {
        "quote": "Subscribed to Pro Tier after being impressed during trial, but found Cascade 'practically unusable' after upgrading - a frustrating experience.",
        "source": "Reddit",
        "sentiment": "negative"
      },
      {
        "quote": "Excellent file structure creation for projects, ability to create and edit multiple files, faster response times, better context understanding compared to competitors.",
        "source": "Reddit",
        "sentiment": "positive"
      }
    ]
  },
  {
    "productName": "Cursor",
    "title": "Version 0.44 - Agent Updates, Chat Tabs, Custom Modes, and Performance Improvements",
    "description": "Released December 17, 2024. Introduced chat tabs for parallel conversations, custom modes (beta), built-in modes (Agent and Ask), faster indexing for similar codebases (Cursor repo now indexes in <1 minute vs 20 minutes), sound notifications on chat completion, usage-based cost visualization, and new onboarding flow. Also included memory and performance improvements, new themes, UI improvements, and MCP enhancements.",
    "updateType": "release",
    "url": "https://cursor.com/changelog",
    "date": "2024-12-17",
    "community_feedback": [
      {
        "quote": "0.44 is amazing! The new and improved agent is just something else - more consistent and less buggy. GPT-4o + Claude integration is great.",
        "source": "Reddit",
        "sentiment": "positive"
      },
      {
        "quote": "This update broke my cursor entirely. I can't open it - app restarted to 'take effects' but wouldn't open properly.",
        "source": "Cursor Forum",
        "sentiment": "negative"
      },
      {
        "quote": "Almost every single message in composer is causing breaking changes for me. Regretted upgrading and asked about alternatives like Cline or Windsurf.",
        "source": "Reddit",
        "sentiment": "negative"
      },
      {
        "quote": "Version 0.44.8 feels really good now - keeping scope minimal and modular, better project evolution understanding with updated context documents.",
        "source": "Cursor Forum",
        "sentiment": "positive"
      },
      {
        "quote": "YOLO Mode is amazing! Composer can write code, execute it in terminal, and fix bugs automatically without user input.",
        "source": "Cursor Forum",
        "sentiment": "positive"
      }
    ]
  },
  {
    "productName": "Aider",
    "title": "Version 0.67.0 - Watch Files Feature and Bedrock Nova Support",
    "description": "Released December 6, 2024. Added watch files feature - run 'aider --watch-files' to watch for instructions in source files using AI comments (// ... or # ... comments starting/ending with 'AI'). Support for new Amazon Bedrock Nova models. When /run or /test have non-zero exit codes, pre-fill 'Fix that' into next prompt. Added Ctrl-Z support for process suspension.",
    "updateType": "release",
    "url": "https://aider.chat/HISTORY.html",
    "date": "2024-12-06",
    "community_feedback": []
  },
  {
    "productName": "Aider",
    "title": "Version 0.66.0 - PDF Support and Voice Input Device Selection",
    "description": "Released December 1, 2024. Added PDF support for Sonnet and Gemini models. Added --voice-input-device to select audio input device for voice recording. Added --timeout option to configure API call timeouts. Set cwd to repo root when running shell commands. Added Ctrl-Up/Down keyboard shortcuts for per-message history navigation.",
    "updateType": "release",
    "url": "https://aider.chat/HISTORY.html",
    "date": "2024-12-01",
    "community_feedback": []
  }
]
