[
  {
    "name": "GPT-5.2-Codex",
    "url": "https://openai.com/index/introducing-gpt-5-2-codex/",
    "description": "OpenAI's most advanced agentic coding model, optimized for complex software engineering and defensive cybersecurity. Features state-of-the-art performance on SWE-Bench Pro and Terminal-Bench 2.0 with improved long-context understanding, reliable tool calling, and significantly stronger cybersecurity capabilities compared to previous models.",
    "release_date": "2025-12-18",
    "category": "AI coding model",
    "sources": ["OpenAI Official"],
    "community_quotes": [
      "Achieves state-of-the-art performance on SWE-Bench Pro and Terminal-Bench 2.0",
      "Significantly stronger cybersecurity capabilities than any previous OpenAI model",
      "Better at long-context understanding and reliable tool calling",
      "More effective at agentic coding in native Windows environments",
      "Can reliably complete complex tasks like large refactors and code migrations"
    ]
  },
  {
    "name": "IQuest Coder V1",
    "url": "https://github.com/IQuestLab/IQuest-Coder-V1",
    "description": "Open-source coding AI model family from Ubiquant's IQuest Lab featuring innovative Code-Flow training that learns from repository evolution patterns and commit transitions. Achieves state-of-the-art performance on major benchmarks including SWE-Bench Verified (81.4%), beating models 10-20x its size with only 40B parameters.",
    "release_date": "2026-01-01",
    "category": "Open-source AI coding agent",
    "sources": ["GitHub", "DEV Community", "HuggingFace"],
    "community_quotes": [
      "Matches or beats Claude Sonnet 4.5 and GPT models with only 40B parameters",
      "Uses 20x fewer resources than competitors while delivering superior performance",
      "First coding AI of 2026 from a Chinese quantitative hedge fund",
      "Introduces novel Code-Flow training paradigm that learns from code evolution",
      "Fully open source and can be self-hosted",
      "Specialized variants: Thinking (for complex reasoning) and Instruct (for general coding)"
    ]
  }
]
