[
  {
    "productName": "Cursor",
    "title": "Layout Customization and Stability Improvements (Version 2.3)",
    "description": "Holiday release focused entirely on fixing bugs and improving stability. Includes layout customization with four default layouts (agent, editor, zen, browser) that can be switched using Command+Option+Tab.",
    "updateType": "release",
    "url": "https://cursor.com/changelog",
    "date": "2025-12-22",
    "community_feedback": [
      {
        "quote": "Cursor 2.3 is starting to roll out! We've spent the past two weeks fixing bugs. This release isn't about new features, it's about directly pulling up stability by 15% - fixing 15 agent bugs, 11 layout bugs, and more.",
        "source": "X/Twitter",
        "sentiment": "positive"
      },
      {
        "quote": "Cursor just reverted two weeks worth of development during latest update",
        "source": "Reddit",
        "sentiment": "negative"
      }
    ]
  },
  {
    "productName": "Windsurf",
    "title": "Gemini 3 Flash Available",
    "description": "Gemini 3 Flash is now available for all users, combining Pro-grade reasoning with Flash-level speed and efficiency. Achieves 78% on SWE-bench Verified benchmark.",
    "updateType": "feature",
    "url": "https://windsurf.com/changelog",
    "date": "2025-12-27",
    "community_feedback": [
      {
        "quote": "Impressed by the intelligence and speed - it even fixed an issue that GPT-5.1-codex couldn't. Highly efficient without sacrificing intelligence.",
        "source": "Reddit",
        "sentiment": "positive"
      },
      {
        "quote": "Achieved 78% on SWE-bench, notably outperforming Gemini 3 Pro's 72.8%. Pushes the Pareto Frontier of performance and efficiency.",
        "source": "Reddit",
        "sentiment": "positive"
      },
      {
        "quote": "Extremely unhappy with Gemini 3 responses in Windsurf",
        "source": "Reddit",
        "sentiment": "negative"
      }
    ]
  },
  {
    "productName": "Gemini CLI",
    "title": "Nightly Build December 27, 2025",
    "description": "Version 0.24.0-nightly.20251227 released with legacy confirmation deprecations and refactoring changes. Gemini 3 Flash also announced as available in CLI on December 17.",
    "updateType": "release",
    "url": "https://github.com/google-gemini/gemini-cli/releases",
    "date": "2025-12-27",
    "community_feedback": [
      {
        "quote": "Gemini 3 Flash is now in Gemini CLI! Combines rapid response times with advanced AI reasoning for agentic coding workflows.",
        "source": "GitHub Discussion",
        "sentiment": "positive"
      }
    ]
  }
]