[
  {
    "name": "Qwen3.5",
    "url": "https://github.com/QwenLM/Qwen3.5",
    "description": "Open-source multimodal AI model series optimized for agentic coding with 1M token context, featuring Qwen3.5-397B-A17B MoE architecture for autonomous task execution and tool calling capabilities.",
    "release_date": "2026-02-16",
    "category": "AI coding model",
    "sources": ["GitHub", "CSDN", "InfoQ"],
    "community_quotes": [
      "First open-source model with 1 million token context window",
      "Excellent performance in BFCL-V4 and Browsecomp benchmarks",
      "Can complete complex application development with minimal requirement descriptions",
      "Surpasses GPT-5.2 on MMLU-Pro with 87.8 points"
    ]
  },
  {
    "name": "Code Arena",
    "url": "https://www.producthunt.com/posts/code-arena",
    "description": "Free AI coding model comparison platform that lets developers enter a single prompt and compare outputs from top AI programming models side-by-side, with support for multi-file application generation and code export to GitHub.",
    "release_date": "2026-02-13",
    "category": "AI coding comparison tool",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "283 upvotes on Product Hunt",
      "Compare multiple AI development applications at once, completely free",
      "Enter a single prompt and compare outputs from top AI programming models",
      "Export ready-to-run code to GitHub or your IDE"
    ]
  },
  {
    "name": "Willow for Developers",
    "url": "https://www.producthunt.com/posts/willow-for-developers",
    "description": "Voice input tool specifically designed for AI IDEs like Cursor and Antigravity, offering 3x better accuracy than built-in options with technical term recognition and context-aware file integration.",
    "release_date": "2026-02-11",
    "category": "AI IDE enhancement",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "147 upvotes on Product Hunt and featured",
      "3x more accurate than built-in voice input options",
      "Built-in recognition of technical terms and acronyms (SQL, API, REST)",
      "File tabs provide richer context for AI conversations"
    ]
  },
  {
    "name": "Multi-Agent Orchestrator for Claude Code",
    "url": "https://github.com/ComposioHQ/agent-orchestrator",
    "description": "Open-source tool for orchestrating parallel AI coding agents across any runtime, repository, or issue tracker with automatic PR lifecycle handling, CI failure responses, and real-time monitoring dashboard.",
    "release_date": "2026-02-14",
    "category": "AI workflow orchestration",
    "sources": ["GitHub"],
    "community_quotes": [
      "Orchestrate parallel AI coding agents across any runtime",
      "Automatic handling of pull request lifecycle",
      "Auto-responses to CI failures and review comments",
      "Agent-agnostic support (Claude Code, Codex, Aider)"
    ]
  }
]