[
  {
    "name": "GitHub Copilot Agentic Memory System",
    "url": "https://github.blog/changelog/2026-01-15-agentic-memory-for-github-copilot-is-in-public-preview/",
    "description": "Major update to GitHub Copilot that introduces persistent cross-agent memory, allowing AI coding agents to retain and share repository-specific knowledge across development sessions. The system delivers approximately 7% higher pull request merge rates and enables long-term learning of codebase patterns.",
    "release_date": "2026-01-15",
    "category": "AI IDE integration",
    "sources": ["GitHub Blog", "GitHub Changelog", "Visual Studio Blog", "Medium"],
    "community_quotes": [
      "GitHub Copilot now remembers your codebase across sessions",
      "Agentic memory system results in 3% increase in precision and 4% in performance metrics",
      "Enables AI agents to retain and share knowledge across different development sessions"
    ]
  },
  {
    "name": "GitHub Copilot SDK",
    "url": "https://github.blog/changelog/2026-01-14-copilot-sdk-in-technical-preview/",
    "description": "New multi-platform SDK (Node.js, Python, Go, .NET) that allows developers to embed GitHub Copilot's agentic runtime into any application with just a few lines of code. Agents can plan, invoke tools, edit files, and run commands without building orchestration from scratch.",
    "release_date": "2026-01-14",
    "category": "code agent",
    "sources": ["GitHub Blog", "GitHub Changelog", "YouTube", "Reddit"],
    "community_quotes": [
      "The Copilot SDK is HERE - Add an agent to anything",
      "Multi-platform SDK for integrating agentic AI into any app",
      "No orchestration required - just plug in and go"
    ]
  },
  {
    "name": "Cursor CLI Agent Modes",
    "url": "https://cursor.com/changelog/cli-jan-16-2026",
    "description": "Major update to Cursor CLI introducing two new agent modes: Plan Mode for designing approaches before coding, and Ask Mode for quick Q&A. Also adds cloud handoff capabilities, allowing local conversations to be pushed to cloud agents that clone repos, work on separate branches, and push back changes.",
    "release_date": "2026-01-16",
    "category": "AI coding CLI",
    "sources": ["Cursor Changelog", "Cursor Forum", "X/Twitter"],
    "community_quotes": [
      "Agent mode is not just a progressive upgrade but represents a complete 'generation change'",
      "Brings many of the most popular features from the Cursor editor to Cursor CLI",
      "CLI Agent Mode with cloud handoff for background processing"
    ]
  },
  {
    "name": "yolo-cage",
    "url": "https://github.com/borenstein/yolo-cage",
    "description": "Open-source security sandbox for AI coding agents (like Claude Code) that prevents secrets exfiltration and restricts dangerous actions. Uses Vagrant VM with MicroK8s to create isolated sandboxes per branch, filtering all outbound traffic through an egress proxy that scans for secrets and blocks exfiltration sites.",
    "release_date": "2026-01-21",
    "category": "code agent",
    "sources": ["GitHub", "Show HN", "Hacker News", "Chinese tech media"],
    "community_quotes": [
      "AI coding agents that can't exfiltrate secrets or merge their own PRs",
      "A sandbox to prevent AI agents from leaking secrets, supporting safe 'YOLO mode'",
      "Reduces risk while maintaining agent productivity"
    ]
  },
  {
    "name": "Architect Terminal",
    "url": "https://news.ycombinator.com/item?id=46703935",
    "description": "Terminal for running multiple AI coding agents simultaneously, built on ghostty-vt (the terminal emulation library from Ghostty). Uses hooks from Claude Code, Gemini CLI, and Codex to detect and manage multiple AI coding agents in a unified interface.",
    "release_date": "2026-01-21",
    "category": "AI coding CLI",
    "sources": ["Show HN", "Hacker News"],
    "community_quotes": [
      "A terminal for running multiple AI coding agents",
      "Built on ghostty-vt with hooks for Claude Code, Gemini CLI, and Codex"
    ]
  },
  {
    "name": "1Code",
    "url": "https://www.producthunt.com/products/1code-cursor-like-ui-for-claude-code",
    "description": "Open-source parallel development console that provides a Cursor-like UI for Claude Code, allowing developers to run multiple Claude Code agents simultaneously. Works locally on Mac with worktree support and available on Web platform.",
    "release_date": "2026-01-15",
    "category": "AI coding CLI",
    "sources": ["Product Hunt", "Hunted Space"],
    "community_quotes": [
      "A parallel development console made specifically for Claude Code",
      "Run multiple Claude Code Agents locally on Mac with worktree support",
      "66 upvotes on Product Hunt launch"
    ]
  }
]
