[
  {
    "title": "2025: The year in LLMs",
    "description": "Simon Willison's comprehensive annual review covering 25+ trends: year of 'reasoning' (RLVR), agents, coding agents (Claude Code reaching $1B ARR), LLMs on command-line, $200/month subscriptions, Chinese open-weight models dominating (GLM-4.7, DeepSeek V3.2, Kimi K2), long tasks (METR shows AI task length doubling every 7 months), prompt-driven image editing, models winning gold in academic competitions, vibe coding, MCP, Skills, and AI-enabled browsers. Key insight: 'The year that OpenAI lost their lead' with Gemini catching up across the board.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/31/the-year-in-llms/",
    "published_date": "2025-12-31",
    "topics": ["LLM trends", "reasoning models", "AI agents", "coding agents", "Chinese AI models", "Gemini", "OpenAI", "vibe coding"],
    "type": "technical"
  },
  {
    "title": "#488 – Infinity, Paradoxes that Broke Mathematics, Gödel Incompleteness & the Multiverse",
    "description": "Lex Fridman's conversation with mathematician Joel David Hamkins covering set theory, foundations of mathematics, nature of infinity, Russell's paradox, Gödel's incompleteness theorems, truth vs proof, the Halting Problem, the Continuum Hypothesis, mathematical multiverse, surreal numbers, Conway's Game of Life, computability theory, P vs NP, and infinite chess. Hamkins is the #1 highest-rated user on MathOverflow and author of 'Proof and the Art of Mathematics' and 'Lectures on the Philosophy of Mathematics'.",
    "author": "Lex Fridman",
    "source": "Podcast",
    "url": "https://lexfridman.com/joel-david-hamkins/",
    "published_date": "2025-12-31",
    "topics": ["mathematical logic", "Gödel incompleteness", "infinity", "set theory", "computability theory", "P vs NP", "mathematical foundations"],
    "type": "discussion"
  },
  {
    "title": "Developers remain willing but reluctant to use AI: The 2025 Developer Survey results are here",
    "description": "Stack Overflow's 2025 survey of 49,000+ developers reveals AI tool adoption at 80%, but trust in AI accuracy fell from 40% to 29%. Key findings: 45% frustrated by 'almost right but not quite' AI solutions, 66% spending more time fixing AI-generated code, 75% still prefer human help for complex problems. 69% learned new coding techniques (44% with AI help). AI agents show personal productivity benefits (69%) but 72% don't use 'vibe coding' professionally. Programming languages growing in popularity are AI-compatible: Python +7pp, Rust +2pp, Go +2pp.",
    "author": "Stack Overflow Team",
    "source": "TechMedia",
    "url": "https://stackoverflow.blog/2025/12/29/developers-remain-willing-but-reluctant-to-use-ai-the-2025-developer-survey-results-are-here/",
    "published_date": "2025-12-29",
    "topics": ["developer survey", "AI adoption", "trust in AI", "AI agents", "programming languages", "vibe coding"],
    "type": "discussion"
  }
]
