[
  {
    "name": "Mysti",
    "url": "https://github.com/DeepMyst/Mysti",
    "description": "VS Code extension enabling multiple AI agents (Claude, Codex, Gemini) to collaborate, debate each other's findings, and synthesize the best code review solutions through adversarial discussion.",
    "release_date": "2025-12-28",
    "category": "workflow-specific AI tools",
    "sources": ["Hacker News", "GitHub"],
    "community_quotes": [
      "Claude is probably the best at prototyping code, where Codex make a very strong (but pedantic) code-reviewer.",
      "I find that asking Claude to develop and Codex to review the uncommitted changes will typically result in high-value code, and eliminate all of Claude's propensity to perpetually lie and cheat.",
      "When you bugfixing if a model introduces a bug, it has a hard time spotting and fixing it, but when you give the code to another model it can instantly spot it.",
      "licensing with BSL when basically every month the AI world is changing is not a smart decision."
    ]
  },
  {
    "name": "Agentic.nvim",
    "url": "https://github.com/carlos-algms/agentic.nvim",
    "description": "Neovim plugin bringing AI assistants (Claude, Gemini, Codex, OpenCode) through the Agent Client Protocol (ACP) with a proper chat interface featuring markdown rendering and syntax highlighting, not just a terminal window.",
    "release_date": "2025-12-20",
    "category": "IDE-integrated AI tools",
    "sources": ["GitHub", "Reddit r/neovim"],
    "community_quotes": [
      "We seem to be the only plugin that exposes this ACP feature yet!",
      "What This Plugin is NOT: ❌ Not a terminal window - It uses proper buffers with markdown rendering and syntax highlighting.",
      "Built entirely on the official ACP specification, with dedicated adapters for each Provider.",
      "Would love to hear your feedback! This plugin is my daily driver, on my 9-5 Job, and dog feeding, so it is actively developed."
    ]
  },
  {
    "name": "AI Agent Skills (Next.js 16)",
    "url": "https://github.com/gocallum/nextjs16-agent-skills",
    "description": "Initial v1.0.0 release focusing on AI agent development skills with Next.js 16 migration, AI SDK 6 integration, and comprehensive agent UI components for building agent-powered applications.",
    "release_date": "2025-12-20",
    "category": "open-source AI agents",
    "sources": ["GitHub"],
    "community_quotes": []
  },
  {
    "name": "Toad",
    "url": "https://batrachian.ai/",
    "description": "A unified CLI tool providing a beautiful GUI for multiple coding agents (OpenHands, Claude Code, Gemini CLI) in your terminal via the Agent Communication Protocol (ACP), featuring advanced TUI with Markdown rendering, shell integration, and notebook-like interactions.",
    "release_date": "2025-12-22",
    "category": "AI coding CLI",
    "sources": ["InfoQ"],
    "community_quotes": [
      "I wasn't impressed with the UI these tools offered. Having worked in the terminal for a few years, I knew you could get a better user experience.",
      "Think of it as a 'bring your own agent' coding CLI. Use whatever agent you want. I'm not trying to sell you tokens.",
      "It was a private repo for a while. Toad (a play on Textual Code) can run a large number of AI agents with a nicer terminal UI."
    ]
  },
  {
    "name": "Visual Studio 2026",
    "url": "https://visualstudio.microsoft.com/",
    "description": "Microsoft's AI-native IDE release with improved Copilot features, enhanced AI integration throughout the development environment, rounded corners, themes, and performance improvements.",
    "release_date": "2025-12-18",
    "category": "AI IDE",
    "sources": ["InfoQ", "Microsoft DevBlog"],
    "community_quotes": [
      "I'm not calling it that - pushing back on the 'AI-native' marketing terminology.",
      "It's Visual Studio 2022 but with a bigger number, ROUNDED CORNERS, AI CHAT, THEMES!",
      "Honestly it is tiring seeing so many people default to complaining and nitpicks on Reddit. They made the IDE faster.",
      "When are they going to improve performance? This just feels like another AI patch."
    ]
  }
]
