[
  {
    "title": "LLM predictions for 2026, shared with Oxide and Friends",
    "description": "Simon Willison shares predictions for 2026, 2029, and 2032. Key 1-year predictions: LLMs writing good code will become undeniable, we'll solve sandboxing, a 'Challenger disaster' for coding agent security. 3-year: resolution of Jevons paradox for software engineering, AI-built browser won't be surprising. 6-year: typing code by hand will go the way of punch cards. Emphasizes that AI-assisted programming requires enormous skill, experience, and depth of understanding - skills are changing, not disappearing.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Jan/8/llm-predictions-for-2026/",
    "published_date": "2026-01-08",
    "topics": ["LLM", "AI-coding", "predictions", "sandboxing", "security", "Jevons-paradox", "future-of-programming"],
    "type": "opinion"
  },
  {
    "title": "AI writes code faster. Your job is still to prove it works",
    "description": "Addy Osmani explores how AI excels at drafting features but struggles with logic, security, and edge cases - making errors 75% more common in logic alone. The article emphasizes that while AI accelerates development, developers must rigorously test and validate AI-generated code, particularly for logic correctness, security vulnerabilities, and edge case handling.",
    "author": "Addy Osmani",
    "source": "Blog",
    "url": "https://addyosmani.com/blog/code-review-ai/",
    "published_date": "2026-01-07",
    "topics": ["AI-coding", "code-review", "testing", "security", "LLM", "developer-workflow", "best-practices"],
    "type": "opinion"
  },
  {
    "title": "A quote from Adam Wathan on Tailwind's AI impact",
    "description": "Adam Wathan, CEO of Tailwind Labs, reveals brutal impact of AI: 75% of engineering team lost jobs, docs traffic down 40% despite popularity, revenue down 80%. Illustrates the disconnect between framework adoption and business sustainability in the AI era - making tools easier to use doesn't correlate with revenue when AI agents can consume docs without discovering commercial products.",
    "author": "Adam Wathan (quoted by Simon Willison)",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Jan/7/adam-wathan/",
    "published_date": "2026-01-07",
    "topics": ["AI-ethics", "developer-tools", "business-model", "AI-impact", "Tailwind-CSS"],
    "type": "opinion"
  },
  {
    "title": "He was called a 'terrorist sympathizer.' Now his AI company is valued at $3B",
    "description": "Profile of Replit founder Amjad Masad and his $3B AI coding startup. Despite being ostracized by Silicon Valley for his pro-Palestine stance after Oct 7, 2023, Replit thrived by launching an AI agent that turns natural language into working apps. Company raised $250M at $3B valuation, with $150M revenue. Key insight: AI coding sector received $4.7B in U.S. funding in the last year. Masad found support from Saudi Arabia's Public Investment Fund, securing exclusive government deal. Illustrates the geopolitical dimensions of AI tool development and the business opportunities for founders willing to take controversial political stands.",
    "author": "Margaux MacColl",
    "source": "TechMedia",
    "url": "https://sfstandard.com/2026/01/07/called-terrorist-sympathizer-now-ai-company-valued-3b/",
    "published_date": "2026-01-07",
    "topics": ["AI-coding", "Replit", "startups", "politics", "AI-ethics", "business", "geopolitics", "funding"],
    "type": "opinion"
  }
]
