[
  {
    "title": "LLM 0.28 Released with New OpenAI Models Support",
    "description": "Simon Willison released version 0.28 of his LLM Python library and CLI tool, adding support for new OpenAI models including gpt-5.1, gpt-5.1-chat-latest, gpt-5.2 and gpt-5.2-chat-latest. The release also includes improvements to URL fetching, bug fixes, and adoption of uv for dependency management.",
    "author": "Simon Willison",
    "source": "Technical Platform",
    "url": "https://simonwillison.net/2025/Dec/12/llm-028/",
    "published_date": "2025-12-12",
    "topics": ["LLM tools", "OpenAI", "CLI tools", "Python libraries", "AI development"],
    "type": "technical"
  },
  {
    "title": "OpenAI Quietly Adopts Skills Mechanism in ChatGPT and Codex CLI",
    "description": "OpenAI has implemented Anthropic's Skills mechanism in both ChatGPT and Codex CLI. Skills are simple folder-based structures with Markdown files that allow LLMs to access specialized capabilities. Simon demonstrated the feature by having GPT-5.2 create a PDF about kākāpō breeding season, showing impressive quality control including font selection for macrons support.",
    "author": "Simon Willison",
    "source": "Technical Platform",
    "url": "https://simonwillison.net/2025/Dec/12/openai-skills/",
    "published_date": "2025-12-12",
    "topics": ["OpenAI", "Skills", "ChatGPT", "Codex CLI", "AI capabilities", "PDF generation"],
    "type": "technical"
  },
  {
    "title": "Mistral Releases Devstral 2 Models for Code Agents",
    "description": "Mistral announced two new models focused on powering coding agents: Devstral 2 (123B parameters) achieving 72.2% on SWE-bench Verified, and Devstral Small 2 (24B parameters). The larger model uses a modified MIT license with revenue restrictions, while the smaller model has a proper Apache 2 license.",
    "author": "Simon Willison",
    "source": "Technical Platform",
    "url": "https://simonwillison.net/2025/Dec/9/devstral-2/",
    "published_date": "2025-12-09",
    "topics": ["Mistral", "code agents", "SWE-bench", "open models", "AI coding"],
    "type": "technical"
  },
  {
    "title": "NVIDIA ComputeEval 2025 Introduces 232 New CUDA Challenges",
    "description": "NVIDIA has significantly expanded AI coding benchmarks with 232 new CUDA programming challenges, making it tougher for AI models to pass and raising the standards for AI-generated code evaluation.",
    "author": "NVIDIA Developer Blog",
    "source": "Technical Platform",
    "url": "https://developer.nvidia.com/blog/benchmarking-llms-on-ai-generated-cuda-code-with-computeeval-2025-2/",
    "published_date": "2025-12-10",
    "topics": ["AI benchmarks", "CUDA", "code generation", "NVIDIA"],
    "type": "technical"
  },
  {
    "title": "AI-Designed Chips Challenge Human Understanding",
    "description": "Hacker News discussion highlights how machine learning models are discovering chip design approaches that humans find difficult to understand or replicate, with ML models sometimes abusing chip-specific functions in unexpected ways.",
    "author": "Hacker News Community",
    "source": "Community",
    "url": "https://news.ycombinator.com/item?id=43152407",
    "published_date": "2025-12-10",
    "topics": ["AI hardware", "chip design", "ML discovery", "human-AI collaboration"],
    "type": "discussion"
  },
  {
    "title": "Google and Replit Expand Multi-Year Partnership to Bring 'Vibe Coding' to Enterprise",
    "description": "Google Cloud and Replit announced a strategic multi-year partnership expansion to bring AI-powered 'vibe coding' capabilities to enterprise developers. The partnership includes expanded usage of Google Cloud services, integration of more Google AI models onto Replit's platform, and support for AI coding through Ghostwriter. Amjad Masad stated: 'The goal for us, and Google, is to make enterprise vibe-coding a thing,' emphasizing the vision to make programming accessible to a billion developers worldwide.",
    "author": "Amjad Masad",
    "source": "Tech Media",
    "url": "https://www.cnbc.com/2025/12/04/google-replit-ai-vibe-coding-anthropic-cursor.html",
    "published_date": "2025-12-04",
    "topics": ["Google Cloud", "Replit", "vibe coding", "enterprise AI", "AI coding tools", "partnerships"],
    "type": "technical"
  },
  {
    "title": "Anthropic Launches Claude Code in Slack for AI-Embedded Developer Workflows",
    "description": "Anthropic launched Claude Code in Slack as a research preview, allowing developers to delegate complete coding tasks directly from chat threads. Previously limited to lightweight coding help, Claude can now analyze Slack messages to determine repositories, post progress updates, and create pull requests. This represents a broader industry shift of AI coding assistants migrating from IDEs into collaboration tools, positioning Slack as an 'agentic hub' where AI meets workplace context.",
    "author": "Rebecca Bellan",
    "source": "Tech Media",
    "url": "https://techcrunch.com/2025/12/08/claude-code-is-coming-to-slack-and-thats-a-bigger-deal-than-it-sounds/",
    "published_date": "2025-12-08",
    "topics": ["Anthropic", "Claude Code", "Slack", "AI coding assistants", "developer workflows", "collaboration"],
    "type": "technical"
  },
  {
    "title": "Mistral AI Launches Devstral 2 Coding Models and Vibe CLI Tool",
    "description": "French AI startup Mistral launched Devstral 2, a new generation of AI models specifically designed for coding, alongside Mistral Vibe CLI for code automation through natural language. Devstral 2 (123B parameters) requires 4+ H100 GPUs for deployment, while Devstral Small (24B parameters) can run locally on consumer hardware. The models feature context awareness with persistent history and can scan file structures and Git status to inform behavior, targeting production-grade workflows.",
    "author": "Anna Heim",
    "source": "Tech Media",
    "url": "https://techcrunch.com/2025/12/09/mistral-ai-surfs-vibe-coding-tailwinds-with-new-coding-models/",
    "published_date": "2025-12-09",
    "topics": ["Mistral AI", "Devstral 2", "vibe coding", "AI models", "CLI tools", "context awareness"],
    "type": "technical"
  }
]