[
  {
    "title": "Engineers who dismiss AI | Hacker News Discussion",
    "description": "A heated 235-comment discussion on Hacker News debates engineers who are skeptical of AI coding tools. Key themes include: 1) Skill atrophy concerns - developers worry about losing fundamental coding abilities, 2) Productivity paradox - some report 10x gains while others report being 19% slower, 3) Technical debt explosion - AI generates more code faster but with hidden quality issues, 4) Claude Code costs and proprietary concerns, 5) The 'vibe coding' debate - when is AI-assistance appropriate vs harmful, 6) Junior developers struggling without AI creating 'generational gaps' in skills. Comments range from strong AI advocacy (shipping faster, taking on bigger challenges) to deep skepticism (creating mountains of technical debt, impossible to maintain).",
    "author": "Hacker News Community",
    "source": "HN",
    "url": "https://news.ycombinator.com/item?id=46325360",
    "published_date": "2025-12-20",
    "topics": ["AI Coding", "Developer Skills", "Technical Debt", "Claude Code", "Vibe Coding", "Hacker News", "Community Debate"],
    "type": "discussion"
  },
  {
    "title": "2025 LLM Year in Review",
    "description": "Karpathy's comprehensive review of 6 major paradigm shifts in LLMs during 2025: 1) Reinforcement Learning from Verifiable Rewards (RLVR) emerged as a new training stage, 2) 'Ghosts vs. Animals' - understanding LLMs as fundamentally different intelligence entities with jagged capabilities, 3) Cursor revealed a new layer of LLM applications that orchestrate multiple model calls, 4) Claude Code as the first convincing LLM agent that runs locally on user computers, 5) 'Vibe coding' - programming via English where code becomes ephemeral and disposable, 6) Google Gemini Nano banana pointing toward LLM GUIs that use visual/spatial formats instead of just text.",
    "author": "Andrej Karpathy",
    "source": "Blog",
    "url": "https://karpathy.bearblog.dev/year-in-review-2025/",
    "published_date": "2025-12-19",
    "topics": ["LLM", "RLVR", "AI Agents", "Vibe Coding", "Claude Code", "Cursor", "AI Paradigm Shifts", "Local AI"],
    "type": "technical"
  },
  {
    "title": "Your job is to deliver code you have proven to work",
    "description": "Willison argues that with AI coding tools, the developer's role shifts from writing code to delivering proven, working code. He critiques the practice of submitting large, untested AI-generated PRs and outlines a two-step verification process: 1) Manual testing - developers must see the code work themselves, documenting steps with terminal output or screen recordings; 2) Automated testing - LLMs make writing tests easier, so there's no excuse to skip them. He emphasizes that coding agents like Claude Code should also be taught to prove their changes work, and that humans provide accountability that computers cannot.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/18/code-proven-to-work/",
    "published_date": "2025-12-18",
    "topics": ["AI Coding", "Testing", "Code Quality", "Claude Code", "Developer Responsibility", "Software Engineering"],
    "type": "opinion"
  },
  {
    "title": "AI coding is now everywhere. But not everyone is convinced.",
    "description": "MIT Technology Review's deep investigation into AI coding tools reveals a complex reality: while 65% of developers use AI tools weekly and tech leaders claim 25% of code is AI-generated, the productivity gains are mixed. Studies show some developers are actually 19% slower with AI, and there are growing concerns about technical debt, code quality, and security. AI tools excel at boilerplate code and tests but struggle with complex tasks and large codebases. The article highlights 'vibe coding,' the rise of autonomous agents that score 70%+ on SWE-bench, and the challenge of maintaining AI-generated code. Developers report that while AI tools can be revolutionary for some tasks, they require significant relearning and often fail catastrophically on complex problems.",
    "author": "MIT Technology Review",
    "source": "TechMedia",
    "url": "https://www.technologyreview.com/2025/12/15/1128352/rise-of-ai-coding-developers-2026/",
    "published_date": "2025-12-15",
    "topics": ["AI Coding", "Developer Productivity", "Technical Debt", "Code Quality", "Vibe Coding", "AI Agents", "SWE-bench"],
    "type": "technical"
  }
]
