[
  {
    "title": "Modelence raises $3M to smooth out the vibe-coding stack",
    "description": "Modelence, a Y Combinator-backed developer tools startup, raised $3M in seed funding to solve fragmentation in the 'vibe-coding' movement. The company provides a batteries-included framework for AI software development and addresses DevOps challenges in AI growth. Investors include Rebel Fund, Acacia Venture Capital Partners, and Audium Capital Partners. The funding highlights the growing need for tooling to support AI-assisted software development workflows.",
    "author": "TechCrunch",
    "source": "TechCrunch",
    "url": "https://techcrunch.com/2026/01/28/modelence-raises-13-million-to-smooth-out-the-vibe-coding-stack/",
    "published_date": "2026-01-28",
    "topics": ["vibe coding", "funding", "developer tools", "AI workflows", "Y Combinator", "Modelence"],
    "type": "news_article"
  },
  {
    "title": "Adding dynamic features to an aggressively cached website",
    "description": "Simon Willison discusses techniques for adding dynamic features to his heavily cached blog (behind Cloudflare with 15-minute cache headers). Explores how to maintain aggressive static site caching while incorporating dynamic functionality.",
    "author": "Simon Willison",
    "source": "Simon Willison's Weblog",
    "url": "https://simonwillison.net/2026/Jan/28/dynamic-features-static-site/",
    "published_date": "2026-01-28",
    "topics": ["caching", "Cloudflare", "static sites", "web architecture", "dynamic features"],
    "type": "blog_post"
  },
  {
    "title": "A few random notes from claude coding quite a bit last few weeks",
    "description": "Andrej Karpathy shares detailed notes on his coding workflow transformation with LLM agents. He went from 80% manual+autocomplete coding and 20% agents in November to 80% agent coding and 20% edits+touchups in December. Discusses IDE vs agent swarms, model mistakes, tenacity of agents, speedups, leverage patterns, fun factor, skill atrophy, and the coming 'slopacolypse' of 2026. Notes that LLM agent capabilities crossed a threshold of coherence around December 2025 causing a phase shift in software engineering.",
    "author": "Andrej Karpathy",
    "source": "X (Twitter)",
    "url": "https://x.com/karpathy/status/2015883857489522876",
    "published_date": "2026-01-27",
    "topics": ["LLM agents", "AI coding workflow", "Claude", "software engineering", "productivity", "agent capabilities"],
    "type": "social_media"
  },
  {
    "title": "ChatGPT Containers can now run bash, pip/npm install packages, and download files",
    "description": "Simon Willison discovers major upgrades to ChatGPT's code interpreter feature, now called ChatGPT Containers. Key new capabilities: direct Bash command execution, Node.js and 10+ additional language support (Ruby, Perl, PHP, Go, Java, Swift, Kotlin, C, C++), pip/npm package installation via internal proxy, and container.download tool to fetch files from the web. Simon tests security implications, documents the internal proxy mechanism, and catalogs all available tools. Notes lack of official documentation from OpenAI.",
    "author": "Simon Willison",
    "source": "Simon Willison's Weblog",
    "url": "https://simonwillison.net/2026/Jan/26/chatgpt-containers/",
    "published_date": "2026-01-26",
    "topics": ["ChatGPT", "code interpreter", "bash", "npm", "pip", "container security", "OpenAI", "AI tools"],
    "type": "blog_post"
  },
  {
    "title": "2026 Agentic Coding Trends Report",
    "description": "Anthropic's official report identifying 8 key trends that will define agentic coding in 2026, covering the evolution from passive AI assistance to active, autonomous participation in software development.",
    "author": "Anthropic",
    "source": "Anthropic",
    "url": "https://resources.anthropic.com/hubfs/2026%20Agentic%20Coding%20Trends%20Report.pdf?hsLang=en",
    "published_date": "2026-01-21",
    "topics": ["agentic coding", "trends", "Anthropic", "AI agents", "software development"],
    "type": "report"
  },
  {
    "title": "Wilson Lin on FastRender: a browser built by thousands of parallel agents",
    "description": "Simon Willison interviews Wilson Lin about FastRender, an innovative browser built using thousands of parallel agents. The conversation explores the limits of autonomous coding systems and new paradigms for browser architecture.",
    "author": "Simon Willison",
    "source": "Simon Willison's Weblog",
    "url": "https://simonwillison.net/2026/Jan/23/fastrender/",
    "published_date": "2026-01-23",
    "topics": ["autonomous agents", "browser", "FastRender", "parallel agents", "Cursor"],
    "type": "blog_post"
  },
  {
    "title": "Topic Modeling Techniques for 2026: Seeded Modeling, LLM Integration and Data Summaries",
    "description": "Towards Data Science covers advanced topic modeling techniques including Seeded KeyNMF that combines text prompts with the latest topic models, representing the continued integration of LLMs into traditional data science workflows.",
    "author": "Towards Data Science",
    "source": "Towards Data Science",
    "url": "https://towardsdatascience.com/topic-modeling-techniques-for-2026-seeded-modeling-llm-integration-and-data-summaries/",
    "published_date": "2026-01-14",
    "topics": ["topic modeling", "LLM integration", "data science", "Seeded KeyNMF"],
    "type": "technical_article"
  }
]
