[
  {
    "title": "uv-init-demos: Python project initialization options",
    "description": "Willison created a GitHub repository demonstrating all the different options of uv's init command (--app, --package, --lib) using Claude to help generate the content. The project uses a GitHub Actions script to stay up-to-date with uv releases. Shows practical application of AI coding assistants for documentation and tooling setup.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/",
    "published_date": "2025-12-24",
    "topics": ["python", "github-actions", "git-scraping", "uv", "ai"],
    "type": "tutorial"
  },
  {
    "title": "Cooking with Claude",
    "description": "Simon Willison describes using LLMs for cooking, progressing from basic recipes to advanced tasks. Most notably, he used Claude to 'vibe-code' a custom application for complex meal preparation timing. The post demonstrates the practical application of AI coding tools (vibe coding) for real-time problem solving beyond traditional software development contexts.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/",
    "published_date": "2025-12-23",
    "topics": ["vibe-coding", "claude", "ai", "generative-ai", "llms", "vision-llms", "anthropic"],
    "type": "opinion"
  },
  {
    "title": "MicroQuickJS for sandboxing LLM-generated code",
    "description": "Willison explores Fabrice Bellard's MicroQuickJS (JavaScript engine for embedded systems, 10kB RAM) as a sandboxing environment for running untrusted code from LLMs. He used Claude Code to investigate building Python bindings, testing it as a sandbox, and compiling to WebAssembly. Key finding: MicroQuickJS is 'very well suited to the sandbox problem' with robust memory/time limits, no dangerous primitives, and regex engine that protects against exhaustion attacks.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/",
    "published_date": "2025-12-23",
    "topics": ["c", "javascript", "nodejs", "python", "sandboxing", "ai", "webassembly", "deno", "pyodide", "generative-ai", "llms", "claude-code", "fabrice-bellard"],
    "type": "technical"
  },
  {
    "title": "First success using browser agent (Claude in Chrome) to solve a Cloudflare CORS problem",
    "description": "Willison reports using Claude in Chrome extension to solve a real problem: figuring out how Cloudflare Transform Rules were configured for open CORS policy. The agent found the solution in 1m45s by navigating the Cloudflare dashboard. He notes remaining 'deeply skeptical of browser agents due to prompt injection risks' but admits this was a very positive experience. Demonstrates both the potential and caution needed around AI browsing agents.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/",
    "published_date": "2025-12-22",
    "topics": ["ai", "llms", "generative-ai", "anthropic", "claude", "browser-agents", "chrome", "cloudflare", "prompt-injection", "ai-agents"],
    "type": "technical"
  }
]
