[
  {
    "name": "Claude Code (December 2025 Update)",
    "url": "https://www.geeky-gadgets.com/claude-code-update-dec-2025/",
    "description": "Major update to Claude Code introducing Language Server Protocol (LSP) support for real-time diagnostics, asynchronous sub-agents for parallel task execution, Ultrathink Mode for advanced reasoning, expanded integrations (Slack, Chrome, mobile), AutoCloud GUI for visual task management, and enhanced agent skills.",
    "release_date": "2025-12-27",
    "category": "AI coding CLI",
    "sources": ["Geeky Gadgets", "WorldofAI", "AI Agent Store"],
    "community_quotes": [
      "LSP support provides real-time diagnostics, go-to definitions, and reference tracking.",
      "Asynchronous sub-agents enable multitasking and parallel execution for large-scale projects.",
      "Ultrathink Mode allocates maximum reasoning resources for complex coding challenges.",
      "Browser and mobile integration including /chrome command and Android app support.",
      "Slack integration allows tasks to be assigned directly from Slack to Claude Code."
    ]
  },
  {
    "name": "Cursor acquires Graphite",
    "url": "https://cursor.com/blog/graphite",
    "description": "Cursor, an AI-powered code editor, has acquired Graphite, a code review platform. Graphite specializes in AI-powered code review workflow that helps teams review changes more efficiently by breaking large changes into smaller, connected pieces and includes an AI helper that can fix broken tests automatically.",
    "release_date": "2025-12-19",
    "category": "AI code review",
    "sources": ["Fortune", "Cursor Blog", "InfoQ"],
    "community_quotes": [
      "Cursor acquires code review startup Graphite as AI coding competition heats up.",
      "Graphite solves the root cause of slow reviews (workflow) and applies AI on top.",
      "The acquisition brings together two popular AI-powered development tools.",
      "Graphite's platform helps teams ship higher quality code, faster.",
      "Teams can review 6000+ lines of AI-generated code with Graphite's stacked diffs."
    ]
  },
  {
    "name": "GPT-5.2-Codex",
    "url": "https://openai.com/index/introducing-gpt-5-2-codex/",
    "description": "OpenAI's agentic coding model designed for professional software engineering and defensive cybersecurity. Built on the GPT-5.2 architecture, it represents the biggest leap in agentic coding since GPT-5, offering improved instruction adherence, tool grounding for multi-step execution, and stronger long-context performance for complex coding workflows.",
    "release_date": "2025-12-18",
    "category": "AI coding model",
    "sources": ["OpenAI Official", "Reddit r/programming", "Twitter/X", "eSecurityPlanet", "Binance Square"],
    "community_quotes": [
      "The most advanced agentic coding model for professional software engineering and defensive cybersecurity.",
      "GPT-5.2 represents the biggest leap for GPT models in agentic coding since GPT-5.",
      "Developers are taking a more measured view of AI advancement rather than fears of job replacement.",
      "Some users reported instruction-following capabilities with tradeoffs versus base GPT-5.2.",
      "OpenAI announced increased Codex usage limits until January 1st for AI coding assistant users."
    ]
  },
  {
    "name": "Agent Skills",
    "url": "https://www.anthropic.com/engineering/equipping-agents-for-the-real-world-with-agent-skills",
    "description": "Anthropic's open standard for AI agent capabilities that enables cross-platform portability of agent skills. Skills are special sets of instructions that teach AI agents how to handle specific work tasks, allowing them to be portable across different AI platforms including OpenAI's ChatGPT and Codex.",
    "release_date": "2025-12-18",
    "category": "AI agent standard",
    "sources": ["Anthropic Official", "The New Stack", "AI Business", "SiliconAngle"],
    "community_quotes": [
      "Anthropic makes agent Skills an open standard following the same approach as MCP.",
      "OpenAI has already adopted similar technology into ChatGPT and Codex.",
      "Enterprise administrators can now control these skills from one central location.",
      "Skills are now portable across different AI platforms.",
      "Pre-built skills available from partners like Canva, Notion, Figma, Atlassian, Cloudflare, Stripe, and Zapier."
    ]
  }
]
