[
  {
    "name": "Moltworker (OpenClaw/Moltbot)",
    "url": "https://blog.cloudflare.com/moltworker-self-hosted-ai-agent/",
    "description": "A self-hosted personal AI agent platform that runs OpenClaw (formerly Moltbot/Clawdbot) on Cloudflare's Sandbox SDK. Supports local hosting and VPS deployment with one-click deployment for approximately $5/month. Described as a paradigm shift in how developers deploy AI agents without hardware.",
    "release_date": "2026-01-29",
    "category": "Self-hosted AI agent",
    "sources": ["Cloudflare Blog", "Forbes", "Reddit"],
    "community_quotes": [
      "Described as 'the most viral AI tool of 2026' - Medium",
      "A paradigm shift in how developers deploy AI agents - dev.to",
      "Reddit discussions noted it could lead to 'flooding' of AI agents on platforms - r/accelerate",
      "Cloudflare publicly reacted to the popularity of OpenClaw/Moltbot on social media"
    ]
  },
  {
    "name": "Ai2 Open Coding Agents (SERA)",
    "url": "https://allenai.org/blog/open-coding-agents",
    "description": "A family of open-source coding agents from the Allen Institute for AI, starting with SERA (Soft-Verified Efficient Repository Agents). Models range from 8B to 32B parameters, can solve more than 55% of SWE-Bench Verified tasks, and includes full open-source release with 200,000 synthetic coding agent trajectories. Training costs as low as $400, 26x more efficient than comparable solutions.",
    "release_date": "2026-01-27",
    "category": "Open-source AI coding agent",
    "sources": ["Ai2 Blog", "GeekWire", "SiliconAngle"],
    "community_quotes": [
      "SERA is described as a 'state-of-the-art agent for its size' that is 'super simple' and '26x more efficient than comparable solutions' - Hanna Hajishirzi (Ai2 researcher) on X, January 27, 2026",
      "Ai2 makes building custom coding agents easier and cheaper for SMEs and independent developers - The New Stack",
      "Ai2's open coding agents slash costs for developers - Developer Tech"
    ]
  },
  {
    "name": "ACP Agent Registry",
    "url": "https://blog.jetbrains.com/ai/2026/01/acp-agent-registry/",
    "description": "A directory of AI coding agents integrated directly into JetBrains IDEs, allowing users to browse and connect AI coding agents without manual setup. Launched together with Zed as part of the Agent Client Protocol (ACP) for open interoperability. Enables AI agents to collaborate across teams, frameworks, and organizations.",
    "release_date": "2026-01-27",
    "category": "IDE-integrated tool",
    "sources": ["JetBrains AI Blog", "Zed Blog", "The Register"],
    "community_quotes": [
      "ACP is 'the internet protocol for AI agents' enabling standardized communication - Towards AI",
      "Solves the multi-agent communication crisis by providing a standardized protocol for agent discovery and connection - Medium",
      "Eliminates the need for individual agent setup and configuration - The Register"
    ]
  }
]
