[
  {
    "name": "Claude Code 2.1",
    "url": "https://hyperdev.matsuoka.com/p/claude-code-210-ships",
    "description": "Major update to Anthropic's Claude Code CLI featuring automatic skill hot-reload, session teleportation between devices, async sub-agents, Shift+Enter for newlines, hooks directly added to agents, and project memory that overrides global settings.",
    "release_date": "2026-01-07",
    "category": "AI coding CLI",
    "sources": ["Hyperdev", "VentureBeat", "Reddit", "Threads"],
    "community_quotes": [
      "1,096 commits bringing 16 major features",
      "Skills created or modified are now immediately available",
      "Project memory (overrides global)",
      "Smarter agents with smoother workflows",
      "Claude Code 2.1.0 just dropped"
    ]
  },
  {
    "name": "Cowork",
    "url": "https://claude.com/blog/cowork-research-preview",
    "description": "Anthropic's AI agent for general desktop computing and file management, built into Claude Desktop. Enables Claude to read, modify, and analyze files in designated folders, functioning as a general-purpose AI agent beyond just coding.",
    "release_date": "2026-01-12",
    "category": "workflow agent",
    "sources": ["TechCrunch", "Ars Technica", "VentureBeat", "Fortune", "Axios"],
    "community_quotes": [
      "Brings Claude Code-style AI agents to general desktop computing",
      "Mostly built by AI itself - largely built by Claude",
      "Functions as a general-purpose AI agent rather than just a conversational chatbot",
      "5 ways Cowork could be the biggest AI innovation of 2026"
    ]
  },
  {
    "name": "GitHub Copilot CLI Enhanced Agents",
    "url": "https://github.blog/changelog/2026-01-14-github-copilot-cli-enhanced-agents-context-management-and-new-ways-to-install/",
    "description": "GitHub Copilot CLI update introducing enhanced agents with improved context management and new installation methods. Provides agent-powered, GitHub-native functionality that knows your repositories, issues, and PRs directly in the terminal.",
    "release_date": "2026-01-14",
    "category": "AI coding CLI",
    "sources": ["GitHub Blog"],
    "community_quotes": [
      "Agent-powered, GitHub-native functionality in your terminal",
      "Enhanced agents with improved context management",
      "Allows creating specialized versions of the Copilot coding agent"
    ]
  },
  {
    "name": "Yolobox",
    "url": "https://github.com/finbarr/yolobox",
    "description": "A Go CLI tool that runs AI coding agents (Claude Code, Codex, Gemini) inside containerized sandboxes with full sudo access while protecting the host home directory from accidental damage.",
    "release_date": "2026-01-13",
    "category": "AI coding CLI",
    "sources": ["Show HN", "GitHub", "AUR"],
    "community_quotes": [
      "Let your AI go full send. Your home directory stays home",
      "I always thought Docker/Podman is a bit overkill for this kind of thing",
      "Run AI coding agents with full sudo without nuking home dir",
      "Comes preinstalled with leading coding agent CLIs",
      "Neat project! Sounds like it has a very different ethos to mine"
    ]
  },
  {
    "name": "Litterbox",
    "url": "https://github.com/Gerharddc/litterbox",
    "description": "A Linux-based tool for creating isolated development environments with restricted SSH key access, designed to safely run AI coding agents with elevated privileges.",
    "release_date": "2026-01-13",
    "category": "AI coding CLI",
    "sources": ["Show HN", "GitHub"],
    "community_quotes": [
      "Somewhat Isolated Development Environment",
      "Exposes a Wayland socket for running entire dev environment inside container",
      "Provides special SSH agent that always prompts user to confirm signing operation",
      "Gives additional protection against exploits inside editor extensions"
    ]
  },
  {
    "name": "B-IR",
    "url": "https://news.ycombinator.com/item?id=46583581",
    "description": "A programming language specifically optimized for Large Language Models, designed to work more effectively with AI-assisted development workflows.",
    "release_date": "2026-01-13",
    "category": "code agent",
    "sources": ["Show HN", "GitHub"],
    "community_quotes": [
      "An LLM-optimized programming language",
      "Addresses the unique needs and patterns of AI-driven software development",
      "Is the world ready for another programming language?"
    ]
  }
]
