[
  {
    "name": "Qwen Code",
    "url": "https://github.com/QwenLM/qwen-code",
    "description": "An open-source AI coding agent that runs in the terminal, optimized for Qwen3-Coder model. Provides CLI-based autonomous coding assistance with repo-aware capabilities and multi-file project support. Latest nightly release v0.7.0-nightly.20260111 demonstrates active development.",
    "release_date": "2026-01-11",
    "category": "AI coding CLI",
    "sources": ["GitHub"],
    "community_quotes": [
      "Open-source AI agent that lives in the terminal",
      "Optimized for Qwen3-Coder model with strong performance",
      "Actively developed with January 2026 releases"
    ]
  },
  {
    "name": "SeaVerse AI Native Platform",
    "url": "https://www.eqs-news.com/news/corporate-news/seaverse-launches-world-s-first-ai-native-platform-all-in-ai-native-leads-the-forward-looking-revolution-in-ai-creation/87c43401-044a-4eff-a775-02098f8643f4_en",
    "description": "World's first AI Native Platform called 'All in AI Native,' focused on forward-looking revolution in AI creation and development workflows. Launched as a comprehensive AI-native development environment.",
    "release_date": "2026-01-10",
    "category": "AI IDE",
    "sources": ["Press Release"],
    "community_quotes": [
      "World's first AI Native Platform",
      "Forward-looking revolution in AI creation"
    ]
  },
  {
    "name": "Spec Coding by Capacity",
    "url": "https://capacity.so/",
    "description": "A spec-driven AI development platform that enforces 'spec-first' approach to building full-stack web applications. Instead of chaotic 'vibe coding,' users define specifications first with an AI planning assistant, then generate production-ready code. Reached #1 Product of the Day on Product Hunt with 311 upvotes.",
    "release_date": "2026-01-08",
    "category": "AI IDE",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Vibe coding with a planning assistant to build with clarity",
      "Ask first, build later - a spec-first approach to AI-assisted development",
      "Reached #1 Product of the Day on Product Hunt",
      "Helps eliminate technical debt in AI app development through spec-driven coding"
    ]
  },
  {
    "name": "IQuest-Coder-V1",
    "url": "https://github.com/IQuestLab/IQuest-Coder-V1",
    "description": "An open-source coding AI model family (7B-40B parameters) that uses innovative Code-Flow Training to learn from repository evolution patterns and commit histories. Achieves state-of-the-art performance on SWE-Bench Verified (76.2%), LiveCodeBench v6 (81.1%), and BigCodeBench (49.9%), matching or beating models 10-20x its size.",
    "release_date": "2026-01-01",
    "category": "code model",
    "sources": ["GitHub", "DEV Community", "Hacker News"],
    "community_quotes": [
      "Matches or beats Claude Sonnet 4.5 and GPT models with only 40 billion parameters - 10x to 20x smaller",
      "Uses innovative Code-Flow Training that learns from commit histories and repository evolution instead of static code snapshots",
      "First coding AI release of 2026 that came from an unexpected source - a Chinese quantitative hedge fund",
      "The Thinking variant with reasoning-driven RL is specifically optimized for complex algorithmic problem solving",
      "Fully open source with weights, training code, and evaluation scripts all available under modified MIT license"
    ]
  }
]
