[
  {
    "name": "IQuest Coder V1",
    "url": "https://github.com/IQuestLab/IQuest-Coder-V1",
    "description": "Open-source AI coding model from Chinese hedge fund Ubiquant's IQuest Lab, released in three variants (Instruct, Thinking, Loop) with 7B-40B parameter sizes. Features novel 'Code-Flow Training' methodology that learns from code evolution patterns, commit histories, and repository transformations rather than static code snapshots. Achieves benchmark scores matching or beating Claude Sonnet 4.5 and GPT models with 10-20x fewer parameters.",
    "release_date": "2026-01-02",
    "category": "open-source AI coding agent",
    "sources": ["DEV Community", "GitHub", "HuggingFace"],
    "community_quotes": [
      "Matches or beats Claude Sonnet 4.5 with only 40B parameters vs 400-800B+",
      "Novel Code-Flow Training learns from how code evolves, not just static snapshots",
      "From a hedge fund, not a tech company - unexpected source of frontier AI",
      "Fully open source with self-hosting capabilities"
    ]
  },
  {
    "name": "FetchCoder V2",
    "url": "https://fetch.ai/",
    "description": "AI coding assistant launched by Fetch.ai specifically for building AI agents and autonomous agents. Designed to help developers ship autonomous agents that can participate in Fetch.ai's new AI-to-AI payment system. Part of Fetch.ai's January 2026 initiative to advance the autonomous agent ecosystem with tools for agent creation and real-world transaction capabilities.",
    "release_date": "2026-01-15",
    "category": "AI coding agent",
    "sources": ["SiliconANGLE", "X/Twitter", "Fetch.ai"],
    "community_quotes": [
      "Specifically designed for building autonomous AI agents",
      "Part of broader AI-to-AI payment ecosystem launch",
      "Helps developers ship agents that can execute real-world transactions"
    ]
  },
  {
    "name": "Claude Cowork",
    "url": "https://www.anthropic.com/news/introducing-anthropic-labs",
    "description": "Anthropic's desktop AI agent launched as a research preview in January 2026, integrated into the Claude Desktop app for macOS. Provides 'Claude Code-style' agentic capabilities but for general desktop computing tasks including file management, folder access, and task automation. Allows Claude to read, modify, and work with local files directly on the computer.",
    "release_date": "2026-01-12",
    "category": "desktop AI agent",
    "sources": ["Ars Technica", "VentureBeat", "TechCrunch", "Fortune"],
    "community_quotes": [
      "Claude Code for non-developer work",
      "Can work directly with files and folders on your computer",
      "Brings agentic AI capabilities to general desktop productivity"
    ]
  }
]
