[
  {
    "title": "Generative coding: 10 Breakthrough Technologies 2026",
    "description": "MIT Technology Review names generative coding as one of the top 10 breakthrough technologies of 2026. The article reports that AI now writes as much as 30% of Microsoft's code and more than a quarter of Google's, while Mark Zuckerberg aspires to have most of Meta's code written by AI agents. New tools like Microsoft Copilot, Cursor, Lovable, and Replit are enabling even people with little coding knowledge to build impressive apps. The article highlights the rise of 'vibe coding' where practitioners let AI take the lead, but warns that AI hallucinations mean there's no guarantee suggestions will be helpful or secure. The piece also notes early effects on the job market, including fewer entry-level coding jobs.",
    "author": "MIT Technology Review",
    "source": "TechMedia",
    "url": "https://www.technologyreview.com/2026/01/12/1130027/generative-coding-ai-software-2026-breakthrough-technology/",
    "published_date": "2026-01-12",
    "topics": ["AI coding", "breakthrough technology", "industry adoption", "vibe coding", "job market impact"],
    "type": "technical"
  },
  {
    "title": "LLM predictions for 2026, shared with Oxide and Friends",
    "description": "Simon Willison shares his predictions for AI and LLMs in 2026 on the Oxide and Friends podcast. Key predictions include: (1) It will become undeniable that LLMs write good code by 2026, based on the introduction of reasoning models trained with RL; (2) We will finally solve sandboxing - running code safely without malicious access; (3) A 'Challenger disaster' moment for coding agent security when prompt injection causes major damage; (4) The coding agents Jevons paradox will resolve in 3 years - either software engineering careers are devalued or demand increases 10x; (5) Within 3 years, someone will build a new browser using mainly AI-assisted coding; (6) In 6 years, typing code by hand will go the way of punch cards, but software engineering will remain an enormous career with evolving skills.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Jan/8/llm-predictions-for-2026/",
    "published_date": "2026-01-08",
    "topics": ["LLM", "AI coding", "predictions", "security", "software engineering", "future of work"],
    "type": "opinion"
  },
  {
    "title": "My Complete AI Coding Setup in 2026",
    "description": "Fireship (Elie Steinbock) shares his complete AI coding setup for 2026, emphasizing that 'coding has changed forever.' The video covers the tools, workflows, and tricks he uses daily to build Inbox Zero. It provides a comprehensive look at how AI-assisted development has evolved and what tools developers should be using in 2026 for maximum productivity.",
    "author": "Fireship (Elie Steinbock)",
    "source": "YouTube",
    "url": "https://www.youtube.com/watch?v=jR1GkYDkFfk",
    "published_date": "2026-01-08",
    "topics": ["AI coding", "tools", "workflow", "productivity", "development setup"],
    "type": "tutorial"
  },
  {
    "title": "He was called a 'terrorist sympathizer.' Now his AI company is valued at $3B",
    "description": "Profile of Replit founder Amjad Masad, who was shunned in Silicon Valley investor circles for his outspoken views on Palestine, but whose AI coding startup Replit has now reached a $3 billion valuation. The article details how Masad faced criticism and was labeled a 'terrorist sympathizer' for his pro-Palestine stance, which cost him business opportunities and social connections. However, Replit's AI coding agent launch in September 2024 was a breakthrough - revenue reached $150 million within a year, and the company closed deals with Saudi Arabian government agencies, Atlassian, Zillow, and others. Masad maintains he will never work with Israel's government but will work with countries he finds 'tolerable.' The article explores the tension between his political activism and business success in the AI coding boom.",
    "author": "Margaux MacColl",
    "source": "TechMedia",
    "url": "https://sfstandard.com/2026/01/07/called-terrorist-sympathizer-now-ai-company-valued-3b/",
    "published_date": "2026-01-07",
    "topics": ["AI coding", "startup", "valuation", "politics", "Replit", "business"],
    "type": "technical"
  },
  {
    "title": "LLMs contain a LOT of parameters. But what's a parameter?",
    "description": "MIT Technology Review provides a comprehensive explanation of what parameters are in large language models. The article breaks down the three types of parameters: embeddings (mathematical representations of words with around 4,096 dimensions), weights (representing connection strength between model parts), and biases (threshold adjusters). It explains how GPT-3 had 175 billion parameters while Google's Gemini 3 may have 1-7 trillion. The piece also covers techniques for making small models outperform larger ones, including overtraining (training on far more data than previously thought necessary), distillation (using a large model to train a smaller one), and mixture of experts architectures. It notes that straight-up scaling gains are tailing off and 'it's not so much how many you have, but what you do with them.'",
    "author": "MIT Technology Review",
    "source": "TechMedia",
    "url": "https://www.technologyreview.com/2026/01/07/1130795/what-even-is-a-parameter/",
    "published_date": "2026-01-07",
    "topics": ["LLM", "parameters", "embeddings", "weights", "biases", "model architecture", "technical explanation"],
    "type": "technical"
  },
  {
    "title": "What's next for AI in 2026",
    "description": "MIT Technology Review's AI writers make five predictions for 2026: (1) More Silicon Valley products will be built on Chinese LLMs like DeepSeek's R1 and Alibaba's Qwen, as open-weight models offer customization and cost benefits; (2) The US will face another year of regulatory tug-of-war between federal and state governments, with Trump's executive order clashing with state-level AI laws; (3) Chatbots will transform shopping, with Salesforce predicting AI will drive $263 billion in online purchases this holiday season; (4) An LLM will make an important new discovery, following Google DeepMind's AlphaEvolve approach that combines LLMs with evolutionary algorithms; (5) Legal fights will heat up around AI liability issues like chatbot-induced teen suicides and defamation, with notable cases going to trial.",
    "author": "MIT Technology Review",
    "source": "TechMedia",
    "url": "https://www.technologyreview.com/2026/01/05/1130662/whats-next-for-ai-in-2026/",
    "published_date": "2026-01-05",
    "topics": ["AI predictions", "regulation", "Chinese models", "AI commerce", "research", "legal battles"],
    "type": "opinion"
  }
]
