[
  {
    "title": "In 2026, AI will move from hype to pragmatism",
    "description": "TechCrunch analysis predicting 2026 as transition year from brute-force scaling to practical AI deployment. Key trends: (1) Move away from scaling laws toward new architectures, (2) Smaller Language Models (SLMs) fine-tuned for domain-specific enterprise use, (3) World models that learn 3D spatial reasoning and physical interactions, (4) Model Context Protocol (MCP) becoming 'USB-C for AI' to connect agents to real tools, (5) Shift from automation to augmentation - '2026 will be the year of the humans', (6) Physical AI with wearables, smart glasses, and robotics becoming mainstream.",
    "author": "Rebecca Bellan",
    "source": "TechCrunch",
    "url": "https://techcrunch.com/2026/01/02/in-2026-ai-will-move-from-hype-to-pragmatism/",
    "published_date": "2026-01-02",
    "topics": ["AI trends", "SLM", "world models", "MCP", "physical AI", "edge computing", "AI agents"],
    "type": "technical"
  },
  {
    "title": "A new worst coder has entered the chat: vibe coding without code knowledge",
    "description": "First-person account from non-developer using Bolt's vibe coding tool to create a Reddit bathroom review app. Reveals critical gaps in AI coding promise: (1) Tool successfully created working app in ~10 minutes, (2) But code was messy, disorganized, nearly impossible to understand, (3) No security features - data completely exposed to anyone using inspect function, (4) No unit tests, 'productivity tax' where developers must clean up AI-generated code, (5) Highlights danger of 'vibe coding' for production apps without developer oversight. 66% of developers report experiencing this productivity tax.",
    "author": "Stack Overflow Blog",
    "source": "Blog",
    "url": "https://stackoverflow.blog/2026/01/02/a-new-worst-coder-has-entered-the-chat-vibe-coding-without-code-knowledge/",
    "published_date": "2026-01-02",
    "topics": ["vibe coding", "AI coding limitations", "security", "code quality", "developer workflow"],
    "type": "opinion"
  },
  {
    "title": "2025: The year in LLMs",
    "description": "Simon Willison's comprehensive annual LLM review covering 27 major trends: reasoning models (RLVR), agents, coding agents (Claude Code), LLMs on command-line, $200/month subscriptions, Chinese open weight models dominating, long tasks doubling every 7 months, prompt-driven image editing (Nano Banana), models winning gold in academic competitions, Llama losing its way, OpenAI losing their lead to Gemini, vibe coding phenomenon, MCP protocol, AI-enabled browsers, 'lethal trifecta' security concept, programming on phones, conformance suites for AI testing, local vs cloud model trade-offs, 'slop' as word of the year, data center unpopularity.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/31/the-year-in-llms/",
    "published_date": "2025-12-31",
    "topics": ["LLM", "AI agents", "coding agents", "vibe coding", "open source models", "Chinese AI", "security", "MCP", "image generation"],
    "type": "technical"
  }
]