[
  {
    "title": "Introducing the Codex app",
    "description": "OpenAI released a new macOS app for their Codex coding agent. Key features: first-class support for Skills, Automations for running scheduled tasks (tracks state in SQLite), built with Electron for cross-platform support (Windows coming soon). Usage stats: since GPT-5.2-Codex launch in mid-December, overall Codex usage has doubled, and in the past month more than a million developers have used Codex. Codex is described as 'a general agent harness disguised as a tool for programmers' - everything is controlled by code, so better reasoning about code makes agents more capable across all technical and knowledge work.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/2/codex-app/",
    "published_date": "2026-02-02",
    "topics": ["OpenAI", "Codex", "AI coding", "coding agents", "macOS app", "skills", "automations", "SQLite"],
    "type": "technical"
  },
  {
    "title": "A Social Network for A.I. Bots Only. No Humans Allowed.",
    "description": "Simon Willison interviewed by Cade Metz for New York Times piece on OpenClaw and Moltbook. Simon's quote: 'Most of it is complete slop' referring to bot conversations playing out sci-fi scenarios from training data. Noted that AI agents have become significantly more powerful in past months and people want digital assistants. One bot created a forum 'What I Learned Today' explaining how it built Android smartphone control. Concerns: systems still do things people don't want them to do, and plain English communication can be coaxed into malicious behavior.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/2/nyt-moltbook/",
    "published_date": "2026-02-02",
    "topics": ["Moltbook", "OpenClaw", "AI agents", "New York Times", "AI slop", "AI safety", "prompt injection"],
    "type": "opinion"
  },
  {
    "title": "State of AI in 2026: LLMs, Coding, Scaling Laws, China, Agents, GPUs, AGI",
    "description": "Lex Fridman Podcast #490 with Nathan Lambert (AI2 post-training lead, author of The RLHF Book) and Sebastian Raschka (author of Build a Large Language Model From Scratch). Comprehensive discussion covering: China vs US AI race, ChatGPT vs Claude vs Gemini vs Grok comparison, best AI for coding, open source vs closed source LLMs, evolution of Transformers since 2019, AI scaling laws status, pre-training/mid-training/post-training explained, tool use, continual learning, long context, robotics, timeline to AGI, will AI replace programmers, future of NVIDIA and GPUs, big acquisitions in 2026, future of OpenAI/Anthropic/Google DeepMind/xAI/Meta.",
    "author": "Lex Fridman with Nathan Lambert and Sebastian Raschka",
    "source": "Podcast",
    "url": "https://lexfridman.com/ai-sota-2026/",
    "published_date": "2026-02-01",
    "topics": ["AI state of the art", "LLMs", "AI coding", "scaling laws", "China AI", "agents", "GPUs", "AGI", "open vs closed source", "Transformers"],
    "type": "discussion"
  },
  {
    "title": "TIL: Running OpenClaw in Docker",
    "description": "Technical guide on running OpenClaw using Docker on Mac. Covers: Docker Compose configuration, administrative commands, Telegram bot setup, web UI access, running commands as root. Shows OpenClaw Gateway Dashboard web interface with categorized tools: File & workspace (read, write, edit), Shell/processes (exec, process), Web (web_search, web_fetch, browser), UI/rendering (canvas), Devices/nodes.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/1/openclaw-docker/",
    "published_date": "2026-02-01",
    "topics": ["OpenClaw", "Docker", "AI agents", "web UI", "Telegram bot", "TIL"],
    "type": "tutorial"
  },
  {
    "title": "A few random notes from Claude coding quite a bit last few weeks",
    "description": "Andrej Karpathy shares detailed observations about shifting from 80% manual+autocomplete coding to 80% agent coding. Key insights: workflow transformation in weeks, 'atrophy' of manual coding skills, models make subtle conceptual errors not syntax errors, need for lightweight inline plan mode, LLMs overcomplicate code, programming is more fun with agents, predicts 2026 as 'year of the slopacolypse' across GitHub/Substack/arXiv. Notes LLM agent capabilities crossed threshold of coherence around December 2025 causing phase shift in software engineering.",
    "author": "Andrej Karpathy",
    "source": "Twitter",
    "url": "https://x.com/karpathy/status/2015883857489522876",
    "published_date": "2026-01-28",
    "topics": ["AI coding", "LLM agents", "workflow transformation", "skill atrophy", "vibe coding", "slopacolypse", "Claude Code"],
    "type": "opinion"
  },
  {
    "title": "Adding dynamic features to an aggressively cached website",
    "description": "Simon Willison explains how to add dynamic features to a website behind Cloudflare with aggressive 15-minute caching. Techniques for working around full-page caching while maintaining resilience to traffic spikes. Practical implementation details for adding interactive elements without compromising cache performance.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Jan/28/dynamic-features-cached-site/",
    "published_date": "2026-01-28",
    "topics": ["caching", "Cloudflare", "JavaScript", "localStorage", "dynamic features", "web development"],
    "type": "tutorial"
  },
  {
    "title": "The Five Levels: from Spicy Autocomplete to the Dark Factory",
    "description": "Dan Shapiro proposes a five-level model of AI-assisted programming: Level 0 (Spicy autocomplete), Level 1 (Coding intern), Level 2 (Junior developer), Level 3 (Developer - full-time code reviewer), Level 4 (Engineering team - PM role), Level 5 (Dark software factory). Level 5 involves no human code review, goal is proving the system works with extensive testing/tooling/simulation. Simon has interviewed a team doing this pattern - tiny teams building unbelievable things in months using AI agents.",
    "author": "Dan Shapiro (via Simon Willison)",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Jan/28/five-levels-ai-programming/",
    "published_date": "2026-01-28",
    "topics": ["AI coding", "automation levels", "coding agents", "dark factory", "AI assistance"],
    "type": "opinion"
  },
  {
    "title": "One Human + One Agent = One Browser From Scratch",
    "description": "In response to Cursor's FastRender browser project (thousands of parallel agents, ~1.6M lines of Rust), embedding-shapes built a web browser using a single Codex CLI agent in 3 days. Result: 20,000 lines of Rust that successfully renders HTML+CSS with no crate dependencies (uses OS frameworks for image/text rendering). Simon upgraded prediction: will see production-grade web browser built by small team using AI assistance by 2029, not just experimental ones. Shows single agent + talented engineer can achieve impressive results.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Jan/27/one-agent-one-browser/",
    "published_date": "2026-01-27",
    "topics": ["browser", "Rust", "coding agents", "Codex CLI", "AI programming", "FastRender"],
    "type": "technical"
  },
  {
    "title": "Kimi K2.5: Visual Agentic Intelligence",
    "description": "Kimi K2.5 adds multimodal capabilities to the 1 trillion parameter K2 model. Trained on ~15T mixed visual and text tokens as native multimodal model. Key feature: 'self-directed agent swarm paradigm' - can coordinate up to 100 sub-agents across 1,500 tool calls, reducing execution time up to 4.5x. Simon tested visual generation (pelican on bicycle) and multi-agent planning tasks. Hugging Face repo is 595GB, uses modified MIT license with attribution requirement for large-scale commercial use.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Jan/27/kimi-k2-5/",
    "published_date": "2026-01-27",
    "topics": ["Kimi K2.5", "multimodal", "vision LLM", "agent swarm", "tool calling", "Moonshot AI"],
    "type": "technical"
  }
]
