[
  {
    "title": "Hacker News: By what percentage has AI changed your output?",
    "description": "Ask HN discussion requesting developers to quantify productivity changes compared to ~2 years ago before AI coding tools became prevalent. Community discussion on real-world impact of AI coding assistants.",
    "author": "Hacker News Community",
    "source": "Community",
    "url": "https://news.ycombinator.com/item?id=46409375",
    "published_date": "2025-12-28",
    "topics": ["AI coding", "productivity", "developer experience", "community discussion"],
    "type": "discussion"
  },
  {
    "title": "Top Stories of 2025: Agents Write Code Faster, Cheaper",
    "description": "DeepLearning.ai's year-end review highlights that coding agents using the latest LLMs now routinely complete more than 80% of SWE-Bench tasks, up from 13.86% in 2024. Claude Code, Google Gemini CLI, and OpenAI Codex emerged as competitive battlegrounds. Top models include Gemini 3 Pro, Claude Opus 4.5, and GPT-5.2. Open-weights models like Z.ai GLM-4.5, Moonshot Kimi K2, and Qwen3-Coder (480B params) enable dramatic cost savings. Vibe-coding moved from buzzword to burgeoning industry with startups like Loveable, Replit, and Vercel.",
    "author": "DeepLearning.ai / The Batch",
    "source": "Tech Media",
    "url": "https://www.deeplearning.ai/the-batch/issue-333/",
    "published_date": "2025-12-26",
    "topics": ["AI coding", "agents", "SWE-Bench", "Claude Code", "Gemini", "GPT-5.2", "vibe-coding", "benchmarking"],
    "type": "technical"
  },
  {
    "title": "Top Stories of 2025: Thinking Models Solve Bigger Problems",
    "description": "DeepLearning.ai reports that reasoning models became standard in 2025, with OpenAI o1 preview outperforming GPT-4o by 43 percentage points on AIME 2024 math problems and 22 points on GPQA Diamond science questions. Reasoning models achieved 62nd percentile on Codeforces vs 11th for non-reasoning models. Key innovation: fine-tuning via reinforcement learning from verifiable rewards. However, Apple found reasoning models struggle beyond certain complexity levels, and Anthropic found reasoning steps may omit crucial information.",
    "author": "DeepLearning.ai / The Batch",
    "source": "Tech Media",
    "url": "https://www.deeplearning.ai/the-batch/issue-333/",
    "published_date": "2025-12-26",
    "topics": ["reasoning models", "o1", "GPT-4o", "RL", "math", "coding", "benchmarks", "AI limitations"],
    "type": "technical"
  },
  {
    "title": "uv-init-demos: Exploring uv init options",
    "description": "Simon created a GitHub repository demonstrating all the different options of uv's init command (--app, --package, --lib), generated using a Claude Code prompt and scheduled to run via GitHub Actions to capture changes from future releases.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/24/uv-init-demos/",
    "published_date": "2025-12-24",
    "topics": ["Python", "uv", "tooling", "GitHub Actions", "Claude Code", "automation"],
    "type": "technical"
  },
  {
    "title": "MicroQuickJS as a robust sandboxing environment for LLM-generated code",
    "description": "Simon Willison explores using MicroQuickJS (Fabrice Bellard's new 100KB JavaScript engine for embedded systems) as a sandboxing solution for executing untrusted code from LLMs. The engine has robust memory and time limits baked in, doesn't expose dangerous primitives like filesystem or network access, and even has a regex engine that protects against exhaustion attacks. Simon used Claude Code to investigate Python bindings, WebAssembly compilation, and testing across Node.js, Deno, and Pyodide.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/23/microquickjs/",
    "published_date": "2025-12-23",
    "topics": ["sandboxing", "LLMs", "JavaScript", "WebAssembly", "AI safety", "code execution", "Claude Code"],
    "type": "technical"
  },
  {
    "title": "Cooking with Claude: vibe-coding custom applications",
    "description": "Simon describes using LLMs for cooking tasks, progressing from basic recipes to advanced applications. He had Claude vibe-code a custom application to help with timing for complicated meal preparation. This demonstrates how AI coding assistants are becoming useful for domains far beyond traditional software development.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/23/cooking-with-claude/",
    "published_date": "2025-12-23",
    "topics": ["LLMs", "vibe-coding", "AI applications", "Claude", "practical AI usage"],
    "type": "opinion"
  },
  {
    "title": "First success using Claude in Chrome browser agent",
    "description": "Simon successfully used the Claude in Chrome extension to solve a real problem - finding a Cloudflare configuration for CORS headers. Despite being skeptical of browser agents due to prompt injection risks, he found the 1m45s session very effective. The agent navigated the Cloudflare dashboard and found the Response Header Transform Rule configuration.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/22/claude-chrome-agent/",
    "published_date": "2025-12-22",
    "topics": ["browser agents", "Claude", "AI agents", "prompt injection", "Cloudflare", "practical AI"],
    "type": "opinion"
  }
]
