[
  {
    "name": "Harness Human-Aware Change Agent",
    "url": "https://harness.io",
    "description": "An AI agent specifically trained to help DevOps teams investigate incidents. Combines human insight with change data to create execution obligations, designed specifically for incident investigation workflows.",
    "release_date": "2026-01-22",
    "category": "workflow agent",
    "sources": ["Futurum Group", "DevOps.com"],
    "community_quotes": [
      "Harness announces AI agent for incident investigation",
      "Combines human insight with change data",
      "Specifically designed to help DevOps teams investigate incidents"
    ]
  },
  {
    "name": "flins",
    "url": "https://flins.tech",
    "description": "A universal skill and command manager for AI coding tools. Acts as a dependency manager for agent skills (similar to npm), allowing developers to manage skills consistently across multiple AI coding agents with commands like add, update, remove, list, and search.",
    "release_date": "2026-01-19",
    "category": "AI coding CLI",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Agent Skills is now an open standard, but each AI agent manages skills differently, making multi-agent workflows hard to maintain",
      "flins acts as a dependency manager for agent skills, similar to npm",
      "Commands like flins add, update, remove, list, and search help manage skills across multiple AI coding agents"
    ]
  },
  {
    "name": "Phoenix CLI",
    "url": "https://github.com/arize-ai/phoenix",
    "description": "A command-line interface for retrieving trace data from Phoenix observability platform. It makes Phoenix data available where AI coding assistants already work—in the terminal and through files. The CLI enables AI assistants like Claude Code, Cursor, Windsurf, Codex, and Gemini CLI to query observability data directly via shell commands and retrieve trace data as structured JSON for debugging and analysis.",
    "release_date": "2026-01-17",
    "category": "AI coding CLI",
    "sources": ["Arize Phoenix Documentation", "Release Notes"],
    "community_quotes": [
      "Your AI assistant can now query your Phoenix instance directly via shell commands and retrieve trace data as structured JSON",
      "For these assistants to help debug and improve AI applications, they need access to observability data through these same interfaces",
      "A browser-based UI, while useful for humans, is inaccessible to an AI assistant working in your IDE"
    ]
  },
  {
    "name": "1Code",
    "url": "https://1code.dev",
    "description": "An open-source Cursor-like UI for running multiple Claude Code agents in parallel. Works on Mac with worktree support and Web with remote sandbox previews.",
    "release_date": "2026-01-16",
    "category": "AI IDE",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Running multiple Claude Codes in parallel dramatically sped up how we build features",
      "Open source alternative to Cursor for Claude Code",
      "#1 Product of the Day on January 16th, 2026 with 506 upvotes"
    ]
  },
  {
    "name": "GitHub Copilot CLI Enhanced",
    "url": "https://github.blog/changelog/2026-01-14-github-copilot-cli-enhanced-agents-context-management-and-new-ways-to-install/",
    "description": "Major update to GitHub Copilot CLI with enhanced agents, context management, and new installation methods. Introduces built-in custom agents (Explore, Task, Plan, Code-review), auto-compaction when approaching token limits, and automation/scripting flags for CI/CD pipelines.",
    "release_date": "2026-01-14",
    "category": "AI coding CLI",
    "sources": ["GitHub Blog"],
    "community_quotes": [
      "Copilot delegates to these agents automatically when appropriate and can run multiple agents in parallel",
      "Package manager and install script installations automatically update",
      "New flags make Copilot CLI easier to use in scripts and pipelines via copilot -p"
    ]
  },
  {
    "name": "Claude Cowork",
    "url": "https://claude.com/blog/cowork-research-preview",
    "description": "A general-purpose AI agent launched as a research preview that automates file management and document processing. Built as an evolution of Claude Code, it offers permanent memory and works directly with files on your computer through the Claude Desktop app.",
    "release_date": "2026-01-12",
    "category": "code agent",
    "sources": ["Claude Blog", "TechCrunch", "InfoQ"],
    "community_quotes": [
      "Claude Cowork now has permanent memory",
      "Built in just 10 days by Claude Code itself",
      "A personal assistant that can work directly with files on your computer"
    ]
  },
  {
    "name": "AI Test Engineer by BlinqIO",
    "url": "https://www.producthunt.com/products/ai-test-engineer-by-blinqio",
    "description": "An AI-powered testing tool that creates, maintains, executes, and analyzes end-to-end tests automatically. Integrates with Playwright automation framework, generates real code in your repository, and features self-healing tests that adapt when applications change.",
    "release_date": "2026-01-12",
    "category": "workflow agent",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Achieved #4 ranking on Product Hunt with 205 upvotes",
      "Builds and maintains Playwright automation in minutes",
      "Self-healing tests automatically adapt when application changes occur"
    ]
  }
]