[
  {
    "name": "Overture",
    "url": "https://github.com/SixHq/Overture",
    "description": "Open-source, locally running MCP server that visually maps out the execution plan of any AI coding agent as an interactive flowchart/graph before the agent begins writing code. Helps developers understand and review agent plans before execution.",
    "release_date": "2026-02-17",
    "category": "AI agent visualization",
    "sources": ["GitHub"],
    "community_quotes": [
      "Overture is an open-source, locally running web interface delivered as an MCP (Model Context Protocol) server"
    ]
  },
  {
    "name": "AgenticLibrary",
    "url": "https://github.com/Veinpal-OpenSource/AgenticLibrary",
    "description": "Open-source library of production-grade AI agent skill files. Browse, copy, and contribute skills for GitHub Copilot, Cursor, Claude, and other AI coding assistants. Provides reusable agent capabilities across different AI coding platforms.",
    "release_date": "2026-02-15",
    "category": "AI agent skills library",
    "sources": ["GitHub"],
    "community_quotes": [
      "Open-source library of production-grade AI agent skill files"
    ]
  },
  {
    "name": "Sophie",
    "url": "https://github.com/aaron777collins/sophie",
    "description": "AI agent workspace template with hierarchical memory, planning systems, and verification chains. Built for Clawdbot/OpenClaw to provide persistent workspace memory across sessions.",
    "release_date": "2026-02-14",
    "category": "Workspace memory agent",
    "sources": ["GitHub"],
    "community_quotes": [
      "AI agent workspace template with hierarchical memory, planning systems, and verification chains"
    ]
  },
  {
    "name": "CraigClaw",
    "url": "https://github.com/Merit-Systems/CraigClaw",
    "description": "Craig's OpenClaw workspace – a production AI agent with personality, memory, skills, and deployment for Merit-Systems. Features version-controlled brain (SOUL.md, AGENTS.md, MEMORY.md), self-modification via PRs, auto-deploy via GitHub Actions, Discord integration, and GitHub App for org-wide repo access.",
    "release_date": "2026-02-11",
    "category": "Production AI agent workspace",
    "sources": ["GitHub"],
    "community_quotes": [
      "Craig2 is Merit-Systems' AI agent, powered by OpenClaw. He lives on Discord, has write access to every repo in the Merit-Systems org",
      "This repo IS Craig's brain -- his personality, memory, skills, and operating instructions are all here, version-controlled and auto-deployed"
    ]
  },
  {
    "name": "AgentProbe",
    "url": "https://github.com/alexmelges/agentprobe",
    "description": "Adversarial security testing tool for AI agents (like OWASP ZAP for AI) that throws 194+ adversarial attacks including prompt injection, data exfiltration, permission escalation, multi-agent attacks, GitHub workflow attacks, and WebMCP browser agent attacks. Can be integrated into CI with SARIF output for GitHub Security tab.",
    "release_date": "2025-02-19",
    "category": "AI security testing",
    "sources": ["Hacker News", "GitHub"],
    "community_quotes": [
      "Show HN: AgentProbe – adversarial security testing for AI agents (134 attack patterns)"
    ]
  },
  {
    "name": "Rune (Rune-stone)",
    "url": "https://github.com/vict00r99/Rune-stone",
    "description": "An open specification pattern for consistent AI code generation that defines function behavior through structured specs (SIGNATURE, BEHAVIOR, TESTS) to ensure any AI tool generates code with identical behavior across different developers and languages.",
    "release_date": "2025-02-19",
    "category": "AI code generation spec",
    "sources": ["Hacker News", "GitHub"],
    "community_quotes": [
      "Show HN: Rune – Open spec pattern for consistent AI code generation"
    ]
  },
  {
    "name": "Qwen Code",
    "url": "https://github.com/QwenLM/qwen-code",
    "description": "An open-source AI agent for the terminal, optimized for Qwen3-Coder. Helps understand large codebases, automate tedious work, and ship faster. Features include OAuth free tier, multi-protocol support (OpenAI/Anthropic/Gemini), Skills, SubAgents, and IDE integrations for VS Code, Zed, and JetBrains.",
    "release_date": "2025-02-19",
    "category": "AI coding CLI",
    "sources": ["GitHub"],
    "community_quotes": [
      "An open-source AI agent that lives in your terminal"
    ]
  }
]
