[
  {
    "title": "OpenAI says AI browsers may always be vulnerable to prompt injection attacks",
    "description": "OpenAI researchers found that AI-powered web browsing agents may always be vulnerable to prompt injection attacks hidden in webpage content, revealing fundamental security challenges for autonomous AI agents that navigate and interact with the web autonomously. The research highlights that even state-of-the-art models like GPT-5.1 can be tricked by malicious commands hidden in webpages, with implications for the future of AI agent security and reliability.",
    "author": "TechCrunch",
    "source": "TechMedia",
    "url": "https://techcrunch.com/2025/12/22/openai-says-ai-browsers-may-always-be-vulnerable-to-prompt-injection-attacks/",
    "published_date": "2025-12-22",
    "topics": ["AI Security", "Prompt Injection", "AI Agents", "OpenAI", "Web Browsing Agents", "GPT-5.1"],
    "type": "technical"
  },
  {
    "title": "2025 Was the Year AI Changed Software Engineering",
    "description": "YouTube video reviewing how 2025 was a paradigm shift year for AI in software engineering - moving from tab-tab-tab completion to building entire systems with a single prompt. The video covers how AI coding evolved from simple autocomplete to system-building capabilities, laying the foundation for future development practices.",
    "author": "Matt Maher",
    "source": "YouTube",
    "url": "https://www.youtube.com/watch?v=betoeAJnxcw",
    "published_date": "2025-12-22",
    "topics": ["AI", "Software Engineering", "AI Coding", "Paradigm Shift", "Vibe Coding"],
    "type": "opinion"
  },
  {
    "title": "2025 LLM Year in Review - 6 Major Paradigm Changes",
    "description": "Andrej Karpathy's comprehensive year-end review covering: 1) Reinforcement Learning from Verifiable Rewards (RLVR) as a new major training stage that enables reasoning capabilities through verifiable environments; 2) Ghosts vs Animals/Jagged Intelligence - understanding LLMs as fundamentally different entities with jagged capability profiles; 3) Cursor revealing a new layer of LLM apps that orchestrate multiple LLM calls with vertical-specific GUIs; 4) Claude Code as the first convincing LLM agent demonstration running locally on user computers; 5) Vibe Coding - AI crossing threshold to build impressive programs via English, making programming accessible to everyone; 6) Google Gemini Nano banana as early hint of LLM GUI moving beyond text chat to visual/spatial interfaces. Key insight: LLMs are emerging as new kind of intelligence, simultaneously smarter and dumber than expected, with industry having realized less than 10% of their potential.",
    "author": "Andrej Karpathy",
    "source": "Blog",
    "url": "https://karpathy.bearblog.dev/year-in-review-2025/",
    "published_date": "2025-12-19",
    "topics": ["LLM", "Reinforcement Learning", "AI Agents", "Vibe Coding", "Cursor", "Claude Code", "AI Paradigms", "Jagged Intelligence", "AI GUI"],
    "type": "opinion"
  },
  {
    "title": "Holistic Evaluation of State-of-the-Art LLMs for Code Generation",
    "description": "Comprehensive empirical evaluation of 6 state-of-the-art LLMs for code generation capabilities, assessing their performance across various programming tasks and benchmarks.",
    "author": "ArXiv Researchers",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2512.18131",
    "published_date": "2025-12-18",
    "topics": ["LLM", "Code Generation", "Evaluation", "Benchmarking"],
    "type": "technical"
  },
  {
    "title": "Multicalibration for LLM-based Code Generation",
    "description": "Investigates calibration of code LLMs and their confidence scores, addressing reliability concerns in AI-generated code through multicalibration techniques.",
    "author": "ArXiv Researchers",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2512.08810",
    "published_date": "2025-12-09",
    "topics": ["LLM", "Code Generation", "Calibration", "Reliability"],
    "type": "technical"
  },
  {
    "title": "LLM Unlearning for Reliable Hardware Code Generation",
    "description": "Focuses on LLMs for digital hardware design through automated code generation, exploring unlearning techniques to improve reliability in hardware description languages.",
    "author": "ArXiv Researchers",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2512.05341",
    "published_date": "2025-12-06",
    "topics": ["LLM", "Hardware Code Generation", "Unlearning", "Verilog"],
    "type": "technical"
  },
  {
    "title": "Dialogue-Based Data Generation for LLM Code Translation",
    "description": "Automated dataset generation pipeline with dual-LLM Questioner-Solver design for improving code translation capabilities.",
    "author": "ArXiv Researchers",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2512.03086",
    "published_date": "2025-12-04",
    "topics": ["LLM", "Code Translation", "Data Generation", "Dialogue Systems"],
    "type": "technical"
  },
  {
    "title": "Feasibility of AI-Assisted Programming for End-User Developers",
    "description": "Investigates AI-assisted end-user coding paradigm, examining how natural language programming can democratize software development.",
    "author": "ArXiv Researchers",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2512.05666",
    "published_date": "2025-12-05",
    "topics": ["AI Coding", "End-User Development", "Vibe Coding", "Natural Language Programming"],
    "type": "technical"
  },
  {
    "title": "DeepCode: Open Agentic Coding",
    "description": "Presents an open agentic coding framework, exploring autonomous AI agents for software development tasks.",
    "author": "ArXiv Researchers",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2512.07921",
    "published_date": "2025-12-08",
    "topics": ["AI Agents", "Agentic Coding", "Software Engineering", "Open Source"],
    "type": "technical"
  },
  {
    "title": "LLM Year in Review - Hacker News Discussion",
    "description": "Hacker News community discussion on Andrej Karpathy's 2025 LLM Year in Review, with insights on Cursor vs Claude Code, practical experiences with AI coding tools, and community perspectives on the paradigm shifts.",
    "author": "Hacker News Community",
    "source": "HN",
    "url": "https://news.ycombinator.com/item?id=46330726",
    "published_date": "2025-12-20",
    "topics": ["LLM", "Claude Code", "Cursor", "AI Coding", "Community Discussion"],
    "type": "discussion"
  },
  {
    "title": "A guide to local coding models - Hacker News Discussion",
    "description": "Hacker News discussion about local LLM coding experiences, comparing different models and approaches for running AI coding assistants locally.",
    "author": "Hacker News Community",
    "source": "HN",
    "url": "https://news.ycombinator.com/item?id=46348329",
    "published_date": "2025-12-22",
    "topics": ["Local LLMs", "AI Coding", "Code Models", "Privacy"],
    "type": "discussion"
  }
]