[
  {
    "name": "Cursor Visual Editor",
    "url": "https://cursor.com/",
    "description": "A visual drag-and-drop design editor integrated into Cursor's AI-powered IDE that allows developers and designers to visually edit web applications with real-time code updates.",
    "release_date": "2025-12-12",
    "category": "AI IDE",
    "sources": ["Product Hunt", "WIRED", "DevClass"],
    "community_quotes": [
      "Ranked #2 Product of the Day on Product Hunt with 479+ upvotes",
      "Clean UI/UX and top-notch AI integration - feels like pair programming",
      "Can fix tiny layout annoyances without begging AI to not wreck your file",
      "Developers report bugs and stability issues with ever-changing UI",
      "Trustpilot reviews cite largely negative user experience due to constant UI changes"
    ]
  },
  {
    "name": "GPT-5.2-Codex",
    "url": "https://openai.com/index/introducing-gpt-5-2-codex/",
    "description": "OpenAI's most advanced agentic coding model, released as part of the GPT-5.2 family, focused on professional software engineering and defensive cybersecurity with availability across CLI, IDE extensions, and cloud platforms.",
    "release_date": "2025-12-18",
    "category": "code agent",
    "sources": ["OpenAI Blog", "SD Times", "Hacker News"],
    "community_quotes": [
      "So good at finding bugs and little inconsistencies, it's astounding",
      "Where Claude Code is good at 'raw coding', Codex/GPT5.x excels at bug detection",
      "Positioned as most advanced agentic coding model for professional software engineering",
      "Developer fatigue from constant model releases - new models trumping each other weekly"
    ]
  },
  {
    "name": "MiniMax M2.1",
    "url": "https://www.minimax.io/news/minimax-m21",
    "description": "A multilingual AI coding model optimized for various programming tools and agent frameworks, designed for \"Vibe\" AppDev and Native Mobile development with compact, fast, and cost-effective architecture.",
    "release_date": "2025-12-23",
    "category": "AI coding CLI",
    "sources": ["SiliconAngle", "Ollama", "Kilo Blog", "Reddit"],
    "community_quotes": [
      "MiniMax M2.1 is a straight up beast at UI/UX design",
      "Using M2.1 full-time as a developer - purely for writing code",
      "Usage of MiniMax M2 is skyrocketing in Kilo Code",
      "Tops coding benchmarks, rivals GPT/Claude at a fraction of the cost",
      "Significantly enhanced coding capabilities particularly in Rust"
    ]
  },
  {
    "name": "Junie by JetBrains",
    "url": "https://plugins.jetbrains.com/plugin/26104-junie-the-ai-coding-agent-by-jetbrains",
    "description": "JetBrains' AI coding agent plugin that handles tasks autonomously or in collaboration with developers, featuring configurable command execution and agentic AI capabilities.",
    "release_date": "2025-12-18",
    "category": "IDE-integrated AI tool",
    "sources": ["JetBrains Plugin Marketplace", "DevClass", "Reddit"],
    "community_quotes": [
      "One of the best coding agents - very well integrated with IntelliJ, great for Kotlin",
      "Junie is slow... but absolutely great! Cursor killer?",
      "Only works with IntelliJ IDEA Ultimate, not Community Edition",
      "Credit/quota system lacks transparency - quota depleted after 8 days of use",
      "Struggles with understanding large code blocks over a couple kilobytes"
    ]
  }
]