[
  {
    "name": "Cursor Visual Editor",
    "url": "https://cursor.com/",
    "description": "A visual drag-and-drop design editor integrated into Cursor's AI-powered IDE that allows developers and designers to visually edit web applications with real-time code updates, similar to Chrome DevTools with enhanced AI capabilities.",
    "release_date": "2025-12-12",
    "category": "AI IDE",
    "sources": ["Product Hunt", "WIRED", "DevClass"],
    "community_quotes": [
      "Ranked #2 Product of the Day on Product Hunt",
      "Clean UI/UX and top-notch AI integration - feels like pair programming",
      "Can fix tiny layout annoyances without begging AI to not wreck your file"
    ]
  },
  {
    "name": "Letta Code",
    "url": "https://www.letta.com/",
    "description": "A memory-first CLI coding agent that maintains persistent agent state across sessions, learns from experience through skill acquisition, and ranks #1 as model-agnostic open-source harness on Terminal-Bench with 42.5% overall score.",
    "release_date": "2025-12-16",
    "category": "AI coding CLI",
    "sources": ["Letta Official Blog", "HackerNoon", "Reddit"],
    "community_quotes": [
      "#1 model-agnostic open-source agent on Terminal-Bench",
      "Agents that learn your code - fun to play with",
      "Achieves comparable performance to provider-specific harnesses like Claude Code and Gemini CLI"
    ]
  },
  {
    "name": "Google Opal",
    "url": "https://gemini.google.com/",
    "description": "A vibe-coding tool integrated into Gemini web app that allows users to build AI-powered mini-apps called Gems through natural language descriptions with a visual editor for no-code app creation, currently free during experimental beta.",
    "release_date": "2025-12-17",
    "category": "workflow-specific AI tool",
    "sources": ["TechCrunch", "ChromeUnboxed", "Reddit"],
    "community_quotes": [
      "Part of Google's 'no-code revolution'",
      "Good for scaffolding and quick prototyping",
      "Struggles with conversational features in complex applications"
    ]
  },
  {
    "name": "GPT-5.2-Codex",
    "url": "https://openai.com/index/introducing-gpt-5-2-codex/",
    "description": "OpenAI's most advanced agentic coding model focused on professional software engineering and defensive cybersecurity with SWE-Bench Pro score of 56.4%, optimized for large code changes including repository-scale refactors and cross-module migrations.",
    "release_date": "2025-12-18",
    "category": "code agent",
    "sources": ["OpenAI Blog", "Hacker News", "Reddit", "SD Times"],
    "community_quotes": [
      "Best model out there - handles both backend and frontend work",
      "So good at finding bugs and little inconsistencies, it's astounding",
      "Developers report relying completely on Codex for code reviews"
    ]
  },
  {
    "name": "Junie by JetBrains",
    "url": "https://plugins.jetbrains.com/plugin/26104-junie-the-ai-coding-agent-by-jetbrains",
    "description": "JetBrains' AI coding agent plugin that handles tasks autonomously or in collaboration with developers, featuring configurable command execution and agentic AI capabilities with spec-driven approach for coding.",
    "release_date": "2025-12-18",
    "category": "IDE-integrated AI tool",
    "sources": ["JetBrains Plugin Marketplace", "DevClass", "Reddit"],
    "community_quotes": [
      "One of the best coding agents - very well integrated with IntelliJ",
      "Great for Kotlin development",
      "Only works with IntelliJ IDEA Ultimate, not Community Edition"
    ]
  },
  {
    "name": "Verdent AI Desktop App",
    "url": "https://www.verdent.ai/",
    "description": "Major updates to standalone desktop app enabling parallel task execution with context preservation across multiple concurrent coding tasks, deploying multiple agents simultaneously like a coordinated micro-team for 10x faster project cycles.",
    "release_date": "2025-12-22",
    "category": "AI coding CLI",
    "sources": ["Barchart News"],
    "community_quotes": [
      "Functions like a coordinated micro-team of agents",
      "Context preservation across multiple concurrent coding tasks",
      "10x faster complex project cycles"
    ]
  },
  {
    "name": "MiniMax M2.1",
    "url": "https://www.minimax.io/news/minimax-m21",
    "description": "A multilingual AI coding model optimized for various programming tools and agent frameworks with SWE-bench Verified score of 74.0%, designed for agentic coding with enhanced long-horizon reasoning and multi-file editing capabilities.",
    "release_date": "2025-12-23",
    "category": "AI coding CLI",
    "sources": ["SiliconAngle", "Ollama", "Kilo Blog", "Medium"],
    "community_quotes": [
      "Straight up beast at UI/UX design",
      "Using M2.1 full-time as a developer - purely for writing code",
      "Outperforms Claude Sonnet 4.5 in multilingual scenarios",
      "74.0% on SWE-bench Verified - significant prowess in software engineering"
    ]
  }
]
