[
  {
    "name": "Spec Coding by Capacity",
    "url": "https://capacity.so/",
    "description": "Vibe coding tool that emphasizes planning before building. Features an AI co-founder that helps define specifications, target audience, and key requirements before any code is written, then generates production-ready code based on those specifications.",
    "release_date": "2026-01-08",
    "category": "AI IDE / Vibe Coding",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Stop vibe coding - define your specifications first, then let AI build production-ready code",
      "Ranked #3 Product of the Day on Product Hunt with 243 upvotes",
      "AI co-founder helps you define what you're building, who it's for, and what matters before coding"
    ]
  },
  {
    "name": "ChatDev 2.0 (DevAll)",
    "url": "https://github.com/OpenBMB/ChatDev",
    "description": "Zero-code multi-agent orchestration platform for 'Developing Everything'. Evolved from ChatDev 1.0's virtual software company model into a comprehensive platform where users can build and execute customized multi-agent systems through simple configuration without coding. Features visual workflow design, Python SDK, and built-in scenarios for data visualization, 3D generation, game development, and deep research.",
    "release_date": "2026-01-07",
    "category": "Open-source AI coding agent",
    "sources": ["GitHub"],
    "community_quotes": [
      "Zero-code multi-agent orchestration platform for developing everything",
      "Visual workflow canvas with drag-and-drop agent configuration",
      "Python SDK for automation and batch processing",
      "Built-in scenarios for 3D modeling, game dev, and deep research",
      "Official release announced January 7, 2026"
    ]
  },
  {
    "name": "Repo Prompt",
    "url": "https://repo-prompt.com/",
    "description": "Context builder that analyzes your project and selects only the relevant files and functions needed for your task, building dense context that fits in model limits. Works with existing AI subscriptions (Claude MAX, ChatGPT Plus, Gemini) with no extra API costs. The MCP server turns Repo Prompt into a backend for Claude Code, Cursor, and Codex, giving them context analysis and discovery they can't do on their own.",
    "release_date": "2026-01-06",
    "category": "Workflow-specific AI tool",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Helps AI models understand your codebase without wasting tokens on irrelevant code",
      "I've been using Repo Prompt for over a year now, and it's become essential to my daily development workflow",
      "Usually have 5-10 RepoPrompt windows open at any given time; one per project",
      "Pairing with GPT-5 Pro is incredibly powerful for architectural planning",
      "The CLI/MCP Server is the killer feature for autonomous multi-model review loops"
    ]
  },
  {
    "name": "Cortex",
    "url": "https://cortex-cli.vercel.app/",
    "description": "AI agent orchestrator CLI that lets you design deterministic, multi-agent workflows using simple YAML files. Supports true parallel execution, task dependencies, and output chaining between agents. Introduces infrastructure-style configs (Cortexfile and MasterCortex) to orchestrate single or multi-project AI workflows with real-time streaming, session tracking, and reproducible runs.",
    "release_date": "2026-01-05",
    "category": "AI coding CLI",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Solves the problem of unstructured, non-reproducible AI workflows",
      "Lets developers define deterministic, multi-agent workflows with clear dependencies",
      "Version-controlled YAML config turns ad-hoc AI usage into reliable, repeatable systems",
      "Supports true parallel execution unlike chat-based tools",
      "Free and open source"
    ]
  },
  {
    "name": "IQuest Coder V1",
    "url": "https://github.com/IQuestLab/IQuest-Coder-V1",
    "description": "Open-source coding AI from China's Ubiquant hedge fund that matches or beats Claude Sonnet 4.5 and GPT 5.1 on coding benchmarks using only 40B parameters. Features three variants (Instruct, Thinking, Loop) with novel Code-Flow Training on commit histories and repository evolution patterns.",
    "release_date": "2026-01-01",
    "category": "Open-source AI coding agent",
    "sources": ["DEV Community", "Asia Business Outlook", "Medium"],
    "community_quotes": [
      "Matches or beats Claude Sonnet 4.5 and GPT 5.1 on coding benchmarks with only 40B parameters",
      "Uses novel Code-Flow Training on commit histories and repository evolution patterns",
      "Fully open source with self-hosting capabilities",
      "Specializes in algorithmic thinking and competitive programming",
      "Efficiency breakthrough: 10-20x smaller than Western models while matching performance"
    ]
  }
]