[
  {
    "name": "IQuest Coder V1",
    "url": "https://github.com/IQuestLab/IQuest-Coder-V1",
    "description": "Open-source coding AI from China's Ubiquant hedge fund that matches or beats Claude Sonnet 4.5 and GPT 5.1 on coding benchmarks using only 40B parameters. Features three variants (Instruct, Thinking, Loop) with novel Code-Flow Training on commit histories and repository evolution patterns.",
    "release_date": "2026-01-01",
    "category": "Open-source AI coding agent",
    "sources": ["DEV Community", "Asia Business Outlook", "Medium"],
    "community_quotes": [
      "Matches or beats Claude Sonnet 4.5 and GPT 5.1 on coding benchmarks with only 40B parameters",
      "Uses novel Code-Flow Training on commit histories and repository evolution patterns",
      "Fully open source with self-hosting capabilities",
      "Specializes in algorithmic thinking and competitive programming",
      "Efficiency breakthrough: 10-20x smaller than Western models while matching performance"
    ]
  },
  {
    "name": "ChatDev 2.0 (DevAll)",
    "url": "https://github.com/OpenBMB/ChatDev",
    "description": "Zero-code multi-agent orchestration platform for 'Developing Everything'. Evolved from ChatDev 1.0's virtual software company model into a comprehensive platform where users can build and execute customized multi-agent systems through simple configuration without coding. Features visual workflow design, Python SDK, and built-in scenarios for data visualization, 3D generation, game development, and deep research.",
    "release_date": "2026-01-07",
    "category": "Open-source AI coding agent",
    "sources": ["GitHub"],
    "community_quotes": [
      "Zero-code multi-agent orchestration platform for developing everything",
      "Visual workflow canvas with drag-and-drop agent configuration",
      "Python SDK for automation and batch processing",
      "Built-in scenarios for 3D modeling, game dev, and deep research",
      "Official release announced January 7, 2026"
    ]
  },
  {
    "name": "Spec Coding by Capacity",
    "url": "https://capacity.so/",
    "description": "Vibe coding tool that emphasizes planning before building. Features an AI co-founder that helps define specifications, target audience, and key requirements before any code is written, then generates production-ready code based on those specifications.",
    "release_date": "2026-01-08",
    "category": "AI IDE / Vibe Coding",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Stop vibe coding - define your specifications first, then let AI build production-ready code",
      "Ranked #3 Product of the Day on Product Hunt with 243 upvotes",
      "AI co-founder helps you define what you're building, who it's for, and what matters before coding"
    ]
  }
]