[
  {
    "title": "ABC-Bench: Benchmarking Agentic Backend Coding",
    "description": "New arXiv paper introducing ABC-Bench, a benchmark for evaluating AI agents' backend coding capabilities. The paper focuses on expanding from localized code generation to autonomous agents that can handle complex backend development tasks. This represents a shift in how AI coding capabilities are being measured and evaluated.",
    "author": "arXiv researchers",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2601.11077",
    "published_date": "2026-01-15",
    "topics": ["agentic coding", "benchmarks", "backend development", "AI evaluation", "code generation"],
    "type": "technical"
  },
  {
    "title": "Karpathy's thread on AI coding hit different. Bottleneck shifted from implementation to prompting",
    "description": "Reddit discussion about Andrej Karpathy's insights on AI coding. The conversation highlights how the bottleneck in development has shifted from writing code to prompting, context management, and reviewing AI outputs. Developers discuss the rapid evolution of AI coding tools and how it's changing the skillset required for software engineering.",
    "author": "Reddit r/programming community",
    "source": "Reddit",
    "url": "https://www.reddit.com/r/programming/comments/1pzn30m/karpathys_thread_on_ai_coding_hit_different/",
    "published_date": "2026-01-14",
    "topics": ["AI coding", "prompting", "context management", "developer tools", "Karpathy"],
    "type": "discussion"
  },
  {
    "title": "Repository-Level Code Generation via Context Inlining",
    "description": "arXiv paper introducing 'InlineCoder,' a novel framework for repository-level code generation that enhances understanding through context inlining. The paper addresses the challenge of enabling AI models to work with entire codebases rather than isolated functions, representing a significant advancement in AI-assisted software development.",
    "author": "C. Hu et al.",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2601.00376",
    "published_date": "2026-01-14",
    "topics": ["repository-level code generation", "context understanding", "InlineCoder", "codebase analysis", "LLM"],
    "type": "technical"
  },
  {
    "title": "Topic Modeling Techniques for 2026: Seeded Modeling, LLM Integration",
    "description": "Towards Data Science article discussing how LLM-based summarization can be a good choice when topic models have difficulty interpreting your corpus. Covers various trade-offs in using LLMs for data analysis and summarization tasks, reflecting the growing integration of LLMs into data science workflows.",
    "author": "Towards Data Science",
    "source": "Blog",
    "url": "https://towardsdatascience.com/topic-modeling-techniques-for-2026-seeded-modeling-llm-integration-and-data-summaries/",
    "published_date": "2026-01-14",
    "topics": ["topic modeling", "LLM integration", "data summarization", "data science", "LLM applications"],
    "type": "technical"
  },
  {
    "title": "Claude Code Advanced Masterclass in Under 81 Mins",
    "description": "YouTube video by Carl Vellotti providing an advanced masterclass on Claude Code. The video focuses on teaching product managers and developers how to leverage Claude Code effectively. This is a follow-up to his first episode which hit 30,000 views, indicating strong interest in AI coding tools.",
    "author": "Carl Vellotti",
    "source": "YouTube",
    "url": "https://www.youtube.com/watch?v=59gy_24KIVE",
    "published_date": "2026-01-13",
    "topics": ["Claude Code", "AI coding tutorial", "product management", "advanced techniques"],
    "type": "tutorial"
  },
  {
    "title": "First impressions of Claude Cowork, Anthropic's general agent",
    "description": "Simon Willison reviews Claude Cowork, Anthropic's new general agent that extends Claude Code capabilities beyond developer tools. Key insights: 1) Cowork is Claude Code wrapped in a non-developer-friendly interface with filesystem sandbox, 2) Uses Apple Virtualization Framework (VZVirtualMachine) with custom Linux root filesystem for security, 3) Simon tested it analyzing his blog drafts - it ran 44 searches and found unpublished articles ready for publication, 4) Prompt injection risks remain a concern - Anthropic warns users to watch for 'suspicious actions', 5) Simon predicts Gemini and OpenAI will follow suit with similar offerings. The article includes detailed technical analysis and a cow+orc logo joke.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Jan/12/claude-cowork/",
    "published_date": "2026-01-12",
    "topics": ["Claude Cowork", "Anthropic", "general agents", "AI tools", "prompt injection", "security", "Apple Virtualization Framework"],
    "type": "technical"
  },
  {
    "title": "Generative coding: 10 Breakthrough Technologies 2026",
    "description": "MIT Technology Review names 'Generative coding' as one of the 10 Breakthrough Technologies for 2026. The article covers how AI's ability to write software code has quickly become one of the technology's first real use cases for business. Discusses tools like Copilot, Cursor, Lovable, and Replit, and how AI coding tools are changing entry-level coding jobs and the software development industry.",
    "author": "MIT Technology Review",
    "source": "TechMedia",
    "url": "https://www.technologyreview.com/2026/01/12/1130027/generative-coding-ai-software-2026-breakthrough-technology/",
    "published_date": "2026-01-12",
    "topics": ["generative coding", "AI tools", "business adoption", "Copilot", "Cursor", "industry impact"],
    "type": "technical"
  },
  {
    "title": "We asked over 150 software engineers about vibe-coding. Here's what they said",
    "description": "Business Insider surveyed 167 software engineers about 'vibe-coding' (AI-assisted coding). Key findings: 46.9% feel they're 'keeping up' with AI tools, 17.5% are opting out entirely, and 17% feel behind. The article discusses how AI coding tools are changing the industry, with some developers reporting 2-3x productivity gains while others spend more time reviewing AI-generated code. Andrej Karpathy coined the term 'vibe-coding' and recently expressed feeling 'never this much behind as a programmer' due to how quickly AI is reshaping programming.",
    "author": "Henry Chandonnet (Business Insider)",
    "source": "TechMedia",
    "url": "https://www.businessinsider.com/software-engineers-on-vibe-coding-ai-tools-2026-1",
    "published_date": "2026-01-12",
    "topics": ["vibe-coding", "AI coding tools", "developer productivity", "industry survey", "Andrej Karpathy"],
    "type": "technical"
  },
  {
    "title": "Oxide and Friends: Engineering Rigor in the Age of LLMs",
    "description": "Podcast episode discussing what LLMs mean for the future of software engineering. The conversation questions whether 'vibe-coded AI slop' will become the norm and if software engineers will become less relevant. Represents ongoing industry debate about the impact of AI coding tools on software engineering rigor and quality.",
    "author": "Oxide and Friends",
    "source": "Podcast",
    "url": "https://www.youtube.com/watch?v=fmFt4-jjEc0",
    "published_date": "2026-01-12",
    "topics": ["LLM impact", "software engineering", "vibe coding", "engineering rigor", "AI tools"],
    "type": "discussion"
  }
]