[
  {
    "name": "1Code",
    "url": "https://github.com/1code/1code",
    "description": "Open source Cursor-like UI for Claude Code, providing a visual interface with diff previews, built-in git client, and support for running agents in parallel across multiple worktrees.",
    "release_date": "2026-01-16",
    "category": "AI IDE",
    "sources": ["Product Hunt", "GitHub"],
    "community_quotes": [
      "Claude Code finally has a usable UI, this open source project is amazing",
      "Run Claude Code agents in parallel with Git Worktrees support",
      "Provides the missing graphical interface for Claude Code"
    ]
  },
  {
    "name": "relayd",
    "url": "https://relayd.dev",
    "description": "Remote control interface for Codex agents, enabling developers to manage and ship code from anywhere with remote agent orchestration capabilities.",
    "release_date": "2026-01-20",
    "category": "code agent",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Remote control for your Codex agents - ship from anywhere",
      "Featured in Product Hunt Best of January 20, 2026 leaderboard"
    ]
  },
  {
    "name": "Coderrr",
    "url": "https://github.com/coderrr/cli",
    "description": "Open source CLI-first AI coding companion that runs in the terminal, understands codebases, helps generate/refactor code, explains bugs, and creates actionable plans.",
    "release_date": "2026-01-19",
    "category": "AI coding CLI",
    "sources": ["Product Hunt", "GitHub"],
    "community_quotes": [
      "Free and open-source alternative to Claude Code",
      "CLI-first AI coding companion that understands your codebase"
    ]
  },
  {
    "name": "flins",
    "url": "https://flins.dev",
    "description": "Universal skill and command manager for AI coding tools, acting as a dependency manager for AI agent skills with familiar commands like add, update, remove, and list across 16+ platforms.",
    "release_date": "2026-01-19",
    "category": "workflow agent",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Like npm for AI agent skills - manage capabilities across 16+ platforms",
      "Reduces friction when sharing and maintaining agent skills across teams"
    ]
  },
  {
    "name": "Phoenix CLI",
    "url": "https://arize.com/docs/phoenix/release-notes/01-2026/01-17-2026-phoenix-cli-ai-agent-debugging",
    "description": "Command-line interface for retrieving trace data from Phoenix, enabling AI coding assistants to access observability data through terminal and file interfaces for debugging AI agents.",
    "release_date": "2026-01-17",
    "category": "AI coding CLI",
    "sources": ["Arize AI"],
    "community_quotes": []
  },
  {
    "name": "Knowns CLI",
    "url": "https://www.producthunt.com/products/knowns-cli/launches",
    "description": "AI-first CLI for task management and documentation that links docs in tasks and reads context automatically to avoid repeating patterns in development workflows.",
    "release_date": "2026-01-14",
    "category": "AI coding CLI",
    "sources": ["Product Hunt"],
    "community_quotes": []
  },
  {
    "name": "Cowork",
    "url": "https://cowork.dev",
    "description": "Turns Claude into your digital coworker for collaborative development tasks, providing AI-powered collaboration capabilities for software development teams.",
    "release_date": "2026-01-13",
    "category": "code agent",
    "sources": ["Product Hunt"],
    "community_quotes": []
  },
  {
    "name": "WebTerm",
    "url": "https://webterm.app",
    "description": "Browser terminal sandbox for learning CLI without fear, emphasizing CLI literacy for both engineers and non-engineers in the AI era.",
    "release_date": "2026-01-13",
    "category": "AI coding CLI",
    "sources": ["Product Hunt"],
    "community_quotes": []
  }
]
