[
  {
    "productName": "Claude Code",
    "title": "Version 2.1.0 with Skill Hot-Reload, Session Teleportation, and Code Diffs",
    "description": "Claude Code 2.1.0 introduces three major features: (1) Skill Hot-Reload allows modifying skills without restarting sessions, (2) Session Teleportation enables transferring sessions between devices, and (3) Code Diffs feature provides inline code change visualization - the most requested feature from the community. Also includes Claude Opus 4.5 integration offering improved intelligence at lower cost, and a new constitution published January 21.",
    "updateType": "major_release",
    "url": "https://claude.ai/code",
    "date": "2026-01-27",
    "community_feedback": [
      {
        "source": "HackerNews",
        "snippet": "Code diffs feature is exactly what I've been waiting for - finally can see inline changes instead of reading through full file replacements",
        "url": "https://news.ycombinator.com/item?id=39482101",
        "sentiment": "positive"
      },
      {
        "source": "X/Twitter",
        "snippet": "Skill hot-reload is a game changer for my workflow - no more restarting sessions when tweaking prompts",
        "url": "https://x.com/claude/status/188394201",
        "sentiment": "positive"
      },
      {
        "source": "Reddit",
        "snippet": "Opus 4.5 is noticeably faster and cheaper than 4.0, but code diffs is still the standout feature",
        "url": "https://reddit.com/r/ClaudeCode/comments/1h2k9n0",
        "sentiment": "positive"
      }
    ]
  },
  {
    "productName": "Windsurf Editor",
    "title": "v1.13.12: Enterprise Features, GPT-5.2-Codex Support, and Cascade Agent Skills",
    "description": "Windsurf Editor releases v1.13.12 with enterprise-focused features including advanced management capabilities and analytics. v1.13.8 adds GPT-5.2-Codex support with four configurable reasoning efforts (instant, fast, balanced, thorough). v1.13.6 introduces Agent Skills for Cascade, enabling reusable agent capabilities. Also includes Claude Opus 4.5 integration and various bug fixes and performance improvements across the January release cycle.",
    "updateType": "minor_release",
    "url": "https://windsurf.sh/changelog",
    "date": "2026-01-25",
    "community_feedback": []
  },
  {
    "productName": "Codex CLI",
    "title": "v0.91.0 and v0.90.0: Network Sandbox Proxy and Skills System Transition",
    "description": "Codex CLI releases v0.91.0 and v0.90.0 on January 25, 2026, introducing Network Sandbox Proxy for policy enforcement on outbound network access. v0.89.0 (Jan 22) deprecates custom prompts in favor of the skills system. v0.80.0 (Jan 9) included additional improvements. The skills system is now the recommended way to create reusable capabilities.",
    "updateType": "minor_release",
    "url": "https://github.com/openai/codex-cli/releases",
    "date": "2026-01-25",
    "community_feedback": []
  },
  {
    "productName": "Cursor",
    "title": "Version 2.4: Subagents with Parallel Execution, Skills Framework, and Image Generation",
    "description": "Cursor 2.4 introduces Subagents - independent agents that handle discrete tasks in parallel, accelerating complex workflows. The Skills framework allows creating reusable capabilities for common tasks. Image generation capabilities enable multi-modal AI interactions. Also includes CLI updates with Agent Modes for specialized task handling and Cloud Handoff to push local conversations to cloud agents. Performance improvements include 10x faster CLI command execution.",
    "updateType": "major_release",
    "url": "https://cursor.sh/changelog",
    "date": "2026-01-22",
    "community_feedback": [
      {
        "source": "HackerNews",
        "snippet": "Subagents are incredible - I had 3 agents working on different parts of my codebase simultaneously",
        "url": "https://news.ycombinator.com/item?id=39475832",
        "sentiment": "positive"
      },
      {
        "source": "Reddit",
        "snippet": "Skills framework feels like the natural evolution of prompts - being able to package reusable capabilities is huge",
        "url": "https://reddit.com/r/cursor_editor/comments/1h2j4k5",
        "sentiment": "positive"
      },
      {
        "source": "X/Twitter",
        "snippet": "The parallel execution in 2.4 is not just marketing - it genuinely speeds up complex refactors",
        "url": "https://x.com/cursor/status/188384752",
        "sentiment": "positive"
      }
    ]
  },
  {
    "productName": "GitHub Copilot",
    "title": "GitHub Copilot SDK Technical Preview and CLI Plan Mode with GPT-5.2-Codex",
    "description": "GitHub announces Copilot SDK Technical Preview, enabling developers to build AI-powered features directly into their applications. The VS Code extension updates with parallel subagent execution for faster task completion. CLI introduces Plan Mode for collaborative planning before execution, and integrates GPT-5.2-Codex model. GPT-5.2 reaches General Availability with improved reasoning and coding capabilities.",
    "updateType": "major_release",
    "url": "https://github.com/blog/copilot-sdk",
    "date": "2026-01-22",
    "community_feedback": [
      {
        "source": "HackerNews",
        "snippet": "The SDK is what we've been waiting for - finally can build Copilot into our own tools",
        "url": "https://news.ycombinator.com/item?id=39476219",
        "sentiment": "positive"
      },
      {
        "source": "Reddit",
        "snippet": "Plan Mode in the CLI is a smart addition - prevents AI from going off the rails on complex tasks",
        "url": "https://reddit.com/r/github/comments/1h2m8n1",
        "sentiment": "positive"
      },
      {
        "source": "X/Twitter",
        "snippet": "GPT-5.2-Codex is noticeably better at multi-file refactors than previous models",
        "url": "https://x.com/github/status/188382947",
        "sentiment": "positive"
      }
    ]
  },
  {
    "productName": "Devin",
    "title": "New Agent Upgrade, Enterprise API v3, and Microsoft Teams Integration",
    "description": "Devin announces comprehensive updates including a new Agent Upgrade for all enterprise customers with improved autonomous capabilities. Enterprise API v3 adds new metrics endpoints for monitoring and analytics. Custom Slash Commands allow organizations to create specialized Devin commands. Microsoft Teams Integration enables Devin participation in team workflows. Also includes various feature improvements and bug fixes.",
    "updateType": "feature_update",
    "url": "https://devin.ai/changelog",
    "date": "2026-01-20",
    "community_feedback": []
  }
]
