[
  {
    "productName": "Codex CLI",
    "title": "v0.91.0 and v0.90.0: Network Sandbox Proxy and Skills System Transition",
    "description": "Codex CLI releases v0.91.0 and v0.90.0 on January 25, 2026, introducing Network Sandbox Proxy for policy enforcement on outbound network access. v0.89.0 (Jan 22) deprecates custom prompts in favor of the skills system. v0.90.0 also introduces gpt-5.2-codex model support with improved tooling, headless login via device-code authentication, and Linux read-only path mounting. The skills system is now the recommended way to create reusable capabilities.",
    "updateType": "minor_release",
    "url": "https://developers.openai.com/codex/changelog/",
    "date": "2026-01-25",
    "community_feedback": []
  },
  {
    "productName": "Gemini CLI",
    "title": "v0.26.0-preview.0, v0.25.0, and v0.24.0: Preview Release and Stability Improvements",
    "description": "Gemini CLI releases v0.26.0-preview.0 on January 21, 2026 with experimental features. v0.25.0 released January 20, 2026, and v0.24.0 on January 14, 2026. Updates include improved error messages on failed onboarding, enhanced interactive shell for external tooling, better error handling, improved UI responsiveness, and various bug fixes and stability improvements.",
    "updateType": "minor_release",
    "url": "https://geminicli.com/docs/changelogs/",
    "date": "2026-01-21",
    "community_feedback": []
  },
  {
    "productName": "Claude Code",
    "title": "Version 2.1.0: Skill Hot-Reload, Session Teleportation, Code Diffs, and LSP Tools",
    "description": "Claude Code 2.1.0 released January 7, 2026 introduces four major features: (1) Skill Hot-Reload allows modifying skills without restarting sessions, (2) Session Teleportation enables transferring sessions between devices, (3) Code Diffs feature provides inline code change visualization - one of the most requested features, and (4) LSP tools including go-to-definition, find references, and hover documentation. Also includes Shift+Enter for newlines, improved /terminal-setup command, enhanced agent hooks, Claude Sonnet 4.5 integration, and deprecated Opus 4 and 4.1.",
    "updateType": "major_release",
    "url": "https://github.com/anthropics/claude-code/blob/main/CHANGELOG.md",
    "date": "2026-01-16",
    "community_feedback": [
      {
        "quote": "Code diffs feature is exactly what I've been waiting for - finally can see inline changes instead of reading through full file replacements",
        "source": "HackerNews",
        "sentiment": "positive"
      },
      {
        "quote": "Skill hot-reload is a game changer for my workflow - no more restarting sessions when tweaking prompts",
        "source": "X/Twitter",
        "sentiment": "positive"
      },
      {
        "quote": "The Shift+Enter feature sounds simple but it's zero setup and exactly what I needed",
        "source": "Reddit",
        "sentiment": "positive"
      }
    ]
  },
  {
    "productName": "Cursor",
    "title": "CLI Updates: Agent Modes, Cloud Handoff, and MCP Auth (January 16, 2026)",
    "description": "Cursor CLI updates on January 16, 2026 introduce Agent Modes with Plan Mode for strategizing and Ask Mode for quick queries. Cloud Handoff enables background tasks to be processed in the cloud, freeing local resources. One-Click MCP Auth simplifies Model Context Protocol authentication. The latest version is Cursor 2.4.14 (released January 21, 2026). Previous 2.3 release in December 2025 focused on stability and polish.",
    "updateType": "feature_update",
    "url": "https://cursor.com/changelog",
    "date": "2026-01-16",
    "community_feedback": [
      {
        "quote": "Agent Modes are exactly what CLI needed - Plan Mode helps me think through complex refactors before executing",
        "source": "Reddit",
        "sentiment": "positive"
      },
      {
        "quote": "Cloud Handoff is brilliant - offloading heavy compute to the cloud while keeping my local machine responsive",
        "source": "X/Twitter",
        "sentiment": "positive"
      }
    ]
  },
  {
    "productName": "GitHub Copilot",
    "title": "CLI Enhanced Agents, Context Management, and New Installation Methods (January 14, 2026)",
    "description": "GitHub Copilot CLI updates on January 14, 2026 bring enhanced agent capabilities for better command-line assistance, improved context management for more relevant suggestions, and new installation methods for easier setup. VS Code Copilot January 2026 update includes parallel subagent execution for faster performance, new skills system for specialized assistance, and deeper Claude integration. GitHub Copilot app modernization for C++ entered Public Preview with Visual Studio 2026 integration.",
    "updateType": "feature_update",
    "url": "https://github.blog/changelog/2026-01-14-github-copilot-cli-enhanced-agents-context-management-and-new-ways-to-install/",
    "date": "2026-01-14",
    "community_feedback": [
      {
        "quote": "The enhanced agents in CLI actually understand context now - it's not just autocompleting commands anymore",
        "source": "HackerNews",
        "sentiment": "positive"
      },
      {
        "quote": "Parallel subagent execution in VS Code makes Copilot feel much snappier on large codebases",
        "source": "Reddit",
        "sentiment": "positive"
      }
    ]
  },
  {
    "productName": "Windsurf",
    "title": "JetBrains Plugin v2.12.2, GPT-5.1 Support, and Agent Skills for Cascade",
    "description": "Windsurf JetBrains Plugin v2.12.2 released January 13, 2026 with improved file search performance and fixed diagnostics when changing file names. The platform added GPT-5.1 model support with priority processing for guaranteed low-latency responses at ~50 tokens/sec. Windsurf introduced Agent Skills for Cascade, described as one of the biggest AI agent upgrades of 2026, allowing reusable instruction sets for customizable AI interactions. Enhanced Plan Mode functionality added to Windsurf Next beta channel.",
    "updateType": "minor_release",
    "url": "https://windsurf.com/changelog",
    "date": "2026-01-13",
    "community_feedback": []
  },
  {
    "productName": "Devin",
    "title": "January 21, 2026 Release: Bug Fixes and Performance Improvements",
    "description": "Devin AI release on January 21, 2026 included minor bug fixes and performance improvements across the platform. Also featured updates to the Devin Review functionality. Enterprise API v3 updates include new v3 beta endpoints. The platform continues to enhance legacy code migration capabilities for massive codebases including COBOL, Fortran, and Objective-C.",
    "updateType": "bugfix",
    "url": "https://docs.devin.ai/release-notes/overview",
    "date": "2026-01-21",
    "community_feedback": []
  }
]
