[
  {
    "title": "Software Engineering Daily: OpenAI and Codex with Thibault Sottiaux and Ed Bayes",
    "description": "Podcast episode discussing Codex, OpenAI's agentic coding system designed to work safely inside sandboxed environments while collaborating with developers. Covers models and harnesses in the context of AI coding agents that are reshaping how software is built, reviewed, and maintained. The discussion includes how OpenAI uses Codex daily across technical teams including Security, Product Engineering, Frontend, API, Infrastructure, and Performance Engineering.",
    "author": "Software Engineering Daily",
    "source": "Podcast",
    "url": "https://softwareengineeringdaily.com/2026/01/29/openai-and-codex-with-thibault-sottiaux-and-ed-bayes/",
    "published_date": "2026-01-29",
    "topics": ["OpenAI", "Codex", "AI agents", "sandboxed environments", "software development"],
    "type": "podcast"
  },
  {
    "title": "Hacker News Discussion: Andrej Karpathy's Experience with Claude Code",
    "description": "Extended Hacker News discussion on Andrej Karpathy's field notes about coding with Claude. Key themes include: brain atrophy from over-reliance on AI tools, the concept of 'vibe coding' vs. traditional programming, AI's tenacity in problem-solving, the split between engineers who like coding vs. those who like building, concerns about the 'slopacolypse' of 2026, worries about AI-generated technical debt, and the emergence of agent-based workflows. Many developers report shifting from 20% AI assistance to 80% AI assistance between November and December 2025.",
    "author": "Hacker News Community",
    "source": "HN",
    "url": "https://news.ycombinator.com/item?id=46771564",
    "published_date": "2026-01-27",
    "topics": ["Claude Code", "vibe coding", "AI agents", "brain atrophy", "technical debt", "workflow changes"],
    "type": "discussion"
  },
  {
    "title": "AI News: Claude Code Tasks Release & ChatGPT Containers Major Upgrades",
    "description": "Daily AI news update covering major developments in AI coding tools for January 26, 2026. Reports release of Claude Code Tasks feature and major upgrades to ChatGPT Containers. Video content covers the rapid evolution of AI coding capabilities and tools.",
    "author": "Really Easy AI",
    "source": "YouTube",
    "url": "https://www.youtube.com/watch?v=YkE2p6aO3LU",
    "published_date": "2026-01-26",
    "topics": ["Claude Code", "ChatGPT", "AI tools", "feature releases"],
    "type": "tutorial"
  },
  {
    "title": "Why All the Sudden People Are Writing Browsers with AI",
    "description": "Hacker News discussion from January 2026 about the trend of AI-powered browser development. Community explores the sudden surge in AI-assisted browser projects and what's driving this phenomenon.",
    "author": "Hacker News Community",
    "source": "HN",
    "url": "https://news.ycombinator.com/item?id=46790957",
    "published_date": "2026-01-26",
    "topics": ["AI browsers", "new development trends"],
    "type": "discussion"
  },
  {
    "title": "Show HN: yolo-cage – AI Coding Agents That Can't Exfiltrate",
    "description": "Release from January 2026 of 'yolo-cage', a tool focused on security-constrained AI coding agents. Addresses concerns about AI agent security by providing guardrails against data exfiltration.",
    "author": "Hacker News Community",
    "source": "HN",
    "url": "https://news.ycombinator.com/item?id=46706796",
    "published_date": "2026-01-26",
    "topics": ["AI security", "agent guardrails", "exfiltration prevention"],
    "type": "technical"
  }
]
