[
  {
    "name": "JetBrains ACP Agent Registry",
    "url": "https://blog.jetbrains.com/ai/2026/01/acp-agent-registry/",
    "description": "A directory of AI coding agents integrated directly into JetBrains IDEs, allowing users to browse and connect external AI agents without manual setup. Launched in partnership with Zed as the 'LSP protocol for coding agents' enabling open interoperability.",
    "release_date": "2026-01-28",
    "category": "IDE-integrated AI tools",
    "sources": ["JetBrains AI Blog", "Zed Blog"],
    "community_quotes": [
      "Described as 'a very exquisite, compact protocol' that 'strictly follows MCP's Json-RPC specification'",
      "Called the 'LSP protocol for Coding Agents' highlighting its decoupling and openness"
    ]
  },
  {
    "name": "1Code",
    "url": "https://www.producthunt.com/products/1code-cursor-like-ui-for-claude-code/",
    "description": "An open-source Cursor-like UI for Claude Code that allows running Claude Code agents in parallel. Available on Mac (runs locally with/without worktrees) and Web platforms, achieved #1 trending on Product Hunt with 579 points.",
    "release_date": "2026-01-16",
    "category": "IDE-integrated AI tools",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Achieved 402 upvotes and 39 comments on Product Hunt",
      "Ranked #1 trending on Product Hunt for January 16, 2026"
    ]
  },
  {
    "name": "Blink Agent Builder",
    "url": "https://www.producthunt.com/products/blink-21",
    "description": "A full-stack agentic vibe coding platform that enables building AI applications from natural language prompts without code. Achieved #1 Product of the Day with 360 votes, supporting 180+ AI models with code execution, vector database integration, and tool calling capabilities.",
    "release_date": "2026-01-21",
    "category": "workflow agent",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "The hard part with agents is not dreaming them up, it is gluing together tools, models and flows without losing a weekend. This solves that",
      "Users appreciate being able to describe agents in plain English rather than manually connecting components"
    ]
  },
  {
    "name": "Nori CLI",
    "url": "https://github.com/tilework-tech/nori-cli",
    "description": "A Rust-based CLI interface for AI coding agents (Claude, Gemini, Codex) with multi-agent support, parallel tool execution, and flicker-free interface. Marketed as 'the best coding agent CLI on the market' and an improved interface for Claude Code.",
    "release_date": "2026-01-14",
    "category": "AI coding CLI",
    "sources": ["GitHub", "Hacker News"],
    "community_quotes": [
      "Described as 'a very thin and very fast TUI wrapper around multiple agent providers'",
      "Built in Rust for speed with flicker-free interface"
    ]
  },
  {
    "name": "flins",
    "url": "https://flins.tech/",
    "description": "A universal skill and command manager for AI coding agents that works across Claude Code, Cursor, GitHub Copilot, Windsurf, Gemini CLI and 15+ other tools. Provides CLI-based management (add, update, remove, list, search) treating agent skills like dependencies. Ranked #13 day rank with 87 upvotes.",
    "release_date": "2026-01-19",
    "category": "workflow agent",
    "sources": ["Product Hunt", "Flins Tech"],
    "community_quotes": [
      "Acts as a 'dependency manager for agent skills, similar to how npm works for JavaScript packages'",
      "Solves managing AI agent skills consistently across multiple AI coding tools from a single interface"
    ]
  },
  {
    "name": "Coderrr",
    "url": "https://www.producthunt.com/products/coderrr",
    "description": "A free, open-source CLI-first AI coding companion that runs in the terminal. Assists with code generation, refactoring, bug explanation, debugging, and code analysis. Positioned as 'Like Claude Code, but free and open source' with 53 upvotes on Product Hunt.",
    "release_date": "2026-01-19",
    "category": "AI coding CLI",
    "sources": ["Product Hunt", "Peerlist"],
    "community_quotes": [
      "Positioned as 'Like Claude Code, but free and open source'",
      "Open source CLI-first AI coding companion for terminal-based development"
    ]
  },
  {
    "name": "yolo-cage",
    "url": "https://github.com/borenstein/yolo-cage",
    "description": "Security sandboxing tool that prevents AI coding agents from exfiltrating secrets or merging their own PRs, addressing 'YOLO mode' security concerns. Built to run in Kubernetes, scanning egress traffic for secrets while maintaining TOS compliance with Max subscription.",
    "release_date": "2026-01-21",
    "category": "workflow agent",
    "sources": ["GitHub", "Hacker News"],
    "community_quotes": [
      "Tests are the core of the new agent engineering",
      "Even if the cage code is AI-written and imperfect, it still creates a security barrier through defense in depth",
      "Solves permission prompt fatigue when using multiple AI coding agents"
    ]
  },
  {
    "name": "Moshi",
    "url": "https://www.producthunt.com/products/moshi-3",
    "description": "A mobile interface for AI coding agents that allows developers to run agents like Claude Code from iPhone. Features voice commands, persistent sessions, and Face ID security, addressing the problem that agents need frequent input but developers aren't always at their desks.",
    "release_date": "2026-01-19",
    "category": "IDE-integrated AI tools",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Agents need frequent input, but you can't always be at your desk",
      "Extends AI coding agent functionality to mobile devices for remote monitoring and guidance"
    ]
  },
  {
    "name": "Reporails",
    "url": "https://www.pitchhut.com/project/reporails-cli",
    "description": "A CLI linter designed specifically for AI coding agent instruction files (like CLAUDE.md), covering 42 rules across structure, content, efficiency, governance, and maintenance. Created to address issues where AI agents make changes 'different, not better' and actively seeking feedback and contributors.",
    "release_date": "2026-01-26",
    "category": "Single-workflow AI tool",
    "sources": ["PitchHut", "Hacker News"],
    "community_quotes": [
      "Agents can generate code, get automatic feedback from linters, and self-learn/iterate until code is clean",
      "The missing linter for AI instruction files with 42 rules covering multiple dimensions"
    ]
  },
  {
    "name": "Yolobox",
    "url": "https://github.com/finbarr/yolobox",
    "description": "A containerized environment that gives AI coding agents full sudo access and complete permissions to the development workspace, embracing the 'YOLO' philosophy of unrestricted AI agent access while protecting the user's home directory through container isolation.",
    "release_date": "2026-01-13",
    "category": "workflow agent",
    "sources": ["GitHub", "Hacker News"],
    "community_quotes": [
      "An exciting experiment exploring what happens when an AI agent gets full access to a real development environment",
      "Part of the trend of sandbox wrappers for secure AI agent containment"
    ]
  }
]