[
  {
    "productName": "Codex CLI",
    "title": "Codex CLI 0.92.0 - Dynamic Tools & API v2",
    "description": "January 27 release enables API v2 threads to inject dynamic tools at startup with end-to-end routing through server and core tool pipeline. Previous releases: 0.90.0 added network sandbox proxy (Jan 25), 0.89.0 deprecated custom prompts in favor of Skills (Jan 22).",
    "updateType": "feature",
    "url": "https://developers.openai.com/codex/changelog/",
    "date": "2026-01-27",
    "community_feedback": [
      {
        "quote": "Users discussing dynamic tool injection improvements on Reddit",
        "source": "Reddit",
        "sentiment": "neutral"
      }
    ]
  },
  {
    "productName": "Claude Code",
    "title": "Claude Code 2.1 Release",
    "description": "Major update released January 7, 2026 introducing Shift+Enter for newlines, LSP tool for code intelligence (go-to-definition, find references, hover docs), automatic skill hot-reload, forked sub-agent context, language settings, new Vim motions, IS_DEMO mode, hooks for agents, and VSCode forking/rewind capabilities. Version 2.1.1 followed with 109 CLI refinements.",
    "updateType": "release",
    "url": "https://code.claude.com/docs/en/changelog",
    "date": "2026-01-22",
    "community_feedback": [
      {
        "quote": "Claude Code + Opus 4.5 injected the immaculate hacker vibes back into AI that we haven't had since GPT-4. Everything is new",
        "source": "X",
        "sentiment": "positive"
      },
      {
        "quote": "Claude Code CLI was broken - crash issue with Invalid Version: 2.1.0",
        "source": "HN",
        "sentiment": "negative"
      },
      {
        "quote": "Unrelated edits and staying on task are still problems in 2026 for SOTA Claude Code Opus 4.5",
        "source": "X",
        "sentiment": "negative"
      },
      {
        "quote": "Over 1,096 commits in this update with 5 parallel instances and shared team knowledge",
        "source": "X",
        "sentiment": "positive"
      },
      {
        "quote": "GitHub issue: '[MODEL] OPTIMIZED TIME WASTER' - user frustration with Claude Code behavior after 2.1.0 optimizations",
        "source": "GitHub",
        "sentiment": "negative"
      }
    ]
  },
  {
    "productName": "Devin",
    "title": "Devin Review Launch (January 21, 2026)",
    "description": "Major new feature launch - Devin Review is a reimagined interface for understanding complex PRs. Groups related changes together logically, detects copied code, detects bugs and security issues, and provides an embedded PR chat interface. Also includes Repo Setup AI Suggestions and Sessions API enhancements.",
    "updateType": "feature",
    "url": "https://docs.devin.ai/release-notes/overview",
    "date": "2026-01-21",
    "community_feedback": [
      {
        "quote": "Cognition is entering a new era of product polish in 2026 with Devin Review as the first release",
        "source": "X",
        "sentiment": "positive"
      },
      {
        "quote": "Where did Devin go? Discussing concerns about the tool's visibility in the market",
        "source": "Reddit",
        "sentiment": "neutral"
      },
      {
        "quote": "Influencers have forgotten about it",
        "source": "Reddit",
        "sentiment": "negative"
      },
      {
        "quote": "Devin feels different - has a unique approach compared to Cursor",
        "source": "Blog",
        "sentiment": "neutral"
      }
    ]
  },
  {
    "productName": "Cursor",
    "title": "Cursor CLI Updates (January 2026)",
    "description": "January 16 release adds Agent Modes (Plan and Ask), Cloud Handoff for background tasks, and One-Click MCP Auth. January 8 release introduced new commands for models, rules, and MCP management, with hooks performance improved 10-20x.",
    "updateType": "feature",
    "url": "https://cursor.com/changelog",
    "date": "2026-01-16",
    "community_feedback": [
      {
        "quote": "Agent modes still in its infantry - early stage but promising",
        "source": "HN",
        "sentiment": "neutral"
      },
      {
        "quote": "Watch out for cursor cli - users reported automatic switching to on-demand mode without notification",
        "source": "Reddit",
        "sentiment": "negative"
      },
      {
        "quote": "This ux is unacceptable - user complained about layout changes and loss of editor mode toggle",
        "source": "Cursor Forum",
        "sentiment": "negative"
      },
      {
        "quote": "Users appreciate the agent-first model treating AI as 'background workers'",
        "source": "Reddit",
        "sentiment": "positive"
      }
    ]
  },
  {
    "productName": "GitHub Copilot",
    "title": "Copilot CLI Enhanced Agents",
    "description": "January 14 update brings enhanced agent capabilities with improved context management and new installation methods. VS Code Copilot update adds parallel subagent execution, new skills system, and deeper Claude integration.",
    "updateType": "feature",
    "url": "https://github.blog/changelog/2026-01-14-github-copilot-cli-enhanced-agents-context-management-and-new-ways-to-install/",
    "date": "2026-01-14",
    "community_feedback": [
      {
        "quote": "Users praising Copilot's agent UI, with comments about using Sonnet and Opus models in agent mode",
        "source": "HN",
        "sentiment": "positive"
      },
      {
        "quote": "Users reporting slow start-stop cycles affecting workflow with Copilot Agent in GitHub webapp",
        "source": "GitHub Community",
        "sentiment": "negative"
      }
    ]
  },
  {
    "productName": "Gemini CLI",
    "title": "Version 0.26.0 - Hooks & Monitoring",
    "description": "January 13 release enables hooks by default for workflow customization. January 7 introduced pre-configured Google Cloud Monitoring dashboards with OpenTelemetry support. Version 0.22 made Gemini 3 models available to free users with Conductor and Endor Labs integration.",
    "updateType": "feature",
    "url": "https://geminicli.com/docs/changelogs/",
    "date": "2026-01-13",
    "community_feedback": [
      {
        "quote": "Gemini 3 Flash in Gemini CLI is better than Claude Code",
        "source": "HN",
        "sentiment": "positive"
      },
      {
        "quote": "Users noted being unable to upgrade past version 0.24.5, with newer versions freezing on startup",
        "source": "Reddit",
        "sentiment": "negative"
      },
      {
        "quote": "Gemini CLI is impressive, but Claude Code outperforms on reasoning-heavy tasks",
        "source": "Reddit",
        "sentiment": "neutral"
      }
    ]
  },
  {
    "productName": "Windsurf",
    "title": "Version 1.13.6 - Agent Skills & Security",
    "description": "January 12 release adds Agent Skills support for Cascade AI agent system and integrates Code Integrity layer for security. Version 1.13.107 (January 9) enhances Plan Mode and adds Skills support.",
    "updateType": "feature",
    "url": "https://windsurf.com/changelog",
    "date": "2026-01-12",
    "community_feedback": [
      {
        "quote": "Windsurf 1.13.6 Agent Skills bug - skills installed via terminal don't show up in Skills tab",
        "source": "Reddit",
        "sentiment": "negative"
      }
    ]
  },
  {
    "productName": "Continue",
    "title": "CLI v1.5.33 & Mission Control Redesign",
    "description": "January 15, 2026 stable release v1.5.33. New Agent Skills feature merged, Mission Control redesign for faster AI workflow setup. Documentation automation guide released. Supports Claude 3.5 Sonnet and DeepSeek Coder v2.",
    "updateType": "feature",
    "url": "https://changelog.continue.dev/",
    "date": "2026-01-15",
    "community_feedback": []
  }
]
