[
  {
    "title": "OpenAI API now supports Skills with inline base64-encoded zip data",
    "description": "OpenAI's adoption of Skills continues to gain ground. You can now use Skills directly in the OpenAI API with their shell tool. You can zip skills up and upload them first, but an even neater interface is the ability to send skills with the JSON request as inline base64-encoded zip data. This makes it much easier to package and distribute custom tools for coding agents.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/11/skills-in-openai-api/",
    "published_date": "2026-02-11",
    "topics": ["openai", "skills", "api", "coding-agents", "llm"],
    "type": "technical"
  },
  {
    "title": "GLM-5: From Vibe Coding to Agentic Engineering",
    "description": "Z.ai released GLM-5, a huge new MIT-licensed model with 754B parameters and 1.51TB on Hugging Face - twice the size of GLM-4.7. Interesting to see Z.ai take a position on what we should call professional software engineers building with LLMs - 'Agentic Engineering' is showing up more frequently, most notably from Andrej Karpathy and Addy Osmani.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/11/glm-5/",
    "published_date": "2026-02-11",
    "topics": ["glm", "llm-release", "agentic-engineering", "vibe-coding", "ai-in-china"],
    "type": "technical"
  },
  {
    "title": "Introducing Showboat and Rodney, so agents can demo what they've built",
    "description": "A key challenge working with coding agents is having them both test what they've built and demonstrate that software to you, their overseer. This goes beyond automated tests—we need artifacts that show their progress and help us see exactly what the agent-produced software is able to do. Showboat and Rodney are two new tools aimed at this problem.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/10/showboat-and-rodney/",
    "published_date": "2026-02-10",
    "topics": ["showboat", "rodney", "testing", "coding-agents", "tools"],
    "type": "technical"
  },
  {
    "title": "Structured Context Engineering for File-Native Agentic Systems",
    "description": "New paper by Damon McMillan exploring challenging LLM context tasks involving large SQL schemas (up to 10,000 tables) across different models and file formats. The biggest impact was the models themselves - frontier models (Opus 4.5, GPT-5.2, Gemini 2.5 Pro) beat the leading open source models (DeepSeek V3.2, Kimi K2, Llama 4). Frontier models benefited from filesystem based context retrieval, but open source models had much less convincing results.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/9/structured-context/",
    "published_date": "2026-02-09",
    "topics": ["context-engineering", "prompt-engineering", "research-paper", "sql", "llm"],
    "type": "technical"
  },
  {
    "title": "AI Doesn't Reduce Work—It Intensifies It",
    "description": "Aruna Ranganathan and Xingqi Maggie Ye from Berkeley Haas report findings from their April to December 2025 study of 200 employees. AI introduced a new rhythm in which workers managed several active threads at once: manually writing code while AI generated an alternative version, running multiple agents in parallel, or reviving long-deferred tasks because AI could 'handle them' in the background. This created cognitive load and a sense of always juggling, even as the work felt productive.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/9/ai-intensifies-work/",
    "published_date": "2026-02-09",
    "topics": ["ai-ethics", "productivity", "burnout", "research", "cognitive-load"],
    "type": "opinion"
  },
  {
    "title": "Vouch: A system to address AI-generated PRs in open source",
    "description": "Mitchell Hashimoto's new system to help address the deluge of worthless AI-generated PRs faced by open source projects. The idea is simple: Unvouched users can't contribute to your projects. Very bad users can be explicitly 'denounced', effectively blocked. Users are vouched or denounced by contributors via GitHub issue or discussion comments or via the CLI.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/7/vouch/",
    "published_date": "2026-02-07",
    "topics": ["open-source", "github", "ai-ethics", "spam-prevention", "mitchell-hashimoto"],
    "type": "technical"
  },
  {
    "title": "Claude Opus 4.6 Fast Mode: 2.5x faster at 6x the price",
    "description": "Anthropic released a 'research preview' of a faster version of Claude Opus 4.6 accessible by typing /fast in Claude Code. Opus is normally $5/million input and $25/million output. The new fast mode is $30/million input and $150/million output - 6x the normal price (3x before Feb 16th with discount). Our teams have been building with a 2.5x-faster version of Claude Opus 4.6.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/7/claude-fast-mode/",
    "published_date": "2026-02-07",
    "topics": ["anthropic", "claude", "pricing", "performance", "llm"],
    "type": "technical"
  },
  {
    "title": "How StrongDM's AI team build serious software without even looking at the code",
    "description": "A team implementing what Dan Shapiro called the Dark Factory level of AI adoption, where no human even looks at the code the coding agents are producing. The team from StrongDM shared the first public description of how they are working in Software Factories and the Agentic Moment.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/7/strongdm-dark-factory/",
    "published_date": "2026-02-07",
    "topics": ["coding-agents", "dark-factory", "strongdm", "agentic-engineering", "case-study"],
    "type": "technical"
  },
  {
    "title": "Mental health crisis among software engineers experiencing AI shift",
    "description": "Tom Dale: 'I don't know why this week became the tipping point, but nearly every software engineer I've talked to is experiencing some degree of mental health crisis. Many people assuming I meant job loss anxiety but that's just one presentation. I'm seeing near-manic episodes triggered by watching software shift from scarce to abundant. Compulsive behaviors around agent usage. Dissociative awe at the temporal compression of change.'",
    "author": "Tom Dale (via Simon Willison)",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/6/mental-health-crisis/",
    "published_date": "2026-02-06",
    "topics": ["mental-health", "ai-ethics", "careers", "software-engineering", "burnout"],
    "type": "discussion"
  },
  {
    "title": "Running Pydantic's Monty Rust sandboxed Python subset in WebAssembly",
    "description": "Pydantic's latest attempt, Monty, provides a custom Python-like language (a subset of Python) in Rust and makes it available as both a Rust library and a Python package. Successfully got it working in WebAssembly, providing a sandbox-in-a-sandbox. Everyone's building sandboxes for running untrusted code right now.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/6/monty-pyodide/",
    "published_date": "2026-02-06",
    "topics": ["pydantic", "webassembly", "rust", "python", "sandboxing", "security"],
    "type": "technical"
  },
  {
    "title": "Mitchell Hashimoto: My AI Adoption Journey",
    "description": "Some really good and unconventional tips for getting to a place with coding agents where they demonstrably improve your workflow and productivity. Key tips include: Reproduce your own work - when learning to use coding agents, do the work manually, then recreate the same solution using agents as an exercise. End-of-day agents - block out the last 30 minutes of every day to kick off one or more agents. Outsource the Slam Dunks - once you know an agent can likely handle a task, have it do that task while you work on something more interesting yourself.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/5/mitchell-hashimoto-ai-adoption/",
    "published_date": "2026-02-05",
    "topics": ["mitchell-hashimoto", "coding-agents", "workflow", "productivity", "best-practices"],
    "type": "opinion"
  },
  {
    "title": "Anthropic releases Opus 4.6, OpenAI releases GPT-5.3-Codex",
    "description": "Two major new model releases within about 15 minutes of each other. Anthropic released Opus 4.6. OpenAI released GPT-5.3-Codex, albeit only via their Codex app, not yet in their API. Finding it hard to find a good angle to write about them - they're both really good, but so were their predecessors. The most convincing story about capabilities so far is Nicholas Carlini from Anthropic talking about Opus 4.6 and Building a C compiler with a team of parallel Claudes.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/5/opus-4.6-and-gpt-5.3/",
    "published_date": "2026-02-05",
    "topics": ["llm-release", "anthropic", "openai", "claude", "codex", "model-evaluation"],
    "type": "technical"
  },
  {
    "title": "Anthropic releases Opus 4.6 with new 'agent teams'",
    "description": "On Thursday, Anthropic released the latest version of Opus — its most advanced model and a particularly important model for Claude Code. The release includes new 'agent teams' functionality that allows multiple AI agents to collaborate on complex tasks.",
    "author": "TechCrunch",
    "source": "Tech Media",
    "url": "https://techcrunch.com/2026/02/05/anthropic-releases-opus-4-6-with-new-agent-teams/",
    "published_date": "2026-02-05",
    "topics": ["anthropic", "claude", "opus", "agent-teams", "llm-release", "coding-agents"],
    "type": "technical"
  },
  {
    "title": "OpenAI launches new agentic coding model only minutes after Anthropic drops its own",
    "description": "OpenAI released GPT-5.3-Codex just minutes after Anthropic's Opus 4.6 launch. The new model is built to accelerate capabilities of Codex, the agentic coding tool OpenAI launched earlier in the week, intensifying competition between the two AI labs.",
    "author": "TechCrunch",
    "source": "Tech Media",
    "url": "https://techcrunch.com/2026/02/05/openai-launches-new-agentic-coding-model-only-minutes-after-anthropic-drops-its-own/",
    "published_date": "2026-02-05",
    "topics": ["openai", "gpt-5.3", "codex", "llm-release", "coding-agents", "competition"],
    "type": "technical"
  }
]
