[
  {
    "productName": "Claude Code",
    "title": "Claude Code v2.1.37 - Opus 4.6 Fast Mode & Agent Teams",
    "description": "Anthropic released multiple updates in February 2026, including fast mode support for Opus 4.6 (v2.1.36), research preview of agent teams for multi-agent collaboration (v2.1.32), automatic memory recording (v2.1.32), and numerous bug fixes. Key improvements include enhanced PDF reading with page ranges, MCP server OAuth client credentials, and better session management.",
    "updateType": "feature",
    "url": "https://claude.ai/code",
    "date": "2026-02-07",
    "community_feedback": []
  },
  {
    "productName": "Cursor",
    "title": "Cursor - Subagents, Skills & Image Generation",
    "description": "Cursor released a major update introducing subagents for parallel task execution, agent skills for domain-specific workflows, and native image generation capabilities. Also added CLI agent modes (Plan, Ask), cloud agent handoff, and enterprise features including conversation insights and billing groups.",
    "updateType": "feature",
    "url": "https://cursor.com/changelog",
    "date": "2026-02-04",
    "community_feedback": []
  },
  {
    "productName": "GitHub Copilot",
    "title": "GitHub Copilot - January Update for Visual Studio",
    "description": "GitHub released the January 2026 update for Copilot in Visual Studio, featuring colorized code completions, partial acceptance of code completions, productivity improvements including faster scrolling and HTML-rich copy-paste, and streamlined Markdown preview controls. Also announced GitHub Mobile model picker for Copilot coding agent.",
    "updateType": "feature",
    "url": "https://github.blog/changelog/2026-02-04-github-copilot-in-visual-studio-january-update/",
    "date": "2026-02-04",
    "community_feedback": []
  },
  {
    "productName": "Windsurf",
    "title": "Windsurf 1.9544.35 - Claude Opus 4.6 (Fast Mode)",
    "description": "Windsurf released Claude Opus 4.6 and Opus 4.6 (fast mode) in early February 2026. The fast mode offers up to 2.5x higher output speeds while maintaining the same intelligence as standard Opus 4.6. Also released Tab v2 model selector to all users with promotional pricing available until February 16.",
    "updateType": "release",
    "url": "https://windsurf.com/changelog",
    "date": "2026-02-04",
    "community_feedback": []
  },
  {
    "productName": "Devin",
    "title": "Devin - Scheduled Sessions & Enterprise Features",
    "description": "Cognition released multiple February 2026 updates for Devin, introducing scheduled Devin sessions that can run automatically on a recurring schedule, enterprise organization selection improvements, auto-review settings configuration, and per-product consumption analytics API v3.",
    "updateType": "feature",
    "url": "https://docs.devin.ai/release-notes/overview",
    "date": "2026-02-03",
    "community_feedback": []
  },
  {
    "productName": "Gemini CLI",
    "title": "Gemini CLI 5.0 - Major CLI Upgrade",
    "description": "Google released Gemini CLI 5.0 in February 2026, described as a massive upgrade to the terminal experience. The new version emphasizes orchestrating AI agents rather than just chatting, with enhanced agentic capabilities for enterprise workflows.",
    "updateType": "release",
    "url": "https://geminicli.com/docs/changelogs/",
    "date": "2026-02-06",
    "community_feedback": []
  },
  {
    "productName": "Codex CLI",
    "title": "GPT-5.3-Codex Integration & CLI Features",
    "description": "OpenAI introduced GPT-5.3-Codex running 25% faster for Codex users due to infrastructure improvements. The CLI gained new features including /streamer-mode command, more flexible shellId handling, enhanced memory features, and extended Control-C message display to 5 seconds.",
    "updateType": "feature",
    "url": "https://developers.openai.com/codex/changelog/",
    "date": "2026-02-09",
    "community_feedback": []
  }
]
