[
  {
    "name": "Vibe Pocket",
    "url": "https://vibepocket.com/",
    "description": "A cloud-based platform that enables running AI coding agents like Claude Code, Codex, and OpenCode on mobile devices or web. Developers connect GitHub, pick an agent, and start building from any device, transforming mobile phones into coding studios.",
    "release_date": "2025-12-23",
    "category": "AI coding workflow tool",
    "sources": ["Product Hunt", "Google Play Store"],
    "community_quotes": [
      "Bringing powerful AI coding agents to mobile devices",
      "Transform your phone into a powerful coding studio",
      "Run AI agents like Claude Code, Codex, Opencode on mobile"
    ]
  },
  {
    "name": "Toad",
    "url": "https://willmcgugan.github.io/toad-released/",
    "description": "A unified terminal UI for AI coding agents that supports 12+ agent CLIs including OpenHands, Claude Code, and Gemini CLI through the ACP protocol. Provides a refined terminal experience with fuzzy file search, Markdown streaming, shell integration, and notebook-style persistent conversations.",
    "release_date": "2025-12-18",
    "category": "AI coding CLI",
    "sources": ["Official Blog", "GitHub", "InfoQ"],
    "community_quotes": [
      "A unified front-end for multiple AI tools running in the terminal",
      "Supports 12 agent CLIs with a single beautiful terminal UI",
      "Brings GUI-level interactions to agentic coding in the terminal"
    ]
  },
  {
    "name": "Google Agent Designer (Vertex AI)",
    "url": "https://cloud.google.com/vertex-ai",
    "description": "A low-code visual designer launched in Google Cloud Vertex AI that allows users to design, test, and orchestrate AI agents and subagents through a visual interface. Available in Preview, it enables enterprise development teams to build AI agents without extensive coding.",
    "release_date": "2025-12-18",
    "category": "workflow agent",
    "sources": ["Google Cloud", "Google Dev Community"],
    "community_quotes": [
      "Low-code visual interface for orchestrating AI agents",
      "Brings agent design to enterprise development teams",
      "Visual designer for testing and deploying AI agents"
    ]
  }
]
