[
  {
    "name": "Eigent",
    "url": "https://github.com/eigent-ai/eigent",
    "description": "The world's first open-source multi-agent workforce desktop application. Dynamically breaks down tasks and activates multiple agents to work in parallel, running locally on your machine. Positioned as an open-source alternative to Claude Cowork, achieving #1 on GitHub Trending with 4.5K+ stars in 4 days.",
    "release_date": "2026-01-21",
    "category": "code agent",
    "sources": ["GitHub Trending", "Hacker News"],
    "community_quotes": [
      "World's first multi-agent workflow desktop application",
      "Gained 4.5K+ stars in just 4 days",
      "The open-source answer to Claude Cowork"
    ]
  },
  {
    "name": "AionUi",
    "url": "https://github.com/iOfficeAI/AionUi",
    "description": "A free, local, open-source universal interface for AI coding tools. Compatible with all major CLI agents (Gemini CLI, Claude Code, Codex, OpenCode, Qwen Code, Goose Cli, Auggie) providing a unified GUI with smart file management and preview panels. Hit #1 on GitHub trending.",
    "release_date": "2026-01-19",
    "category": "IDE-integrated AI tool",
    "sources": ["GitHub Trending", "GitHub"],
    "community_quotes": [
      "Free, local, open-source Cowork interface",
      "Universal compatibility with ALL major coding agents",
      "Model aggregation and privacy-first approach"
    ]
  },
  {
    "name": "Yolobox",
    "url": "https://github.com/finbarr/yolobox",
    "description": "A sandboxed environment tool that lets AI coding agents (Claude Code, Codex, Gemini CLI) run with full sudo privileges while protecting your home directory from accidental damage. Uses Docker/Podman container isolation to mount projects at /workspace without mounting sensitive home directories.",
    "release_date": "2026-01-20",
    "category": "AI coding CLI",
    "sources": ["Show HN", "GitHub"],
    "community_quotes": [
      "Let your AI go full send. Your home directory stays home",
      "Run Claude Code, Codex, or any AI coding agent in 'yolo mode' without nuking your home directory",
      "The AI can go absolutely wild inside the sandbox. Your actual home directory? Untouchable."
    ]
  },
  {
    "name": "Gambit",
    "url": "https://github.com/bolt-foundry/gambit",
    "description": "An open-source agent harness framework for building reliable AI agents. Described as 'like an operating system for AI agents' that helps compose small, typed 'decks' with clear inputs/outputs, guardrails, and tool calling management. Focuses on type safety and structured LLM workflows rather than just orchestration.",
    "release_date": "2026-01-20",
    "category": "code agent",
    "sources": ["Show HN", "GitHub"],
    "community_quotes": [
      "An open-source agent harness for building reliable AI agents",
      "Like an operating system for AI agents",
      "Type-safe decks with clear inputs and outputs"
    ]
  },
  {
    "name": "create-vibe-app",
    "url": "https://github.com/hscspring/create-vibe-app",
    "description": "A scaffolding tool that creates AI-friendly project structures optimized for 'Vibe Coding' methodology - a development approach where developers use natural language to describe requirements and let AI handle implementation. Helps make codebases more effective for AI agent collaboration.",
    "release_date": "2026-01-20",
    "category": "AI workflow tool",
    "sources": ["GitHub"],
    "community_quotes": [
      "Scaffold AI-friendly project structures for Vibe Coding",
      "A methodology that helps AI agents work more effectively on your codebase"
    ]
  },
  {
    "name": "Hover",
    "url": "https://github.com/Sampsoon/hover",
    "description": "A browser extension that brings IDE-style hover documentation to any webpage. Works on documentation sites and AI chat apps like ChatGPT and Claude, showing inline documentation when hovering over code snippets using OpenRouter or custom OpenAI-compatible endpoints.",
    "release_date": "2026-01-18",
    "category": "AI workflow tool",
    "sources": ["Show HN", "GitHub"],
    "community_quotes": [
      "Hover over code on any webpage to see documentation. Like your IDE, but everywhere",
      "Works on documentation sites and AI chat apps like ChatGPT and Claude"
    ]
  },
  {
    "name": "Phoenix CLI",
    "url": "https://arize.com/docs/phoenix/release-notes/01-2026/01-17-2026-phoenix-cli-ai-agent-debugging",
    "description": "A command-line interface for retrieving trace data from Phoenix observability platform. Provides terminal-based access to debugging data for AI coding assistants (Claude Code, Cursor, Windsurf, Codex, Gemini CLI), allowing AI agents to query observability data directly via shell commands and export traces as structured JSON.",
    "release_date": "2026-01-17",
    "category": "AI workflow tool",
    "sources": ["Product Hunt", "Arize"],
    "community_quotes": [
      "AI coding assistants operate through two primary interfaces: the terminal and the filesystem",
      "A browser-based UI, while useful for humans, is inaccessible to an AI assistant working in your IDE",
      "The CLI bridges this gap - makes Phoenix data available where AI assistants already work"
    ]
  },
  {
    "name": "AudioNoise",
    "url": "https://github.com/torvalds/AudioNoise",
    "description": "Linus Torvalds' first public project using AI programming tools - a random digital audio effects library implementing phasers, echoes, and other guitar effects. Notable as a milestone marking the Linux creator's embrace of AI-assisted 'vibe coding' after previously criticizing AI programming tools.",
    "release_date": "2026-01-17",
    "category": "AI workflow tool",
    "sources": ["GitHub", "Hacker News"],
    "community_quotes": [
      "Linus Torvalds首次公开使用AI编程工具完成AudioNoise项目",
      "真香！刚骂完AI，Linux之父的首个Vibe Coding项目上线",
      "Linux祖师爷真香现场！曾嘲讽AI编程是垃圾，如今亲自下场"
    ]
  }
]
