[
  {
    "name": "Anthropic Agent Skills",
    "url": "https://markets.financialcontent.com/wral/article/tokenring-2025-12-24-anthropic-launches-agent-skills-open-standard-the-new-universal-language-for-ai-interoperability",
    "description": "A new open standard protocol released on December 24, 2025 for AI interoperability. Agent Skills provides a universal language for AI agents to communicate and collaborate across different platforms and tools.",
    "release_date": "2025-12-24",
    "category": "workflow orchestration agent",
    "sources": ["Financial Content Markets"],
    "community_quotes": [
      "The new universal language for AI interoperability",
      "Open standard protocol for AI agent collaboration"
    ]
  },
  {
    "name": "MiniMax M2.1",
    "url": "https://www.minimax.ai/",
    "description": "Chinese AI startup MiniMax's latest model with significantly enhanced performance for real-world applications and multi-language programming versatility, positioning it as a competitive option for AI-powered coding tasks.",
    "release_date": "2025-12-23",
    "category": "AI coding CLI",
    "sources": ["SiliconAngle"],
    "community_quotes": [
      "Significantly enhanced performance for real-world applications",
      "Multi-language programming versatility"
    ]
  },
  {
    "name": "GLM-4.7",
    "url": "https://bigmodel.cn/",
    "description": "Zhipu AI's latest flagship model specifically designed for 'Agentic Coding' scenarios, achieving 73.8% on SWE-bench benchmark with enhanced programming abilities, better long-term task planning, improved tool collaboration, and more stable multi-step reasoning.",
    "release_date": "2025-12-22",
    "category": "AI coding CLI",
    "sources": ["Zhipu AI Official", "Digital Applied", "Reddit"],
    "community_quotes": [
      "Claims leading performance among open-source models on multiple public benchmarks",
      "Compatible with 20+ popular AI coding tools including Claude Code"
    ]
  },
  {
    "name": "Zenflow",
    "url": "https://zencoder.ai/",
    "description": "A free AI orchestration desktop platform that brings engineering discipline to AI coding. Analyzes developer tasks, plans work, assigns steps to specialized coding agents, and uses multi-agent verification with specification-driven workflows.",
    "release_date": "2025-12-16",
    "category": "workflow agent",
    "sources": ["PR Newswire", "VentureBeat", "HPC Wire"],
    "community_quotes": [
      "Ends the era of vibe coding and brings engineering discipline to AI",
      "Turns unpredictable agent behavior into reliable, repeatable engineering velocity"
    ]
  },
  {
    "name": "GitHub Spark",
    "url": "https://github.blog/",
    "description": "An AI-powered prompt-based app builder that lets anyone build micro-apps without writing code. Users describe their idea in natural language and Spark transforms it into a working application.",
    "release_date": "2025-12-12",
    "category": "workflow agent",
    "sources": ["DevOps Digest", "Threads"],
    "community_quotes": [
      "Lets anyone build micro-apps without needing to write code",
      "Transform natural language descriptions into functional applications"
    ]
  }
]