{
  "newProducts": [
    {
      "title": "Google Antigravity",
      "description": "Agent-first AI coding tool built for Gemini 3 Pro that delegates complex multi-tool software tasks to AI agents. Features browser control, terminal access, and autonomous planning capabilities across editor and terminal environments.",
      "url": "https://developers.googleblog.com/en/build-with-google-antigravity-our-new-agentic-development-platform/",
      "source": "News",
      "category": "IDE"
    },
    {
      "title": "Qoder JetBrains Plugin",
      "description": "JetBrains plugin that understands your backend's real complexity beyond just syntax. Provides AI-powered code completion and assistance specifically designed for complex codebases.",
      "url": "https://www.producthunt.com/",
      "source": "Product Hunt",
      "category": "IDE Extension"
    },
    {
      "title": "Agenta",
      "description": "Open-source prompt management and LLMOps platform for building reliable LLM applications. Features prompt engineering, evaluation, debugging, and monitoring tools in one platform.",
      "url": "https://agenta.ai/",
      "source": "Product Hunt",
      "category": "Library"
    },
    {
      "title": "CodingFox",
      "description": "Open-source AI-powered code review assistant that revolutionizes pull request workflows. Uses advanced language models to provide intelligent code analysis and review suggestions.",
      "url": "https://github.com/furudo-erika/codingfox",
      "source": "HN | GitHub",
      "category": "Library"
    },
    {
      "title": "Windsurf Editor",
      "description": "AI-native IDE built on VS Code foundation with agent-powered features. First to emphasize 'Agentic' mode for collaborative AI development experience with Supercomplete feature for intuitive coding.",
      "url": "https://windsurf.com/editor",
      "source": "News",
      "category": "IDE"
    },
    {
      "title": "Zed AI",
      "description": "High-performance code editor with integrated AI assistant capabilities. Supports GitHub Copilot and GPT-3/4 models for code generation, refactoring, and real-time editing. Built with Rust for optimal performance.",
      "url": "https://zed.dev/ai",
      "source": "News",
      "category": "IDE"
    },
    {
      "title": "OpenHands",
      "description": "Open-source AI coding assistant that acts as a full-capability software developer. Can perform any task a human developer can handle, from bug fixes to feature implementation.",
      "url": "https://github.com/all-hands-ai/OpenHands",
      "source": "GitHub",
      "category": "Autonomous Agent"
    },
    {
      "title": "Devseek.ai",
      "description": "AI-powered SaaS platform that completely automates the software development lifecycle (SDLC)—from ideation to deployment—without requiring human intervention.",
      "url": "https://github.com/topics/ai-code-generation",
      "source": "GitHub",
      "category": "Autonomous Agent"
    },
    {
      "title": "Claude Code 2.0",
      "description": "Enhanced version of Anthropic's agentic coding tool featuring checkpoints for autonomous operation, native VS Code extension, and terminal UX updates. Powered by Claude Sonnet 4.5 for improved coding capabilities.",
      "url": "https://www.anthropic.com/news/enabling-claude-code-to-work-more-autonomously",
      "source": "News",
      "category": "CLI Tool"
    },
    {
      "title": "Turbotic Automation AI",
      "description": "AI tool that turns ideas into automations in minutes through conversational interface. No coding required to create powerful automated workflows and integrations.",
      "url": "https://www.producthunt.com/categories/ai-software",
      "source": "Product Hunt",
      "category": "Framework"
    }
  ],
  "whitelistUpdates": [],
  "insights": [],
  "generatedAt": "2025-11-28T16:20:04.598Z"
}