[
  {
    "name": "Google Antigravity",
    "url": "https://developers.googleblog.com/en/build-with-google-antigravity-our-new-agentic-development-platform/",
    "description": "AI-first integrated development environment launched alongside Gemini 3 Pro, designed as an agent-first IDE that enables developers to delegate complex coding tasks to autonomous AI agents.",
    "release_date": "2025-11-18",
    "category": "AI IDE",
    "sources": ["Google Blog", "The Verge", "Developer Blogs"],
    "community_quotes": [
      "Described as potentially 'the most significant development tool since Git'",
      "Called a 'revolutionary AI-first IDE that's redefining how developers code'",
      "Agent-first coding tool built specifically for Gemini 3 Pro"
    ]
  },
  {
    "name": "Kiro CLI",
    "url": "https://kiro.dev/blog/general-availability/",
    "description": "Terminal-based AI coding assistant that brings Kiro's powerful capabilities to the command line, featuring access to leading AI models, Auto Agent functionality, and web search capabilities for enhanced development workflows.",
    "release_date": "2025-11-17",
    "category": "AI coding CLI",
    "sources": ["Kiro Official Blog", "AWS Announcement", "Developer Community"],
    "community_quotes": [
      "AWS announced Kiro as their AI coding assistant for enterprise teams",
      "Brings all IDE capabilities to the terminal with enhanced CLI workflows",
      "Auto Agent functionality enables autonomous coding tasks from command line"
    ]
  },
  {
    "name": "Google ADK Go",
    "url": "https://www.marktechpost.com/2025/11/07/google-extends-its-agent-development-kit-adk-to-go-bringing-native-agentic-workflows-to-backend-teams/",
    "description": "Google's Agent Development Kit extended to Go, bringing native agentic workflows to backend teams with open-source toolkit for building AI agents.",
    "release_date": "2025-11-07",
    "category": "Open-source AI coding framework",
    "sources": ["Google Blog", "GitHub", "MarkTechPost"],
    "community_quotes": [
      "Bringing native agentic workflows to backend teams",
      "Open-source toolkit for building AI agents",
      "Supports local development to managed production deployment"
    ]
  }
]