[
  {
    "name": "Moonshot K2.5",
    "url": "https://www.moonshot.cn",
    "description": "An upgrade to Moonshot AI's flagship model that processes text, images, and videos simultaneously from a single prompt. Includes an automated coding tool designed to rival competitors, with benchmark performance outperforming open-source peers.",
    "release_date": "2026-01-27",
    "category": "AI coding model",
    "sources": ["Bloomberg"],
    "community_quotes": [
      "Heating up the domestic arms race ahead of DeepSeek release",
      "Aligns with trend toward omni models pioneered by OpenAI and Google"
    ]
  },
  {
    "name": "LobeHub",
    "url": "https://lobehub.com",
    "description": "An open-source AI Agent Workspace that enables discovery, building, and collaboration with AI agent teams. Features multi-LLM support (ChatGPT, Claude, Gemini, OLLaMA), multimodal capabilities including image generation with DALL-E 3 and MidJourney, voice support, and an extensible plugin system for workflow orchestration.",
    "release_date": "2026-01-27",
    "category": "AI agent workspace",
    "sources": ["Product Hunt", "GitHub"],
    "community_quotes": [
      "Won 'Launch of the Day' on Product Hunt for January 27, 2026",
      "Aiming to become the world's largest network of human-agent collaboration",
      "AI Agent playground for both regular users and professional developers"
    ]
  },
  {
    "name": "Clawdbot",
    "url": "https://github.com/clawdbot/clawdbot",
    "description": "An open-source self-hosted AI assistant that operates as a local AI agent with full system privileges, enabling execution of shell commands, file operations, and browser automation using Puppeteer and Playwright. Supports reverse control through messaging apps like WhatsApp, Telegram, Discord, Slack, and iMessage.",
    "release_date": "2026-01-26",
    "category": "AI coding agent",
    "sources": ["GitHub", "MacStories", "MLQ.ai"],
    "community_quotes": [
      "Demonstrating the future of personal AI assistants",
      "Jarvis living in a hard drive",
      "Claude with hands for real-world task execution",
      "Reached 10,200+ GitHub stars within days of launch",
      "Caused increased Mac mini demand due to optimal local AI performance"
    ]
  },
  {
    "name": "Mastra 1.0",
    "url": "https://mastra.ai",
    "description": "A modern TypeScript AI framework for building production-ready AI applications and agents. Features include durable graph-based workflows with branching and parallel execution, persistent memory system, streaming support, LLM chaining, tools integration, comprehensive tracing and evaluation tools. Created by the team behind Gatsby, part of YC W25.",
    "release_date": "2026-01-22",
    "category": "AI agent framework",
    "sources": ["Product Hunt", "GitHub", "Dev.to"],
    "community_quotes": [
      "300,000+ weekly npm downloads",
      "19,400+ GitHub stars",
      "Production use at companies like Replit and WorkOS",
      "The TypeScript AI framework that feels like a breath of fresh air",
      "Built for scale and production use cases"
    ]
  }
]
