[
  {
    "name": "1Code",
    "url": "https://1code.dev",
    "description": "An open-source Cursor-like UI for Claude Code that runs multiple Claude Code agents in parallel on Mac and Web platforms with live previews.",
    "release_date": "2026-01-16",
    "category": "AI code editor",
    "sources": ["Product Hunt"],
    "community_quotes": []
  },
  {
    "name": "Coderrr",
    "url": "https://coderrr.aksn.lol",
    "description": "An open-source CLI-first AI coding companion that writes, debugs, and ships code. Like Claude Code but free and open source with support for multiple providers including Ollama for local models.",
    "release_date": "2026-01-18",
    "category": "AI coding CLI",
    "sources": ["Product Hunt"],
    "community_quotes": ["big fan of the CLI-first approach for those of us who live outside VS Code", "CLI-first + pluggable providers (Ollama/OpenRouter/etc.) is a solid 'inspectable agent' direction", "local/Ollama support is a strong differentiator"]
  },
  {
    "name": "IQuest Coder V1",
    "url": "https://github.com/IQuestLab/IQuest-Coder-V1",
    "description": "An open-source AI coding model from Ubiquant's hedge fund lab that matches Claude Sonnet 4.5 and GPT performance with only 40B parameters using novel Code-Flow training on commit histories and repository evolution patterns.",
    "release_date": "2026-01-01",
    "category": "Open-source AI coding model",
    "sources": ["DEV Community", "GitHub"],
    "community_quotes": ["matches or beats the best commercial models with 20x fewer parameters", "Code-Flow training is genuinely innovative", "self hosted coding assistants using IQuest become common"]
  },
  {
    "name": "GitLab Duo Agent Platform",
    "url": "https://about.gitlab.com/stage-by-stage/gitlab-duo-agent-platform/",
    "description": "An agentic AI orchestration platform for DevSecOps that enables teams to orchestrate AI agents across the entire software lifecycle, featuring Agentic Chat, foundational agents, custom agents, and prebuilt flows for CI/CD, security, and code review workflows.",
    "release_date": "2026-01-15",
    "category": "Workflow orchestration AI agent",
    "sources": ["GitLab Press Release"],
    "community_quotes": ["Having GitLab Duo AI agents embedded in our system of record for code, tests, CI/CD, and the entire software development lifecycle boosts productivity", "marks a fundamental shift in how AI delivers value in software development", "orchestrate AI agents across the entire lifecycle in one unified system"]
  },
  {
    "name": "Knowns CLI",
    "url": "https://www.producthunt.com/products/knowns-cli",
    "description": "An AI-first CLI for task management and documentation that links docs in tasks and uses AI to read context automatically to avoid repeating patterns every session.",
    "release_date": "2026-01-14",
    "category": "AI coding CLI",
    "sources": ["Product Hunt"],
    "community_quotes": []
  }
]