[
  {
    "title": "Simon Willison publishes comprehensive guide to HTML tools and AI-assisted development",
    "description": "Willison published a detailed article on 'Useful patterns for building HTML tools' documenting his experience building over 150 HTML+JavaScript+CSS tools in the past two years, almost all written by LLMs. The article covers 18 key patterns including single-file architecture, avoiding React, using CDNs, prototyping with Artifacts/Canvas, copy/paste utilities, localStorage for secrets, CORS-enabled APIs, direct LLM API calls, WebAssembly integration, and tool remixing. Emphasizes 'no React' approach to avoid build steps and maintain copy-paste simplicity.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/10/html-tools/",
    "published_date": "2025-12-10",
    "topics": ["HTML tools", "AI-assisted development", "LLM coding", "WebAssembly", "CORS APIs", "developer patterns"],
    "type": "technical"
  },
  {
    "title": "DeepCode ArXiv paper presents fully autonomous AI coding framework",
    "description": "Researchers published 'DeepCode: Open Agentic Coding' on ArXiv, presenting a fully autonomous framework for document-to-codebase synthesis that optimizes information flow. The system reportedly achieved 73.5% replication success rate and became the first Code Agent to outperform Machine Learning PhD experts from top universities including Berkeley, Cambridge, Carnegie Mellon, Columbia, Cornell, and Purdue. The open-source framework is designed to transform research papers and technical documents into production-ready code.",
    "author": "Zongwei Li, Zhonghang Li, Zirui Guo, Xubin Ren, Chao Huang",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2512.07921",
    "published_date": "2025-12-07",
    "topics": ["autonomous coding", "document-to-code synthesis", "AI agents", "DeepCode", "arXiv"],
    "type": "technical"
  },
  {
    "title": "JetBrains launches Agent Client Protocol (ACP) for open AI agent ecosystem",
    "description": "JetBrains announced the Agent Client Protocol (ACP), a standardized communication protocol between IDEs and coding agents, similar to how LSP works for language servers. Released in beta in version 25.3, ACP allows developers to use any ACP-compatible agent in JetBrains IDEs. The protocol was developed in collaboration with Zed to avoid competing standards. Partners including Augment Code, Block's goose, Zed, and Moonshot AI's Kimi CLI already support ACP. Future plans include agent distribution registry, remote server support, and MCP toolchain integration.",
    "author": "Sergey Ignatov",
    "source": "Company Blog",
    "url": "https://blog.jetbrains.com/ai/2025/12/bring-your-own-ai-agent-to-jetbrains-ides/",
    "published_date": "2025-12-05",
    "topics": ["Agent Client Protocol", "ACP", "AI agents", "IDE integration", "open standards", "JetBrains", "Zed"],
    "type": "technical"
  }
]