[
  {
    "name": "Cursor Visual Editor",
    "url": "https://cursor.com/blog/browser-visual-editor",
    "description": "A visual editor for Cursor Browser that enables drag-and-drop UI editing of web applications, bridging the gap between design tools and coding with AI-powered inspect-and-edit capabilities.",
    "release_date": "2025-12-12",
    "category": "AI IDE",
    "sources": ["Product Hunt", "WIRED", "Techmeme"],
    "community_quotes": [
      "Launch of the Day on Product Hunt for December 12, 2025",
      "Featured in major tech publications including WIRED",
      "Transforms Cursor into a web design tool with Figma-like interface"
    ]
  },
  {
    "name": "Mistral Vibe CLI",
    "url": "https://mistral.ai/news/devstral-2-vibe-cli",
    "description": "A terminal-based AI coding agent launched by Mistral AI that brings AI capabilities directly to the command line for agentic coding tasks and natural language automation within development environments.",
    "release_date": "2025-12-09",
    "category": "AI coding CLI",
    "sources": ["TechCrunch", "Hacker News", "Reddit", "Mistral AI Official"],
    "community_quotes": [
      "Mistral's entry into the 'vibe coding' trend with open-source CLI tool",
      "Significant discussion on Reddit's r/LocalLLaMA with 683 votes",
      "Positioned to compete with other coding AI solutions while maintaining open-source commitment"
    ]
  },
  {
    "name": "Taskade Genesis",
    "url": "https://www.taskade.com/blog/taskade-genesis-live-ai-apps",
    "description": "An AI app generator that creates live applications from a single prompt, featuring projects with persistent memory and AI agents that remember information across sessions.",
    "release_date": "2025-12-01",
    "category": "workflow agent",
    "sources": ["Product Hunt", "Taskade Official"],
    "community_quotes": [
      "Featured as Product Hunt launch in December 2025",
      "Builds living workspaces with persistent memory across sessions",
      "One prompt creates complete applications with AI agents that can think and act"
    ]
  }
]