[
  {
    "name": "GitHub Copilot Agent Skills",
    "url": "https://github.blog/changelog/2025-12-18-github-copilot-now-supports-agent-skills/",
    "description": "A new feature for GitHub Copilot that allows developers to create custom agent capabilities and skills. Agent Skills enables more customized and powerful agent-based workflows within the Copilot ecosystem, integrating with VS Code and supporting multi-agent orchestration for AI-assisted development tasks.",
    "release_date": "2025-12-18",
    "category": "AI coding tools for existing IDEs",
    "sources": ["GitHub Blog", "VS Code Release Notes"],
    "community_quotes": [
      "Agent Skills has been officially integrated into VS Code",
      "This launch is part of GitHub's broader push into agent-based capabilities",
      "Represents a significant milestone in GitHub's AI-powered development tools"
    ]
  },
  {
    "name": "cto bench",
    "url": "https://cto.new/bench",
    "description": "A ground truth code agent benchmark that measures AI coding agent performance. The benchmark tracks merged code as a percentage of completed tasks and reports a 4-day rolling success rate with a 1-day lag for task resolution.",
    "release_date": "2025-12-20",
    "category": "code agent benchmark",
    "sources": ["Product Hunt", "Hunted Space"],
    "community_quotes": [
      "The ground truth code agent benchmark",
      "Part of cto.new ecosystem - a completely free AI code agent",
      "Launched with 134 upvotes on Product Hunt"
    ]
  },
  {
    "name": "Netlify AI Gateway",
    "url": "https://docs.netlify.com/build/ai-gateway/overview/",
    "description": "A developer tool that simplifies using AI inference in code by eliminating the need to manage API keys or create accounts with AI providers. Provides access to 30+ AI models with unified monitoring of usage and costs.",
    "release_date": "2025-12-18",
    "category": "AI workflow orchestration agent",
    "sources": ["Netlify Press Release", "Netlify Documentation"],
    "community_quotes": [
      "Lets any agent or developer add AI features without managing API keys",
      "Switch between 30+ different AI models",
      "Track usage and costs across different AI providers in one place"
    ]
  }
]
