[
  {
    "productName": "Cursor",
    "title": "December Stability Updates",
    "description": "Cursor rolled out updates in December 2025 with emphasis on #Stability improvements for holiday coding. The updates were being slowly rolled out over the week to ensure no regressions during the holiday period.",
    "updateType": "bugfix",
    "url": "https://cursor.com/changelog",
    "date": "2025-12-22",
    "community_feedback": []
  },
  {
    "productName": "Gemini CLI",
    "title": "Gemini 3 Flash Availability",
    "description": "Gemini CLI announced Gemini 3 Flash availability and opened waitlist for Gemini 3 Pro. The latest version 18.0 (released November 17) includes experimental permission improvements with a new policy engine for enhanced user and administrator controls. Gemini 3 Flash claims 78% SWE-bench Verified score for agentic coding.",
    "updateType": "feature",
    "url": "https://geminicli.com/docs/changelogs/",
    "date": "2025-12-17",
    "community_feedback": [
      {
        "quote": "Gemini 3 is not as good as everyone is saying... ChatGPT is significantly better",
        "source": "Reddit",
        "sentiment": "negative"
      },
      {
        "quote": "Users were cautious in their early reactions, discussion centered on published benchmark scores",
        "source": "AINativeDev",
        "sentiment": "neutral"
      },
      {
        "quote": "Gemini 3 Flash is better, faster and cheaper than 2.5 Pro",
        "source": "GitHub Discussion",
        "sentiment": "positive"
      }
    ]
  },
  {
    "productName": "GitHub Copilot",
    "title": "GPT-5.2 Model and Enhanced Collaboration Features",
    "description": "GitHub Copilot added OpenAI's newest GPT-5.2 model with long context capabilities and front-end UI generation, available to Pro, Pro+, Business, and Enterprise tiers. New sharing features for Copilot Spaces enhanced collaboration. Visual Studio Copilot received updates including SymbolAware Multi-File Editing for C++ development in Visual Studio 2026 Insiders. Public preview access expanded for new model options.",
    "updateType": "feature",
    "url": "https://visualstudiomagazine.com/articles/2025/12/09/github-ships-early-december-copilot-updates-across-spaces-visual-studio-and-model-options.aspx",
    "date": "2025-12-09",
    "community_feedback": [
      {
        "quote": "GPT 5.2 is CRUSHING opus??? Follows instructions more closely, hallucinates less, understands requests in human terms much better",
        "source": "Reddit",
        "sentiment": "positive"
      },
      {
        "quote": "Why does GPT-5.2 stop so much? Had to prompt 'continue' 10 times for a single request",
        "source": "Reddit",
        "sentiment": "negative"
      },
      {
        "quote": "ChatGPT 5.2 eating my premium request without doing anything",
        "source": "Reddit",
        "sentiment": "negative"
      },
      {
        "quote": "Happened on my first try as expected (GPT models sucks in Copilot)",
        "source": "Reddit",
        "sentiment": "negative"
      }
    ]
  },
  {
    "productName": "Devin",
    "title": "Custom Slash Commands and API v3 Updates",
    "description": "Devin released Custom Slash Commands feature allowing users to create custom commands. API v3 updates added enterprise and organization-level Notes and Playbooks routers. Various performance improvements and minor bug fixes were included.",
    "updateType": "feature",
    "url": "https://docs.devin.ai/release-notes/overview",
    "date": "2025-12-12",
    "community_feedback": []
  },
  {
    "productName": "Claude Code",
    "title": "Version 2.0.x with LSP Support and Async Sub Agents",
    "description": "Claude Code released version 2.0.x (v2.0.74 as of December 2025) with major new features including LSP (Language Server Protocol) support for real-time diagnostics and go-to definitions, prompt suggestions with Tab accept, async sub agents for concurrent operations, background agents, and Opus 4.5 integration. UI/UX improvements include reduced terminal flickering and loading indicators. Holiday special (Dec 25-31) doubled usage limits.",
    "updateType": "feature",
    "url": "https://www.geeky-gadgets.com/claude-code-update-dec-2025/",
    "date": "2025-12-01",
    "community_feedback": [
      {
        "quote": "Disable auto-updates and stay a few updates behind unless you REALLY need a new bug fix",
        "source": "Reddit",
        "sentiment": "neutral"
      },
      {
        "quote": "This LSP support is a good start but without the mutation functions it is still pretty lackluster. Plus LSPs aren't as good as JetBrains...",
        "source": "Hacker News",
        "sentiment": "neutral"
      },
      {
        "quote": "I'm using it to make a huge difference in my coding workflow",
        "source": "Medium",
        "sentiment": "positive"
      },
      {
        "quote": "LSP support in Claude Code is pretty raw still - Bugs in different LSP operations, no documentation, no UI indication that LSP is working",
        "source": "GitHub",
        "sentiment": "negative"
      }
    ]
  }
]