[
  {
    "name": "GitHub Agentic Workflows",
    "url": "https://github.blog/changelog/2026-02-13-github-agentic-workflows-are-now-in-technical-preview/",
    "description": "Technical preview feature automating repository tasks using AI agents within GitHub Actions. Write workflows in plain Markdown instead of YAML, and let AI handle issue triage, pull request reviews, CI failure analysis, and repository maintenance. Works with GitHub Copilot CLI or other coding agents.",
    "release_date": "2026-02-13",
    "category": "workflow orchestration",
    "sources": ["GitHub Blog"],
    "community_quotes": [
      "Write workflows in plain Markdown instead of complex YAML",
      "Security-first design with read-only by default and sandboxed execution",
      "Works with multiple coding agents - same workflow format across all engines"
    ]
  },
  {
    "name": "Klaw.sh",
    "url": "https://github.com/klawsh",
    "description": "Kubernetes-like system specifically designed for orchestrating AI agents and workflows. Provides fleet management for AI agents with clusters, namespaces, and declarative deploys. Standalone binary with zero dependencies.",
    "release_date": "2026-02-08",
    "category": "workflow orchestration",
    "sources": ["Show HN", "GitHub"],
    "community_quotes": [
      "Giving an LLM a computer makes it way more powerful, giving it a kubernetes cluster should extend that power much further",
      "This abstraction can scale for a good long while",
      "Standalone binary, zero dependencies - same mental model as k8s without the infrastructure overhead",
      "Fleet ops for agents - k8s solved deploy/observe/isolate for containers, you're mapping that to agent workers"
    ]
  },
  {
    "name": "Inspector",
    "url": "https://www.producthunt.com/products/inspector-3",
    "description": "Visual editor for Claude Code, positioned as 'Figma for Claude Code'. Provides a graphical interface for working with Claude Code's AI coding capabilities.",
    "release_date": "2026-02-05",
    "category": "IDE extension",
    "sources": ["Product Hunt"],
    "community_quotes": []
  }
]
