[
  {
    "name": "Mistral Vibe 2.0",
    "url": "https://mistral.ai/products/vibe",
    "description": "A major upgrade to Mistral's terminal-native AI coding agent, powered by the Devstral 2 model family. Features custom subagents, multi-choice clarifications, slash-command skills, and unified agent modes. Moves from open-source to paid Le Chat Pro/Team plans.",
    "release_date": "2026-01-27",
    "category": "AI coding CLI",
    "sources": ["Mistral AI", "AI Business", "VentureBeat"],
    "community_quotes": [
      "European challenger to GitHub Copilot",
      "Terminal-native coding agent for 'vibe coding'"
    ]
  },
  {
    "name": "Ai2 Open Coding Agents (SERA)",
    "url": "https://allenai.org/blog/open-coding-agents",
    "description": "Open-source family of AI developer agents from Allen Institute for AI, starting with SERA (Soft-Verified Efficient Repository Agents). Designed to adapt to any codebase with 11x lower training costs. Released with full source code, 200,000 synthetic trajectories, and tools for customization.",
    "release_date": "2026-01-27",
    "category": "Open-source AI coding agent",
    "sources": ["Ai2", "SiliconANGLE", "The New Stack"],
    "community_quotes": [
      "Fast, accessible coding agents that adapt to any repository",
      "Cuts training costs by up to 11 times",
      "Targets SMEs and independent developers"
    ]
  },
  {
    "name": "Kilo Code Reviewer",
    "url": "https://www.producthunt.com/products/kilocode",
    "description": "Open-source AI code review agent for JetBrains IDEs that achieved #1 Product of the Day on Product Hunt with 658 upvotes. Automatically activates when opening Pull Requests to provide AI-powered code reviews. Completely free with MiniMax M2.1 model.",
    "release_date": "2026-01-27",
    "category": "IDE-integrated AI tool",
    "sources": ["Product Hunt", "Kilo AI Blog"],
    "community_quotes": [
      "#1 Product of the Day on Product Hunt",
      "Replaced tools like Cursor, Cline, and Continue for many users",
      "Surprisingly data aware, not just code aware",
      "Fewer retries and better control over rules, memory, and cost"
    ]
  },
  {
    "name": "Kimi Code",
    "url": "https://www.kimi.com/en",
    "description": "Open-source CLI coding agent launched by China's Moonshot AI alongside the Kimi K2.5 model. A terminal-based AI coding tool positioned as a rival to Claude Code and Gemini CLI, with support for VSCode, Cursor, and Zed integration.",
    "release_date": "2026-01-27",
    "category": "AI coding CLI",
    "sources": ["TechCrunch", "GitHub"],
    "community_quotes": [
      "Open-source alternative to Claude Code and Gemini CLI",
      "Can spawn up to 100 AI agents for coordinated work"
    ]
  },
  {
    "name": "OpenAI Prism",
    "url": "https://openai.com/index/introducing-prism/",
    "description": "A free AI workspace for scientific writing and coding launched by OpenAI. LaTeX-native workspace integrated with ChatGPT and powered by GPT-5.2, designed specifically for researchers and scientists to 'vibe code' scientific work.",
    "release_date": "2026-01-27",
    "category": "AI coding workspace",
    "sources": ["OpenAI", "TechCrunch", "MIT Technology Review"],
    "community_quotes": [
      "Lets you vibe code science",
      "Free for anyone with a ChatGPT account"
    ]
  },
  {
    "name": "yolo-cage",
    "url": "https://github.com/borenstein/yolo-cage",
    "description": "Security-focused AI coding agent framework featured on Show HN. Prevents AI agents from exfiltrating secrets or merging their own PRs without human approval. Kubernetes-based autonomous coding with branch isolation and secret scanning. Notably, the AI wrote its own containment system.",
    "release_date": "2026-01-21",
    "category": "Open-source AI coding agent",
    "sources": ["GitHub", "Hacker News Show HN"],
    "community_quotes": [
      "The AI wrote its own containment system from inside the system's own prototype",
      "Defense in depth - even if the cage code is AI-written and imperfect, it still creates a barrier",
      "When sandboxed correctly, this mode is actually safer than conventional approaches"
    ]
  }
]