[
  {
    "title": "What's next for AI in 2026",
    "description": "Five predictions for 2026: (1) More Silicon Valley products built on Chinese LLMs like DeepSeek R1 and Qwen, (2) US regulatory tug-of-war as Trump's executive order challenges state AI laws, (3) Chatbots transforming shopping with agentic commerce ($263B in holiday purchases), (4) LLMs making important new discoveries using AlphaEvolve-style approaches, (5) Legal fights heating up around AI liability including teen suicide cases and defamation.",
    "author": "MIT Technology Review",
    "source": "TechMedia",
    "url": "https://www.technologyreview.com/2026/01/05/1130662/whats-next-for-ai-in-2026/",
    "published_date": "2026-01-05",
    "topics": ["Chinese AI", "regulation", "agentic commerce", "AI research", "legal battles", "LLM applications"],
    "type": "opinion"
  },
  {
    "title": "My LLM coding workflow going into 2026",
    "description": "Addy Osmani's comprehensive guide to AI-assisted engineering: Start with specs and planning, break work into small iterative chunks, provide extensive context and guidance, choose the right model for each task, leverage AI across SDLC with tools like Claude Code and Jules, always verify/test/review AI output, commit frequently as safety net, customize AI behavior with rules and examples, embrace testing and CI/CD as force multipliers, and continuously learn while using AI. Mentions ~90% of Claude Code's own code is written by Claude Code.",
    "author": "Addy Osmani",
    "source": "Blog",
    "url": "https://addyosmani.com/blog/ai-coding-workflow/",
    "published_date": "2026-01-04",
    "topics": ["AI coding", "workflow", "best practices", "Claude Code", "testing", "software engineering"],
    "type": "technical"
  },
  {
    "title": "2025: The year in LLMs",
    "description": "Comprehensive annual review covering: reasoning models (RLVR), agents emergence, Claude Code's $1bn run-rate, Chinese open-weight models dominating (GLM-4.7, Kimi K2), vibe coding phenomenon, MCP protocol, 'the lethal trifecta' security concept, programming on mobile phones, local vs cloud models, conformance suites, AI data center opposition, and slop as Merriam-Webster's word of the year.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/31/the-year-in-llms/",
    "published_date": "2025-12-31",
    "topics": ["LLMs", "reasoning models", "agents", "coding agents", "Claude Code", "Chinese AI models", "vibe coding", "security", "MCP", "open-weight models"],
    "type": "technical"
  },
  {
    "title": "The Age of the All-Access AI Agent Is Here",
    "description": "Wired explores how AI agents require deep access to personal data (emails, calendar, files) to function, raising privacy concerns. Harry Farmer warns of 'profound threat' to cybersecurity and privacy. Companies like Tinder scanning photos and Microsoft Recall taking screenshots exemplify the data grab. Meredith Whittaker calls OS-level agents an 'existential threat' to app-level privacy. Prompt injection attacks could leak sensitive data.",
    "author": "Matt Burgess",
    "source": "TechMedia",
    "url": "https://www.wired.com/story/expired-tired-wired-all-access-ai-agents/",
    "published_date": "2025-12-24",
    "topics": ["AI agents", "privacy", "security", "data access", "prompt injection", "OS integration"],
    "type": "opinion"
  },
  {
    "title": "The great AI hype correction of 2025",
    "description": "MIT Technology Review's analysis of 2025's disillusionment: GPT-5 launch disappointed expectations, LLMs aren't AGI, 95% of businesses found zero value in bespoke AI (but 90% had shadow AI usage by employees). Ilya Sutskever notes LLMs don't learn principles behind tasks. Andrej Karpathy observes chatbots better than average humans but not experts. Progress continues but hype is correcting.",
    "author": "MIT Technology Review",
    "source": "TechMedia",
    "url": "https://www.technologyreview.com/2025/12/15/1129174/the-great-ai-hype-correction-of-2025/",
    "published_date": "2025-12-15",
    "topics": ["AI hype", "GPT-5", "LLM limitations", "business adoption", "AGI", "expectations"],
    "type": "opinion"
  }
]
