[
  {
    "title": "The distance between a question and a first answer just got very small",
    "description": "Dimitris Papailiopoulos on running research questions through Claude Code: 'I now have something close to a magic box where I throw in a question and a first answer comes back basically for free, in terms of human effort.' The quick signal step - finding out if a question has any meat to it - can now be done without taking up anyone else's time. It's now between just me, Claude Code, and a few days of GPU time.",
    "author": "Dimitris Papailiopoulos (quoted by Simon Willison)",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/17/research/",
    "published_date": "2026-02-17",
    "topics": [
      "research",
      "ai",
      "generative-ai",
      "llms",
      "coding-agents",
      "claude-code"
    ],
    "type": "opinion"
  },
  {
    "title": "Reducing cognitive debt with LLM-generated explanations",
    "description": "Nathan Baschez shares a trick for reducing 'cognitive debt': ask the LLM to write two versions of the plan - 1) The version for it (highly technical and detailed) and 2) The version for me (an entertaining essay designed to build my intuition). Simon Willison tested this by creating a webcomic explaining his Showboat project's new feature using Nano Banana Pro.",
    "author": "Nathan Baschez (quoted by Simon Willison)",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/17/cognitive-debt/",
    "published_date": "2026-02-17",
    "topics": [
      "nano-banana",
      "gemini",
      "llms",
      "cognitive-debt",
      "generative-ai",
      "ai",
      "text-to-image",
      "showboat",
      "ai-assisted-programming"
    ],
    "type": "tutorial"
  },
  {
    "title": "Qwen3.5: Towards Native Multimodal Agents",
    "description": "Alibaba's Qwen released the first two models in the Qwen 3.5 series - Qwen3.5-397B-A17B (open weights, Mixture of Experts) and Qwen3.5 Plus 2026-02-15 (proprietary, 1M token context). The MoE model has 397B total parameters but activates only 17B per forward pass for efficiency. Both support vision input natively.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/17/qwen3.5/",
    "published_date": "2026-02-17",
    "topics": [
      "ai",
      "generative-ai",
      "llms",
      "vision-llms",
      "qwen",
      "llm-release",
      "openrouter",
      "ai-in-china"
    ],
    "type": "technical"
  },
  {
    "title": "Showboat project: Two new tools - Chartroom and datasette-showboat",
    "description": "Simon Willison introduced Showboat, a CLI tool that helps coding agents create Markdown documents demonstrating their code. Two new tools were released: Chartroom (CLI charting tool) and datasette-showboat (incrementally pushes documents to a Datasette instance). These tools help with the key challenge of having coding agents both test and demonstrate what they've built.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/17/showboat/",
    "published_date": "2026-02-17",
    "topics": [
      "charting",
      "projects",
      "ai",
      "datasette",
      "generative-ai",
      "llms",
      "ai-assisted-programming",
      "coding-agents",
      "claude-code",
      "showboat"
    ],
    "type": "technical"
  },
  {
    "title": "Claude Code Desktop App shows images being analyzed",
    "description": "Simon Willison appreciates that the Claude Code desktop app lets you see images that Claude is 'viewing' via its Read tool, providing visual preview of what it's working on without waiting for code to be pushed to GitHub. He uses Rodney (a tool designed with --help output for coding agents) to manually test pages and view screenshots.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/16/claude-desktop/",
    "published_date": "2026-02-16",
    "topics": [
      "anthropic",
      "claude",
      "ai",
      "claude-code",
      "llms",
      "async-coding-agents",
      "coding-agents",
      "generative-ai",
      "projects",
      "ai-assisted-programming"
    ],
    "type": "opinion"
  },
  {
    "title": "The AI Vampire: Agent fatigue and burnout",
    "description": "Steve Yegge's take on agent fatigue: If you're the only person at your company using AI and work at 10x productivity, your employer captures 100% of the value and you get nothing but exhaustion. Yegge reports needing more sleep due to the cognitive burden of agentic engineering, noting that four hours of agent work a day is a more realistic pace.",
    "author": "Steve Yegge (quoted by Simon Willison)",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/15/ai-vampire/",
    "published_date": "2026-02-15",
    "topics": [
      "steve-yegge",
      "ai",
      "generative-ai",
      "llms",
      "ai-assisted-programming",
      "ai-ethics",
      "coding-agents",
      "cognitive-debt"
    ],
    "type": "opinion"
  },
  {
    "title": "Deep Blue: Psychological ennui from generative AI encroachment",
    "description": "Simon Willison and Adam Leventhal coined 'Deep Blue' - the sense of psychological ennui leading into existential dread that many software developers are feeling thanks to the encroachment of generative AI into their field of work.",
    "author": "Simon Willison, Adam Leventhal",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/15/deep-blue/",
    "published_date": "2026-02-15",
    "topics": [
      "definitions",
      "careers",
      "ai",
      "generative-ai",
      "llms",
      "ai-assisted-programming",
      "oxide",
      "bryan-cantrill",
      "ai-ethics",
      "coding-agents"
    ],
    "type": "discussion"
  },
  {
    "title": "Gwtar: Static efficient single-file HTML format",
    "description": "Gwern Branwen and Said Achmiz released Gwtar, a new project combining large numbers of assets into a single archived HTML file. Key trick: fires window.stop() early to prevent downloading the whole thing, then uses inline tar with HTTP range requests to fetch content on-demand. JavaScript rewrites asset URLs to https://localhost/ and uses PerformanceObserver to catch attempted loads.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/15/gwtar/",
    "published_date": "2026-02-15",
    "topics": [
      "archiving",
      "html",
      "javascript"
    ],
    "type": "technical"
  },
  {
    "title": "OpenClaw: 10,000 commits in less than 3 months",
    "description": "OpenClaw hit 10,000 commits from 600 contributors, 196,000 GitHub stars, and was featured in a Super Bowl commercial for AI.com. AI.com founder Kris Marszalek called it 'the world's first easy-to-use and secure implementation of OpenClaw.' OpenClaw creator Peter Steinberger announced he's joining OpenAI and plans to transfer ownership to a new independent foundation.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/15/openclaw/",
    "published_date": "2026-02-15",
    "topics": [
      "ai-agents",
      "openclaw",
      "ai",
      "open-source",
      "domains",
      "openai",
      "peter-steinberger"
    ],
    "type": "discussion"
  },
  {
    "title": "How Generative and Agentic AI Shift Concern from Technical Debt to Cognitive Debt",
    "description": "Margaret-Anne Storey's explanation of cognitive debt: the debt compounded from going fast lives in the brains of the developers and affects their lived experiences. Even if AI agents produce clean code, humans may have lost the plot and may not understand what the program is supposed to do or how to change it. Simon has experienced this on vibe-code projects where he no longer has a firm mental model.",
    "author": "Margaret-Anne Storey (quoted by Simon Willison)",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/15/cognitive-debt-storey/",
    "published_date": "2026-02-15",
    "topics": [
      "definitions",
      "ai",
      "generative-ai",
      "llms",
      "ai-assisted-programming",
      "vibe-coding",
      "cognitive-debt"
    ],
    "type": "opinion"
  },
  {
    "title": "Launching Interop 2026",
    "description": "Jake Archibald reports on Interop 2026, the initiative between Apple, Google, Igalia, Microsoft, and Mozilla to collaborate on ensuring web platform features reach cross-browser parity. Simon is most excited about Cross-document View Transitions (fancy SPA-style transitions between pages with no JavaScript) and JavaScript Promise Integration for Wasm.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/15/interop-2026/",
    "published_date": "2026-02-15",
    "topics": [
      "browsers",
      "css",
      "javascript",
      "web-standards",
      "webassembly",
      "jake-archibald"
    ],
    "type": "technical"
  },
  {
    "title": "Elon Musk Predicts AI Will Write Binary Code Directly by Late 2026",
    "description": "Elon Musk predicted that by late 2026, AI would skip traditional programming languages entirely and generate binary files directly. This provocative statement suggests a future where human-readable programming languages become obsolete, with AI operating at the machine code level. The prediction sparked debate about the future of software development and whether abstraction layers would disappear.",
    "author": "Elon Musk",
    "source": "TechMedia",
    "url": "https://m.itbear.com.cn/html/2026-02/1156900.html",
    "published_date": "2026-02-15",
    "topics": [
      "elon-musk",
      "ai-coding",
      "binary-code",
      "future-of-programming",
      "controversy",
      "prediction"
    ],
    "type": "opinion"
  },
  {
    "title": "Boris Cherny on why Anthropic are still hiring developers",
    "description": "Boris Cherny, Claude Code creator: 'Someone has to prompt the Claudes, talk to customers, coordinate with other teams, decide what to build next. Engineering is changing and great engineers are more important than ever.'",
    "author": "Boris Cherny (quoted by Simon Willison)",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/14/cherny-hiring/",
    "published_date": "2026-02-14",
    "topics": [
      "careers",
      "ai",
      "generative-ai",
      "llms",
      "ai-assisted-programming",
      "anthropic",
      "coding-agents",
      "claude-code"
    ],
    "type": "opinion"
  },
  {
    "title": "Thoughtworks findings: Junior developers more profitable than ever with AI",
    "description": "Thoughtworks retreat findings under Chatham House rules: AI tools get junior developers past the awkward initial net-negative phase faster. They serve as a call option on future productivity and are better at AI tools than senior engineers. The real concern is mid-level engineers who may not have developed the fundamentals needed to thrive in the new environment.",
    "author": "Thoughtworks (quoted by Simon Willison)",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/14/thoughtworks-retreat/",
    "published_date": "2026-02-14",
    "topics": [
      "careers",
      "ai",
      "ai-assisted-programming"
    ],
    "type": "opinion"
  },
  {
    "title": "Anthropic's mission statement evolution",
    "description": "Anthropic's Certificate of Incorporation from 2021 states: 'responsibly develop and maintain advanced AI for the cultural, social and technological improvement of humanity.' Subsequent documents up to 2024 use: 'responsibly develop and maintain advanced AI for the long term benefit of humanity.' Simon compared this to OpenAI's evolving mission statements.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/13/anthropic-mission/",
    "published_date": "2026-02-13",
    "topics": [
      "ai-ethics",
      "anthropic",
      "ai"
    ],
    "type": "technical"
  },
  {
    "title": "The evolution of OpenAI's mission statement",
    "description": "As a USA 501(c)(3), OpenAI files tax returns with the IRS each year requiring a mission description. Simon tracks how this has evolved over time, from early statements about 'beneficial AGM' to current formulations.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/13/openai-mission/",
    "published_date": "2026-02-13",
    "topics": [
      "ai",
      "openai",
      "ai-ethics",
      "propublica"
    ],
    "type": "technical"
  },
  {
    "title": "From Vibe Coding to Agentic Engineering: Karpathy's 2026 Paradigm Shift",
    "description": "Andrej Karpathy officially proposed 'Agentic Engineering' in February 2026 on the one-year anniversary of Vibe Coding. Key shift: from 'prompt AI line by line, trial-and-error' to 'launch agents with goals, context, and tools that plan, execute, debug, and test autonomously.' Karpathy notes that in 2026, people who can do Agentic Engineering are the scarce resource. Developers shift from 'coders' to 'architects' and 'agent commanders,' spending 99% of time coordinating and supervising agents rather than writing code directly.",
    "author": "Andrej Karpathy",
    "source": "TechMedia",
    "url": "https://juejin.cn/post/7604801893529419819",
    "published_date": "2026-02-12",
    "topics": [
      "vibe-coding",
      "agentic-engineering",
      "ai",
      "llms",
      "ai-coding",
      "developer-tools",
      "paradigm-shift"
    ],
    "type": "opinion"
  },
  {
    "title": "GLM-5 Release: Agentic Engineering in Action",
    "description": "Z.ai released GLM-5, positioning it as 'the best open-source model for the Agentic Engineering era.' Demonstrated capabilities: ran code for over 24 hours autonomously, made 700+ tool calls and 800+ context switches, successfully built a complete Game Boy emulator. Shows full 'write-code → run → error → fix → rerun' autonomous loop, exemplifying the shift from Vibe Coding to Agentic Engineering.",
    "author": "Z.ai (智谱)",
    "source": "TechMedia",
    "url": "https://new.qq.com/rain/a/20260212A06YZI00",
    "published_date": "2026-02-12",
    "topics": [
      "glm-5",
      "agentic-engineering",
      "ai-coding",
      "open-source",
      "llms",
      "ai-in-china",
      "autonomous-agents"
    ],
    "type": "technical"
  },
  {
    "title": "Xcode 26.3 Adds AI Agent Integration with MCP",
    "description": "Apple's Xcode 26.3 added support for programming intelligent agents using MCP (Model Context Protocol). The integration allows connections to Claude Agent, Codex, and other AI coding tools. However, Hacker News users reported bugs - the format returned doesn't match its declared Schema, causing compatibility issues with OpenCode. This reflects both the rapid integration of AI tools into mainstream IDEs and the growing pains of early adoption.",
    "author": "Apple, Hacker News Community",
    "source": "TechMedia",
    "url": "https://www.infoq.cn/article/39BuXj6WpGFqPERk4X9x",
    "published_date": "2026-02-12",
    "topics": [
      "apple",
      "xcode",
      "mcp",
      "ai-agents",
      "claude",
      "codex",
      "ide-integration",
      "bugs"
    ],
    "type": "technical"
  },
  {
    "title": "ArXiv: Infinity Synthetic Environments for Agentic Reinforcement Learning",
    "description": "Published February 9, 2026 - This paper introduces synthetic environments designed for agentic reinforcement learning research. The work addresses the need for scalable, diverse environments to train and evaluate AI agents that can operate autonomously over extended periods. Relevant to the development of more capable agentic coding systems.",
    "author": "Research Team",
    "source": "Paper",
    "url": "https://arxiv.org/html/2602.10090v1",
    "published_date": "2026-02-09",
    "topics": [
      "arxiv",
      "reinforcement-learning",
      "agentic-ai",
      "synthetic-environments",
      "ai-agents",
      "research"
    ],
    "type": "technical"
  },
  {
    "title": "Hacker News: AI Coding Agents Discussion - February 2026",
    "description": "Hacker News discussions in February 2026 reveal a shift from hype to skepticism about AI coding agents. Notable projects shared include a Bambu 3D printer client built with Opus 4.6 ($65 cost) and Prompter Hawk (task scheduling dashboard for AI agents with parallel session monitoring and cost analysis). Community sentiment reflects concerns about practicality and reliability, with one architect comparing AI agent use to 'being promoted to tech lead' - requiring careful requirements explanation and extremely careful result review.",
    "author": "Hacker News Community",
    "source": "HN",
    "url": "https://news.ycombinator.com/item?id=39845623",
    "published_date": "2026-02-08",
    "topics": [
      "hacker-news",
      "ai-coding",
      "claude-code",
      "opus",
      "community-sentiment",
      "skepticism",
      "best-practices"
    ],
    "type": "discussion"
  },
  {
    "title": "AI Explained: Claude Opus 4.6 vs New GPT Model - Simultaneous Release",
    "description": "AI Explained covers the simultaneous release of two major AI models: Claude Opus 4.6 by Anthropic and a new GPT model by OpenAI. The video compares their capabilities, performance benchmarks, and implications for the AI landscape. This dual release highlights the intensifying competition between major AI labs in early 2026.",
    "author": "AI Explained",
    "source": "YouTube",
    "url": "https://www.bilibili.com/video/BV1LnF1ziEny",
    "published_date": "2026-02-06",
    "topics": [
      "anthropic",
      "claude-opus",
      "openai",
      "gpt",
      "model-comparison",
      "ai-competition",
      "llm-release"
    ],
    "type": "technical"
  },
  {
    "title": "Lex Fridman Podcast #490: State of AI 2026",
    "description": "Lex Fridman's comprehensive AI 2026 overview featuring Sebastian Raschka and Nathan Lambert. Key topics: Vibe Coding paradigm shift where developers use natural language to describe requirements while AI rapidly generates code; China vs US AI competition (DeepSeek moment); LLM comparison (ChatGPT vs Claude vs Gemini vs Grok); AI scaling laws in 2026; Transformers evolution since 2019; realistic AGI timeline expectations.",
    "author": "Lex Fridman, Sebastian Raschka, Nathan Lambert",
    "source": "Podcast",
    "url": "https://www.bilibili.com/video/BV17dF3zyEY5",
    "published_date": "2026-02-01",
    "topics": [
      "ai",
      "llms",
      "vibe-coding",
      "scaling-laws",
      "agi",
      "china-us-competition",
      "anthropic",
      "openai",
      "google"
    ],
    "type": "discussion"
  },
  {
    "title": "AI Coding Agents Market: 2026 Predictions",
    "description": "Multiple industry predictions for 2026: Global AI Agent core market expected to exceed $18.7 billion; Chinese market projected to surpass 48 billion yuan; by end of 2026, 40% of enterprise software expected to have built-in AI agent capabilities. Industry shifting from 'explosion period' (2023-2025) to 'delivery period' for AI agents. Notable products: Claude Code (reports of 259 PRs with 497 commits in 30 days), Cursor, OpenCode, Amazon's Kiro (can code autonomously for multiple days), and Devin by Cognition.",
    "author": "Industry Analysts",
    "source": "TechMedia",
    "url": "https://m.toutiao.com/w/1857227001200651/",
    "published_date": "2026-02-01",
    "topics": [
      "ai-agents",
      "market-predictions",
      "claude-code",
      "cursor",
      "amazon-kiro",
      "devin",
      "enterprise-adoption"
    ],
    "type": "discussion"
  },
  {
    "title": "Moltbook: The First Social Network for AI Agents",
    "description": "Moltbook emerged as 'the first social network for AI Agents' - essentially 'Silicon-based life's Hacker News' where only AI agents can post, not humans. This novel platform represents an experiment in AI-to-AI communication and social structures, raising questions about autonomous AI communities and the emergence of 'digital societies' populated solely by AI agents.",
    "author": "Moltbook Team",
    "source": "TechMedia",
    "url": "https://moltbook.com",
    "published_date": "2026-02-01",
    "topics": [
      "moltbook",
      "ai-agents",
      "social-network",
      "ai-to-ai-communication",
      "digital-societies",
      "experiment"
    ],
    "type": "discussion"
  },
  {
    "title": "ArXiv: The Rise of AI Teammates in SE 3.0 - 60,000 GitHub Projects Study",
    "description": "Comprehensive February 2026 study testing over 60,000 GitHub projects analyzing AI coding agent efficiency and pass rates. The paper examines how autonomous coding agents are reshaping software engineering in the SE 3.0 era. Includes AIDev dataset available on GitHub at SAILResearch/AI_Teammates_in_SE3. Key finding: AI agents show efficiency gains but pass rates still lag behind human developers.",
    "author": "SAIL Research Team",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2507.15003v1",
    "published_date": "2026-02-01",
    "topics": [
      "arxiv",
      "ai-coding",
      "software-engineering",
      "benchmarking",
      "github-analysis",
      "se-3.0",
      "research"
    ],
    "type": "technical"
  },
  {
    "title": "Fireship: OpenClaw's Wild Rise - Open Source AI Assistant",
    "description": "Fireship covers OpenClaw (originally Moltbot/ClaudeBot), an open-source AI assistant that went viral on GitHub. The video explores how this tool gained massive popularity, its capabilities as a coding agent, and the broader trend of open-source AI development tools challenging proprietary solutions.",
    "author": "Fireship",
    "source": "YouTube",
    "url": "https://www.bilibili.com/video/BV1US6rBhEWx",
    "published_date": "2026-01-30",
    "topics": [
      "openclaw",
      "open-source",
      "ai-assistants",
      "github",
      "viral-projects",
      "ai-coding"
    ],
    "type": "technical"
  },
  {
    "title": "ABC-Bench: Benchmarking Agentic Backend Coding in Real-World Development",
    "description": "Published January 2026 (relevant to early February discussions) - ABC-Bench provides a benchmark for evaluating agentic coding systems in real-world backend development scenarios. The benchmark focuses on practical, production-relevant tasks rather than synthetic coding challenges, addressing the gap between agent benchmarks and actual software engineering needs.",
    "author": "Research Team",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2601.11077",
    "published_date": "2026-01-28",
    "topics": [
      "arxiv",
      "benchmarking",
      "agentic-coding",
      "backend-development",
      "real-world-tasks",
      "evaluation"
    ],
    "type": "technical"
  },
  {
    "title": "2026: Year of Long-Horizon Agents (Sequoia & LangChain)",
    "description": "Sequoia Capital in conversation with LangChain founder: 2026 is the year AI 'says goodbye to dialog boxes and enters the Long-Horizon Agents era.' Key insights: shift from 'Talkers' (chat-based AI) to 'Doers' (action-oriented agents); coding agents are the prototype for all AI workers and identified as the first major application of AGI; AI coding agents approaching human-level performance (GAIA benchmark scores reaching 91.69% vs human average of 92%); cost reductions of 280-420x for certain AI coding tasks compared to 14 months prior.",
    "author": "Sequoia Capital, LangChain Founder",
    "source": "TechMedia",
    "url": "https://www.36kr.com/p/3658280070390407",
    "published_date": "2026-01-27",
    "topics": [
      "long-horizon-agents",
      "agi",
      "ai-coding",
      "sequoia-capital",
      "langchain",
      "cost-reduction",
      "benchmarks"
    ],
    "type": "opinion"
  },
  {
    "title": "Fireship: The Unhinged World of Tech in 2026",
    "description": "Fireship's annual tech predictions for 2026 covering AI trends, developer job market impact, major IPOs, robotics advancement, wearable AI devices, AR/VR evolution, chip giants competition, nuclear power for data centers, quantum computing progress, and digital identity. Video highlights the accelerating pace of AI adoption in software development and its broader societal impacts.",
    "author": "Fireship",
    "source": "YouTube",
    "url": "https://www.bilibili.com/video/BV1dSrdBDEJn",
    "published_date": "2026-01-14",
    "topics": [
      "ai",
      "tech-predictions",
      "developer-tools",
      "robotics",
      "ar-vr",
      "quantum-computing",
      "2026-trends"
    ],
    "type": "discussion"
  }
]