[
  {
    "name": "OpenAI Codex App",
    "url": "https://openai.com/index/introducing-the-codex-app/",
    "description": "OpenAI's multi-agent AI coding desktop app for macOS with project-based context support. Acts as a command center for managing multiple AI agents in parallel for coding tasks with the new GPT-5.3-Codex model. Features include agentic coding capabilities, parallel agent workflows, and advanced project management.",
    "release_date": "2026-02-02",
    "category": "AI IDE",
    "sources": ["OpenAI Official", "Reuters", "TechCrunch", "Product Hunt"],
    "community_quotes": [
      "200,000 downloads on day one according to Sam Altman",
      "The most capable agentic coding model to date",
      "A powerful command center for building with agents"
    ]
  },
  {
    "name": "Snowflake Cortex Code",
    "url": "https://www.snowflake.com/en/news/press-releases/snowflake-unveils-cortex-code-an-ai-coding-agent-that-drastically-increases-productivity-by-understanding-your-enterprise-data-context/",
    "description": "An AI coding agent that understands enterprise data context and provides context-aware assistance for data teams. Integrated into Snowsight with governance and security workflows for ML workflows and data operations. Automates data engineering tasks and extends AI assistance beyond SQL generation.",
    "release_date": "2026-02-03",
    "category": "Workflow orchestration",
    "sources": ["Snowflake Press Release", "InfoWorld", "HPC Wire"],
    "community_quotes": [
      "Dramatically increases productivity for data teams",
      "Understanding enterprise data context",
      "Simplifies all data operations with secure, context-aware capabilities"
    ]
  },
  {
    "name": "GitHub Copilot Agent HQ & SDK",
    "url": "https://github.blog/news-insights/company-news/pick-your-agent-use-claude-and-codex-on-agent-hq/",
    "description": "GitHub launched Agent HQ allowing Copilot Pro+ and Enterprise users to run multiple coding agents (Claude, Codex) directly inside GitHub, VS Code, and GitHub Mobile. Also released Copilot SDK for building custom agentic workflows with programmatic access to Copilot CLI's engine.",
    "release_date": "2026-02-04",
    "category": "Workflow orchestration",
    "sources": ["GitHub Blog", "VS Code Blog", "InfoQ"],
    "community_quotes": [
      "Run multiple AI coding agents directly inside repository workflows",
      "Pick your agent - use Claude and Codex on Agent HQ",
      "VS Code becomes multi-agent command center for developers"
    ]
  },
  {
    "name": "VS Code Multi-Agent Development",
    "url": "https://code.visualstudio.com/blogs/2026/02/05/multi-agent-development",
    "description": "Visual Studio Code 1.109 positioned itself as a home for multi-agent development, enabling developers to work with multiple AI agents simultaneously within the IDE. Represents Microsoft's vision for multi-agent command center development with structured workflows for planning, implementation, review, and search.",
    "release_date": "2026-02-04",
    "category": "AI IDE integration",
    "sources": ["VS Code Blog", "Visual Studio Magazine", "InfoWorld"],
    "community_quotes": [
      "Your home for multi-agent development",
      "VS Code becomes multi-agent command center for developers"
    ]
  },
  {
    "name": "OpenCode",
    "url": "https://opencode.ai/",
    "description": "An open-source AI coding agent with a native terminal-based UI featuring multi-session support, compatibility with over 75 models, and flexible deployment options (CLI, desktop app, or IDE extension). Positioned as an open-source alternative to proprietary coding tools like Claude Code and GitHub Copilot.",
    "release_date": "2026-02-05",
    "category": "AI coding CLI",
    "sources": ["InfoQ", "DEV Community", "Official Website"],
    "community_quotes": [
      "Currently the top AI coding agent out there",
      "Native terminal-based UI for developers",
      "Open-source alternative to proprietary tools"
    ]
  },
  {
    "name": "BetterBugs MCP",
    "url": "https://www.producthunt.com/products/betterbugs-io",
    "description": "An AI debugging tool that provides full bug context across all development tools. Gives AI development tools including Cursor, VS Code, Windsurf, and Claude complete bug context for better debugging workflows. Integrates seamlessly with Jira and GitHub for collaborative debugging.",
    "release_date": "2026-02-06",
    "category": "Workflow-specific tool",
    "sources": ["Product Hunt", "Instagram"],
    "community_quotes": [
      "Full bug context across all your tools",
      "Gives AI dev tools complete bug context",
      "Reached #2 on Product Hunt leaderboard on launch day"
    ]
  },
  {
    "name": "Willow for Developers",
    "url": "https://willowvoice.com/developers",
    "description": "A voice dictation tool specifically built for Cursor & AI IDEs that allows developers to speak their prompts instead of typing them, reportedly 4x faster than typing. Enables coding at 200+ words per minute vs traditional typing at 40-80 WPM, with full IDE integration for auto-tagging files and handling technical jargon.",
    "release_date": "2026-02-11",
    "category": "AI IDE integration",
    "sources": ["Product Hunt", "LinkedIn", "YouTube"],
    "community_quotes": [
      "The fastest way to vibe code",
      "4x faster than typing prompts",
      "First dictation tool with full IDE integration"
    ]
  },
  {
    "name": "Devlop AI",
    "url": "https://devlop.ai/",
    "description": "An AI-powered IDE specifically designed for embedded systems that writes and flashes STM32 firmware directly to your board. Features hardware-aware code generation, optimized code for microcontrollers, integrated compilation and flashing functionality. Designed specifically for STM32 microcontroller development workflows.",
    "release_date": "2026-02-02",
    "category": "AI IDE",
    "sources": ["Product Hunt", "ProductDirs", "daily.dev"],
    "community_quotes": [
      "94 upvotes on launch day",
      "Writes and flashes STM32 firmware directly",
      "Hardware-aware AI code generation for embedded systems"
    ]
  }
]