[
  {
    "title": "Useful patterns for building HTML tools with LLMs",
    "description": "Simon Willison shares comprehensive patterns for building single-file HTML applications using LLMs. He has built over 150 HTML tools in the past two years, almost all written by LLMs, combining HTML, JavaScript, and CSS in a single file. Key patterns include avoiding React build steps, loading dependencies from CDNs, persisting state in URLs, using localStorage for secrets, collecting CORS-enabled APIs, and leveraging WebAssembly for expanded capabilities. The article demonstrates how LLMs can create sophisticated tools ranging from SVG renderers to OCR applications.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/10/html-tools/",
    "published_date": "2025-12-10",
    "topics": ["LLM-assisted development", "HTML tools", "WebAssembly", "CORS APIs", "JavaScript patterns"],
    "type": "tutorial"
  },
  {
    "title": "DeepMind's New Game AI Makes History",
    "description": "Two Minute Papers covers Google DeepMind's breakthrough AI that can play multiple modern 3D games simultaneously, rather than mastering just one game. This represents a significant advancement in general game-playing AI capabilities.",
    "author": "Two Minute Papers",
    "source": "YouTube",
    "url": "https://www.youtube.com/watch?v=-ZFH4oJzCdU",
    "published_date": "2025-12-12",
    "topics": ["DeepMind", "Game AI", "Multi-game learning", "Reinforcement learning"],
    "type": "technical"
  },
  {
    "title": "Code Agents: The Future of Agentic AI",
    "description": "Towards Data Science explores LLM agents that 'think' and act using Python code, focusing on generating and executing actual code rather than calling tools via JSON. This represents a shift toward more direct code-based AI agent architectures.",
    "author": "Towards Data Science",
    "source": "Technical Blog",
    "url": "https://towardsdatascience.com/code-agents-the-future-of-agentic-ai/",
    "published_date": "2025-05-26",
    "topics": ["Code agents", "LLM architectures", "Python execution", "AI agents"],
    "type": "technical"
  },
  {
    "title": "Rethinking Technology Stack Selection with AI Coding",
    "description": "ArXiv paper addressing the gap between LLM code generation results and actual requirements, analyzing LLMs as popular developer tools and their impact on technology stack selection processes.",
    "author": "ArXiv Research",
    "source": "Paper",
    "url": "https://arxiv.org/html/2509.11132",
    "published_date": "2025-09-14",
    "topics": ["Technology stack selection", "LLM code generation", "Developer tools"],
    "type": "research"
  },
  {
    "title": "A Developer's Guide to Building Scalable AI: Workflows vs Agents",
    "description": "Towards Data Science provides guidance on structured LLM pipelines with clear control flow, covering tool usage, context retrieval, model calling, and handling for scalable AI application development.",
    "author": "Towards Data Science",
    "source": "Technical Blog",
    "url": "https://towardsdatascience.com/a-developers-guide-to-building-scalable-ai-workflows-vs-agents/",
    "published_date": "2025-06-27",
    "topics": ["LLM workflows", "AI scalability", "Tool usage", "Context retrieval"],
    "type": "tutorial"
  }
]