[
  {
    "title": "AI coding is now everywhere. But not everyone is convinced.",
    "description": "MIT Technology Review reports that 65% of developers are using AI coding tools at least weekly according to Stack Overflow's 2025 Developer Survey. The article explores the widespread adoption of AI coding tools despite ongoing skepticism in the developer community. Despite billions invested in AI coding tools, many developers remain unconvinced about their effectiveness.",
    "author": "MIT Technology Review",
    "source": "Tech Media",
    "url": "https://www.technologyreview.com/2025/12/15/1128352/rise-of-ai-coding-developers-2026/",
    "published_date": "2025-12-15",
    "topics": ["AI coding tools", "Developer adoption", "Productivity", "Stack Overflow survey"],
    "type": "technical"
  },
  {
    "title": "The Download: introducing the AI Hype Correction package",
    "description": "MIT Technology Review discusses the 'great AI hype correction of 2025' and mentions widespread AI coding adoption despite billions in investment. The article highlights signs of market saturation and skepticism in the AI coding space, suggesting a shift from hype to more realistic expectations about AI development tools.",
    "author": "MIT Technology Review",
    "source": "Tech Media",
    "url": "https://www.technologyreview.com/2025/12/15/1129719/the-download-introducing-the-ai-hype-correction-package/",
    "published_date": "2025-12-15",
    "topics": ["AI hype cycle", "Market correction", "Investment trends", "Developer tools"],
    "type": "opinion"
  },
  {
    "title": "Stack Overflow users don't trust AI. They're using it anyway",
    "description": "The Verge podcast episode discusses AI coding adoption despite trust issues, referencing Stack Overflow's 2025 survey data. The conversation explores the paradox of developers widely adopting AI coding tools while maintaining skepticism about their reliability and effectiveness.",
    "author": "The Verge",
    "source": "Podcast",
    "url": "https://www.theverge.com/podcast/844073/stack-overflow-ceo-ai-coding-chatgpt-code-red-interview",
    "published_date": "2025-12-15",
    "topics": ["AI adoption", "Developer trust", "Stack Overflow", "Survey data"],
    "type": "discussion"
  },
  {
    "title": "Useful patterns for building HTML tools with LLMs",
    "description": "Simon Willison shares comprehensive patterns for building single-file HTML applications using LLMs. He has built over 150 HTML tools in the past two years, almost all written by LLMs, combining HTML, JavaScript, and CSS in a single file. Key patterns include avoiding React build steps, loading dependencies from CDNs, persisting state in URLs, using localStorage for secrets, collecting CORS-enabled APIs, and leveraging WebAssembly for expanded capabilities.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2025/Dec/10/html-tools/",
    "published_date": "2025-12-10",
    "topics": ["LLM-assisted development", "HTML tools", "WebAssembly", "CORS APIs", "JavaScript patterns"],
    "type": "tutorial"
  }
]