[
  {
    "title": "Introducing the Codex app: OpenAI's new macOS app with Skills and Automations",
    "description": "OpenAI released a new macOS app for their Codex coding agent built with Electron and Node.js. Key features include first-class support for Skills and Automations for running scheduled tasks. Automations track state in SQLite. OpenAI revealed that since GPT-5.2-Codex launch in mid-December, overall Codex usage has doubled, with over a million developers using Codex in the past month. Windows support 'coming very soon'. The app is available to free and Go plans for a limited time with doubled rate limits for paying users.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/2/codex-app/",
    "published_date": "2026-02-02",
    "topics": ["openai", "codex", "ai-agents", "coding-agents", "electron", "sqlite", "skills", "automations"],
    "type": "technical"
  },
  {
    "title": "A Social Network for A.I. Bots Only: Moltbook and OpenClaw coverage in NYT",
    "description": "Simon Willison quoted in New York Times piece by Cade Metz about OpenClaw and Moltbook, the AI bot-only social network. Key quote: 'Most of it is complete slop' - noting that bots coaxed each other into talking like machines in sci-fi novels, playing out training data scenarios. Simon found the Moltbots entertaining as evidence that AI agents have become significantly more powerful. The article included photos taken at Simon's home, including his laptop screen and chickens.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/2/moltbook-nyt/",
    "published_date": "2026-02-02",
    "topics": ["ai-agents", "openclaw", "moltbook", "new-york-times", "journalism", "ai-ethics"],
    "type": "opinion"
  },
  {
    "title": "TIL: Running OpenClaw in Docker",
    "description": "Technical notes on running OpenClaw using Docker on Mac, covering Docker Compose configuration, administrative commands, setting up a Telegram bot, accessing the web UI, and running commands as root. Includes screenshot of the OpenClaw Gateway Dashboard web interface showing the chat interface and available tools (File & workspace, Shell/processes, Web, UI/rendering, Devices/nodes).",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/1/openclaw-docker/",
    "published_date": "2026-02-01",
    "topics": ["openclaw", "docker", "ai-agents", "til", "technical-setup"],
    "type": "tutorial"
  },
  {
    "title": "Andrej Karpathy: 600X cost reduction in training GPT-2 grade models over 7 years",
    "description": "Andrej Karpathy reported that nanochat can now reach a higher CORE score than GPT-2 in 3.04 hours (~$73) on a single 8XH100 node. Compared to GPT-2's original training cost of ~$43K in 2019 (32 TPU v3 chips for 168 hours at $8/hour), this represents a 600X cost reduction over 7 years, meaning the cost to train GPT-2 is falling approximately 2.5X every year.",
    "author": "Andrej Karpathy",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Jan/31/gpt-2-cost-reduction/",
    "published_date": "2026-01-31",
    "topics": ["training-costs", "llms", "gpt-2", "nanochat", "andrej-karpathy", "cost-reduction"],
    "type": "technical"
  },
  {
    "title": "Scientific production in the era of Large Language Models (arXiv:2601.13187)",
    "description": "Paper examining how scientific research production is being transformed by large language models, covering implications for research methodology, peer review, and scientific discovery in the AI era. Published January 2026.",
    "author": "K. Kusumegi et al.",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2601.13187",
    "published_date": "2026-01-31",
    "topics": ["llms", "scientific-research", "research-methodology", "arxiv", "ai-impact"],
    "type": "technical"
  },
  {
    "title": "Steve Yegge: Beads CLI designed for agents - 'making their hallucinations real'",
    "description": "Steve Yegge on Beads: 'Getting agents using Beads requires much less prompting, because Beads now has 4 months of Desire Paths design. Beads has evolved a very complex command-line interface, with 100+ subcommands, each with many sub-subcommands, aliases, alternate syntaxes. The complicated Beads CLI isn't for humans; it's for agents. What I did was make their hallucinations real, over and over, by implementing whatever I saw the agents trying to do with Beads, until nearly every guess by an agent is now correct.'",
    "author": "Steve Yegge (via Simon Willison)",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Jan/30/beads-cli/",
    "published_date": "2026-01-30",
    "topics": ["coding-agents", "cli-design", "steve-yegge", "agent-tools", "hallucinations", "desire-paths"],
    "type": "opinion"
  },
  {
    "title": "Moltbook is the most interesting place on the internet right now",
    "description": "OpenClaw (formerly Clawdbot/Moltbot) is a two-month-old open source digital personal assistant with over 114,000 GitHub stars. Simon explores the ecosystem, noting it's the hottest AI project despite setup friction. Discusses Tailscale integration, prompt injection concerns, and the 'skills' pattern. Notes parallels with Claude Code and how both are general agent harnesses disguised as programming tools.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Jan/30/moltbook/",
    "published_date": "2026-01-30",
    "topics": ["openclaw", "moltbook", "ai-agents", "tailscale", "prompt-injection", "skills", "peter-steinberger"],
    "type": "opinion"
  },
  {
    "title": "Test-Time Intervention for Efficient Deep Reasoning (arXiv:2601.11252)",
    "description": "Research on test-time intervention techniques to improve efficiency in deep reasoning models. Explores methods to optimize reasoning performance at inference time without extensive retraining. Published January 2026.",
    "author": "Various",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2601.11252",
    "published_date": "2026-01-30",
    "topics": ["llms", "reasoning", "efficiency", "inference", "arxiv", "research"],
    "type": "technical"
  },
  {
    "title": "The 80% Problem of AI Coding: Understanding Debt & Hidden Costs",
    "description": "Article featuring perspectives from Andrej Karpathy and Boris Cherney discussing the rapid evolution from human-AI collaboration models to 80-100% agentic coding. Examines the transition, implications, and hidden costs of this shift in AI-assisted software development practices.",
    "author": "Linguista (featuring Andrej Karpathy)",
    "source": "Blog",
    "url": "https://linguista.cn/info/tldrcards/hn-2026-p1/eighty-percent-problem-agentic-coding/",
    "published_date": "2026-01-29",
    "topics": ["ai-coding", "andrej-karpathy", "agentic-coding", "software-development", "technical-debt"],
    "type": "opinion"
  },
  {
    "title": "Agentic Reasoning for Large Language Models (arXiv:2601.12538)",
    "description": "New research paper on agentic reasoning capabilities in large language models, exploring how LLMs can be enhanced with agentic reasoning frameworks for improved task decomposition, planning, and execution. Published January 2026.",
    "author": "T. Wei et al.",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2601.12538",
    "published_date": "2026-01-29",
    "topics": ["llms", "ai-agents", "reasoning", "arxiv", "research"],
    "type": "technical"
  },
  {
    "title": "The Five Levels: from Spicy Autocomplete to the Dark Factory",
    "description": "Dan Shapiro's five-level model of AI-assisted programming: 0) Spicy autocomplete (original Copilot), 1) Coding intern (unimportant snippets with full review), 2) Junior developer (pair programming), 3) Developer (most code AI-generated, you're full-time code reviewer), 4) Engineering team (you're PM, agents do work), 5) Dark software factory (no human code review, black box turns specs into software). Simon mentions knowing a handful of people doing level 5 with small teams (<5 people) building nearly unbelievable things. The key characteristic: nobody reviews AI-produced code, ever - the goal is to prove the system works through massive testing and tooling.",
    "author": "Dan Shapiro (via Simon Willison)",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Jan/28/five-levels/",
    "published_date": "2026-01-28",
    "topics": ["ai-assisted-programming", "coding-agents", "levels-of-automation", "dark-factory", "software-development"],
    "type": "opinion"
  },
  {
    "title": "Digital Twin AI: Opportunities and Challenges from LLMs to World Models (arXiv:2601.01321)",
    "description": "Paper exploring the concept of Digital Twin AI, examining opportunities and challenges in evolving large language models into comprehensive world models. Discusses architectural approaches and implications for AI development. Published January 2026.",
    "author": "R. Zhou et al.",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2601.01321",
    "published_date": "2026-01-28",
    "topics": ["llms", "world-models", "digital-twin", "arxiv", "research", "ai-architecture"],
    "type": "technical"
  },
  {
    "title": "One Human + One Agent = One Browser From Scratch in 3 days",
    "description": "Inspired by Cursor's FastRender browser project using thousands of parallel agents and ~1.6 million lines of Rust, embedding-shapes built a web browser using a single Codex CLI agent over three days. Result: 20,000 lines of Rust that successfully renders HTML+CSS with no Rust crate dependencies (uses system frameworks for image/text rendering). The browser includes readable code for flexbox implementation and successfully rendered Simon's blog including SVG icons. Simon upgraded prediction for 2029: production-grade web browser built by small team using AI assistance by then.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Jan/27/one-agent-one-browser/",
    "published_date": "2026-01-27",
    "topics": ["browsers", "ai-assisted-programming", "codex-cli", "rust", "coding-agents", "browser-challenge"],
    "type": "technical"
  },
  {
    "title": "Kimi K2.5: Visual Agentic Intelligence with self-directed agent swarm",
    "description": "Kimi K2.5 adds multimodal capabilities to the trillion-parameter K2 LLM. Key features: native multimodal with continued pretraining over 15T mixed visual/text tokens, self-directed agent swarm paradigm with up to 100 sub-agents executing parallel workflows across 1,500 tool calls (4.5x faster than single-agent). Simon tested with SVG generation and multi-agent planning prompt. Model uses modified MIT license requiring prominent attribution for products with >100M MAU or $20M monthly revenue. 595GB model size, potentially runnable with MLX on dual 512GB M3 Ultra Mac Studios.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Jan/27/kimi-k2.5/",
    "published_date": "2026-01-27",
    "topics": ["llms", "vision-llms", "ai-agents", "kimi", "moonshot", "parallel-agents", "llm-release", "ai-in-china"],
    "type": "technical"
  },
  {
    "title": "Tips for getting coding agents to write decent quality tests",
    "description": "Simon's Hacker News advice on testing with coding agents: Work in Python with good pytest examples in training data. Use specific instructions like 'use pytest-httpx to mock endpoints'. Watch for anti-patterns like duplicated test setup code - push back with 'Refactor tests to use pytest.mark.parametrize' or 'extract into pytest fixture'. Best approach: ensure project has existing test suite with good patterns - agents pick these up without extra prompting. Quick tip: clone reference projects like datasette/datasette-enrichments to show agents preferred patterns.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Jan/26/coding-agent-tests/",
    "published_date": "2026-01-26",
    "topics": ["testing", "coding-agents", "python", "pytest", "hacker-news", "best-practices"],
    "type": "tutorial"
  },
  {
    "title": "ChatGPT Containers can now run bash, pip/npm install packages, and download files",
    "description": "Massive upgrade to ChatGPT Code Interpreter/Advanced Data Analysis: now supports running bash commands, pip/npm package installation, and file downloads. Simon details extensive testing of these new capabilities with examples including installing tools, downloading datasets, and running complex workflows. This significantly expands Code Interpreter from just data analysis to general-purpose computing capabilities.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Jan/26/chatgpt-containers/",
    "published_date": "2026-01-26",
    "topics": ["openai", "chatgpt", "code-interpreter", "sandboxing", "pypi", "npm", "bash", "ai-tools"],
    "type": "technical"
  }
]
