[
  {
    "name": "Architect",
    "url": "https://news.ycombinator.com/item?id=46703935",
    "description": "A terminal for running multiple AI coding agents simultaneously with visual feedback. Built on ghostty-vt terminal emulation library, it provides a grid layout showing all agent sessions at once with color-coded status indicators for when agents need approval or finish tasks. Includes git worktree support for fast task switching.",
    "release_date": "2026-01-21",
    "category": "AI coding CLI",
    "sources": ["Show HN"],
    "community_quotes": [
      "I built this because I kept losing track of which agents needed attention. Running 4+ Claude Code sessions across terminal tabs, I'd find one sitting idle for 20 minutes",
      "Architect solves this with visual feedback. When an agent finishes, its cell changes hue. When it needs approval, it glows",
      "The grid layout means I can see all sessions at once and know immediately where to focus"
    ]
  },
  {
    "name": "Nori CLI",
    "url": "https://github.com/tilework-tech/nori-cli",
    "description": "A multi-provider AI coding CLI that lets developers switch between Claude, Gemini, and Codex from a single native interface. Built in Rust for performance with fast incremental renders in Ratatui TUI. Reuses existing authentication from Claude Code, Gemini CLI, or Codex.",
    "release_date": "2026-01-13",
    "category": "AI coding CLI",
    "sources": ["Show HN", "GitHub"],
    "community_quotes": [
      "One CLI, multiple AI providers",
      "A CLI built for agentic development",
      "Improved terminal interface: Fast incremental renders in Ratatui, double buffered scrollback history"
    ]
  },
  {
    "name": "Yolobox",
    "url": "https://github.com/finbarr/yolobox",
    "description": "A container-based sandbox tool that lets developers run AI coding agents with full sudo privileges without risking damage to the home directory. Uses Docker or Podman containers as security boundaries, allowing agents to install dependencies and make system changes while keeping the host machine safe.",
    "release_date": "2026-01-13",
    "category": "AI coding CLI",
    "sources": ["Show HN", "GitHub"],
    "community_quotes": [
      "Let your AI go full send. Your home directory stays home",
      "I've been running claude and codex with full permissions for a while but it has always made me uneasy",
      "Part of what I find super useful with these coding agents is letting them have full sudo access so they can do whatever they want"
    ]
  },
  {
    "name": "NanoClaw",
    "url": "https://github.com/gavrielc/nanoclaw",
    "description": "A minimalist implementation of an AI coding agent in approximately 500 lines of TypeScript. Uses Apple Containers for security isolation and integrates with WhatsApp for messaging-based interaction. Designed as a reference implementation for developers to build their own custom AI agents.",
    "release_date": "2026-01-27",
    "category": "code agent",
    "sources": ["Show HN"],
    "community_quotes": [
      "NanoClaw - 'Clawdbot' in 500 lines of TS with Apple Containers",
      "A minimal implementation that has the core capabilities that made Clawdbot/OpenClaw useful",
      "I feel a lot better running this than a +350k LOC project that I can't even begin to wrap my head around"
    ]
  }
]
