[
  {
    "title": "Scaling Agentic Verifier for Competitive Coding",
    "description": "Research paper presents techniques for scaling agentic verification systems in competitive programming contexts. The work explores how verifier agents can be scaled to handle increasingly complex coding challenges, with implications for both competitive programming and real-world software development verification. Published February 6, 2026.",
    "author": "ArXiv Researchers",
    "source": "Paper",
    "url": "https://www.arxiv.org/abs/2602.04254",
    "published_date": "2026-02-06",
    "topics": [
      "AI-agents",
      "competitive-programming",
      "verification",
      "scaling",
      "code-generation"
    ],
    "type": "technical"
  },
  {
    "title": "From 'Vibe Coding' to 'Agentic Engineering': Karpathy Announces Paradigm Shift",
    "description": "Exactly one year after coining 'vibe coding,' Andrej Karpathy declares the era over and introduces 'agentic engineering' as the new paradigm for AI-assisted programming. The shift moves from casual, exploration-based prompting to precision and orchestration of AI agents. Karpathy reports AI now writes 80% of his code, noting the 'atrophy' of his manual coding skills as AI increasingly takes over.",
    "author": "Andrej Karpathy",
    "source": "Twitter",
    "url": "https://x.com/karpathy/status/2019137879310836075",
    "published_date": "2026-02-05",
    "topics": [
      "agentic-engineering",
      "vibe-coding",
      "AI-coding",
      "paradigm-shift"
    ],
    "type": "opinion"
  },
  {
    "title": "OpenAI Launches GPT-5.3-Codex: Advanced Agentic Coding Model",
    "description": "OpenAI releases GPT-5.3-Codex on February 5, 2026, described as 'the most capable agentic coding model to date.' The model is designed for complex software engineering tasks with advanced agentic capabilities, marking a significant leap in AI-powered code generation and autonomous development.",
    "author": "OpenAI",
    "source": "TechMedia",
    "url": "https://openai.com/index/introducing-gpt-5-3-codex/",
    "published_date": "2026-02-05",
    "topics": [
      "OpenAI",
      "GPT-5.3-Codex",
      "agentic-coding",
      "code-generation"
    ],
    "type": "technical"
  },
  {
    "title": "OmniCode: A Benchmark for Evaluating Software Engineering Agents",
    "description": "Research paper introduces OmniCode, a comprehensive benchmark for evaluating software engineering agents. The benchmark framework addresses the need for standardized evaluation of AI agents in software engineering tasks, providing methodologies to assess agent capabilities across various development scenarios. Published February 4, 2026.",
    "author": "ArXiv Researchers",
    "source": "Paper",
    "url": "https://www.arxiv.org/abs/2602.02262",
    "published_date": "2026-02-04",
    "topics": [
      "AI-agents",
      "software-engineering",
      "benchmark",
      "evaluation",
      "coding-agents"
    ],
    "type": "technical"
  },
  {
    "title": "Hacker News: Vibe Coding Impact on Open Source and Critical Thinking",
    "description": "Multiple HN discussions debate the impact of AI coding. 'How vibe coding is killing open source' argues AI won't teach collaboration skills. 'I miss thinking hard' discusses limitations of AI & vibe coding for unusual problems. 'Coding assistants are solving the wrong problem' notes AI enables writing software types users haven't learned. Community remains divided on AI's role in software development.",
    "author": "Hacker News Community",
    "source": "HN",
    "url": "https://news.ycombinator.com/item?id=46876455",
    "published_date": "2026-02-04",
    "topics": [
      "vibe-coding",
      "open-source",
      "AI-assistants",
      "developer-community"
    ],
    "type": "discussion"
  },
  {
    "title": "Vibe Coding Is Dead, Long Live Agentic Input: The Evolution of AI-Assisted Programming",
    "description": "A detailed analysis of the shift from 'vibe coding' to 'agentic input' explores how AI programming is evolving from exploration-based prompting to precision-based engineering. The article discusses how agentic engineering focuses on orchestration and structural integrity, marking a maturation of AI-assisted development practices.",
    "author": "Ryan Shrott",
    "source": "Blog",
    "url": "https://medium.com/@ryanshrott/vibe-coding-is-dead-long-live-agentic-input-bf596ec9a904",
    "published_date": "2026-02-04",
    "topics": [
      "vibe-coding",
      "agentic-input",
      "AI-evolution",
      "programming-paradigm"
    ],
    "type": "opinion"
  },
  {
    "title": "Hacker News: Sandbox AI Agents in Linux - Best Practices Discussion",
    "description": "Extensive Hacker News discussion on sandboxing AI agents in Linux environments. Key topics include: Using tools like Leash, bubblewrap, Docker, and VMs for agent isolation; Chrome as the most widespread sandboxing system; comparison between container-level and VM-level isolation; network access restrictions and namespace controls; approaches for defining minimal resource exposure; the balance between security and usability for development workflows; and emerging solutions like E2B for multi-tenant agent sandboxes. Community consensus leans toward VMs for stronger isolation, with containers and namespaces offering lightweight alternatives for less critical use cases.",
    "author": "Hacker News Community",
    "source": "HN",
    "url": "https://news.ycombinator.com/item?id=46874139",
    "published_date": "2026-02-03",
    "topics": [
      "AI-agents",
      "sandboxing",
      "Linux",
      "Docker",
      "VMs",
      "security",
      "bubblewrap",
      "container-security"
    ],
    "type": "discussion"
  },
  {
    "title": "Xcode 26.3 Unlocks Agentic Coding with Anthropic and OpenAI Integration",
    "description": "Apple releases Xcode 26.3 with native agentic coding capabilities, integrating Anthropic's Claude Agent and OpenAI's Codex directly into the IDE. This represents a major milestone in bringing autonomous AI agents to mainstream development tools, enabling developers to harness agentic AI for complex software engineering tasks.",
    "author": "Apple Newsroom",
    "source": "TechMedia",
    "url": "https://www.apple.com/newsroom/2026/02/xcode-26-point-3-unlocks-the-power-of-agentic-coding/",
    "published_date": "2026-02-03",
    "topics": [
      "Xcode",
      "agentic-coding",
      "Apple",
      "Claude",
      "OpenAI",
      "IDE"
    ],
    "type": "technical"
  },
  {
    "title": "Swarmia Launches AI Coding Agents Analytics View",
    "description": "Swarmia releases a new 'Coding agents' view to help organizations track AI coding agent contributions. The feature provides visibility into pull requests created by GitHub Copilot, Cursor, and Claude Code across all teams and repositories. Key capabilities include: tracking agent adoption rates, analyzing usage patterns (PRs merged vs. closed, share of fully agent-created PRs, batch size distribution), monitoring trends over time, comparing team adoption, and drilling down into individual PRs. The view works out-of-the-box with no configuration required.",
    "author": "Swarmia",
    "source": "Blog",
    "url": "https://swarmia.com/changelog/2026-02-02-ai-agent-metrics",
    "published_date": "2026-02-02",
    "topics": [
      "AI-agents",
      "analytics",
      "GitHub-Copilot",
      "Cursor",
      "Claude-Code",
      "metrics",
      "developer-tools"
    ],
    "type": "technical"
  },
  {
    "title": "A Social Network for A.I. Bots Only - No Humans Allowed",
    "description": "Simon Willison featured in New York Times piece on OpenClaw and Moltbook. He describes the bot chatter as 'complete slop' - mostly bots playing out science fiction scenarios from their training data. Willison sees Moltbots as evidence that AI agents have become significantly more powerful, with people really wanting digital assistants. He highlights concerns about malicious behavior due to systems still doing 'so many things people do not want them to do' and plain English communication making them vulnerable to coaxing.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/2/moltbook-nyt/",
    "published_date": "2026-02-02",
    "topics": [
      "OpenClaw",
      "Moltbook",
      "AI-agents",
      "AI-ethics",
      "social-networks",
      "New-York-Times"
    ],
    "type": "opinion"
  },
  {
    "title": "Introducing the Codex App: OpenAI's New macOS App for Codex Coding Agent",
    "description": "Simon Willison reviews OpenAI's new Codex macOS app, built with Electron and Node.js. Key features include first-class support for Skills and Automations for running scheduled tasks. The app tracks state in SQLite, with cloud-based automations promised soon. Usage stats show Codex usage has doubled since GPT-5.2-Codex launch in mid-December, with over 1 million developers using it in the past month. Windows support 'coming very soon' pending solid sandboxing implementation.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/2/codex-app/",
    "published_date": "2026-02-02",
    "topics": [
      "OpenAI",
      "Codex",
      "macOS",
      "Electron",
      "SQLite",
      "skills",
      "automations",
      "coding-agents"
    ],
    "type": "technical"
  },
  {
    "title": "Microsoft's AI-Led SDLC: End-to-End Agentic Software Development",
    "description": "Microsoft details building an end-to-end agentic software development lifecycle, highlighting that AI code reviews have shown quality improvements reaching 81% (up from 55%). The post discusses how agentic AI is transforming the entire software development process, from planning to deployment.",
    "author": "Microsoft Tech Community",
    "source": "Blog",
    "url": "https://techcommunity.microsoft.com/blog/appsonazureblog/an-ai-led-sdlc-building-an-end-to-end-agentic-software-development-lifecycle-wit/4491896",
    "published_date": "2026-02-02",
    "topics": [
      "Microsoft",
      "agentic-AI",
      "SDLC",
      "code-review",
      "software-quality"
    ],
    "type": "technical"
  },
  {
    "title": "AI Development Heats Up: Week of January 27",
    "description": "Weekly roundup covers momentum in AI development entering 2026. Adoption spans AI providers, enterprise platforms, and developer tools. Highlights include the emergence of agentic coding, enterprise-grade AI solutions, and the evolution from experimental 'vibe coding' to structured 'agentic engineering' approaches.",
    "author": "Alex Merced",
    "source": "Dev.to",
    "url": "https://dev.to/alexmercedcoder/ai-development-heats-up-week-of-january-27-february-2-2026-3dgd",
    "published_date": "2026-02-02",
    "topics": [
      "AI-development",
      "enterprise-adoption",
      "agentic-coding"
    ],
    "type": "technical"
  },
  {
    "title": "Best AI Agent Frameworks for 2026: Ranked by Developer Experience",
    "description": "A comprehensive ranking of AI agent frameworks for 2026 by someone who has shipped with all of them. The article focuses on connecting models (GPT-4, Claude) to databases and APIs, bridging no-code builders and developer tools. Provides practical insights for developers navigating the rapidly evolving AI agent landscape.",
    "author": "Hacker Noon Contributor",
    "source": "TechMedia",
    "url": "https://hackernoon.com/the-best-ai-agent-frameworks-for-2026-ranked-by-someone-whos-shipped-with-all-of-them",
    "published_date": "2026-02-02",
    "topics": [
      "AI-agents",
      "frameworks",
      "developer-tools",
      "GPT-4",
      "Claude"
    ],
    "type": "technical"
  },
  {
    "title": "TIL: Running OpenClaw in Docker",
    "description": "Simon Willison shares his ongoing notes on running OpenClaw using Docker on his Mac. Covers setup using Docker Compose configuration, answering setup questions, running administrative commands, setting up Telegram bot, accessing the web UI, and running commands as root. Includes screenshot of the OpenClaw Gateway Dashboard showing the web interface with control panels for chat, channels, instances, sessions, cron jobs, skills, nodes, and configuration.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/1/openclaw-docker/",
    "published_date": "2026-02-01",
    "topics": [
      "OpenClaw",
      "Docker",
      "AI-agents",
      "containers",
      "Telegram",
      "web-UI"
    ],
    "type": "tutorial"
  },
  {
    "title": "ProxyWar: Dynamic Assessment of LLM Code Generation (ICSE 2026)",
    "description": "Research paper presented at ICSE 2026 introduces 'ProxyWar,' a dynamic assessment framework for LLM code generation. The paper addresses code attribution challenges and includes analysis of open source status for different LLM coders, providing technical methodologies for evaluating and attributing LLM-generated code.",
    "author": "ICSE 2026 Researchers",
    "source": "Paper",
    "url": "https://www.arxiv.org/pdf/2602.04296",
    "published_date": "2026-02-01",
    "topics": [
      "LLM",
      "code-generation",
      "attribution",
      "open-source",
      "research"
    ],
    "type": "technical"
  },
  {
    "title": "The Complete Guide to Agentic Coding in 2026: Five Agentic Patterns",
    "description": "A comprehensive guide outlines five key agentic patterns for 2026, providing developers with a framework to 'claim the leverage of AI agents without compromising on software quality.' The guide bridges the gap between no-code builders and professional developer tools, focusing on precision, orchestration, and structural integrity in AI-assisted development.",
    "author": "TeamDay",
    "source": "Blog",
    "url": "https://www.teamday.ai/blog/complete-guide-agentic-coding-2026",
    "published_date": "2026-02-01",
    "topics": [
      "agentic-coding",
      "AI-agents",
      "software-quality",
      "patterns"
    ],
    "type": "tutorial"
  },
  {
    "title": "State of AI in 2026: LLMs, Coding, Scaling Laws, China, Agents, GPUs, AGI",
    "description": "Lex Fridman hosts a comprehensive 4.5-hour discussion with Nathan Lambert and Sebastian Raschka covering the current state of AI in 2026. Topics include LLMs, coding and developer tooling, scaling laws, AI competition with China, AI agents, GPUs and computing infrastructure, AGI, and the debate between closed vs. open source LLMs.",
    "author": "Lex Fridman, Nathan Lambert, Sebastian Raschka",
    "source": "Podcast",
    "url": "https://www.youtube.com/watch?v=EV7WhVT270Q",
    "published_date": "2026-02-01",
    "topics": [
      "LLM",
      "AI-agents",
      "scaling-laws",
      "AGI",
      "developer-tools"
    ],
    "type": "discussion"
  }
]
