[
  {
    "name": "RightNow CUDA Editor",
    "url": "https://www.producthunt.com/products/rightnow-ai",
    "description": "The first GPU-native AI code editor specifically designed for CUDA GPU programming, featuring real-time profiling, cycle-accurate emulation, and AI that understands CUDA for performance optimization and bottleneck identification.",
    "release_date": "2025-11-30",
    "category": "AI IDE",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "196 upvotes on Product Hunt launch showing strong developer interest",
      "The first GPU-native code editor that CUDA engineers have always wanted"
    ]
  },
  {
    "name": "RightNow CLI",
    "url": "https://www.producthunt.com/products/rightnow-ai",
    "description": "Claude Code for CUDA, an open-source AI CLI for GPU development that provides terminal-based AI assistance for CUDA programming, complementing the RightNow CUDA Editor with command-line capabilities.",
    "release_date": "2025-11-30",
    "category": "AI coding CLI",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Open-source solution for developers who prefer CLI workflows",
      "Brings AI assistance to terminal-based GPU development"
    ]
  },
  {
    "name": "Google Antigravity IDE",
    "url": "https://antigravity.google",
    "description": "Google's free AI-powered development platform featuring autonomous coding agents powered by Gemini 3 that can write, test, and debug applications while developers delegate complex tasks.",
    "release_date": "2025-11-18",
    "category": "AI IDE",
    "sources": ["The Verge", "Google Developer Blog", "Times of India"],
    "community_quotes": [
      "Google just released the IDE that could end coding as we know it and it's completely free",
      "An 'agent-first' coding tool built for the next generation of AI-powered software development"
    ]
  },
  {
    "name": "ChatGPT Business Project Memory",
    "url": "https://help.openai.com/articles/11391654-chatgpt-business-release-notes",
    "description": "OpenAI's ChatGPT Business update introducing project-only memory features and workspace discovery capabilities that help AI maintain context across coding sessions.",
    "release_date": "2025-11-19",
    "category": "AI code agent",
    "sources": ["OpenAI Release Notes", "VentureBeat"],
    "community_quotes": [
      "New project-only memory features for enhanced context retention",
      "Custom connectors with search/fetch capabilities for company knowledge"
    ]
  },
  {
    "name": "Parasoft AI-Driven Autonomous Testing",
    "url": "https://www.devopsdigest.com/parasoft-launches-ai-driven-autonomous-testing-workflows-for-cicd-pipelines",
    "description": "AI-driven autonomous testing workflows specifically designed for CI/CD pipelines, representing the evolution from CI/CD to CI/AI with automated testing and deployment workflows.",
    "release_date": "2025-11-18",
    "category": "Workflow agent",
    "sources": ["DevOps Digest"],
    "community_quotes": [
      "AI-driven autonomous testing workflows for CI/CD pipelines",
      "Represents the next phase of software delivery with CI/AI"
    ]
  }
]