[
  {
    "title": "Gas Town, Beads, and the Rise of Agentic Development with Steve Yegge",
    "description": "Software Engineering Daily podcast episode discussing how AI-assisted programming has evolved far beyond autocomplete. Large language models are now capable of editing entire codebases and coordinating long-running tasks. The conversation explores the rise of agentic development and its implications for software engineering.",
    "author": "Software Engineering Daily",
    "source": "Podcast",
    "url": "https://softwareengineeringdaily.com/2026/02/12/gas-town-beads-and-the-rise-of-agentic-development-with-steve-yegge/",
    "published_date": "2026-02-12",
    "topics": ["AI agents", "agentic development", "LLM", "codebase editing", "Steve Yegge"],
    "type": "discussion"
  },
  {
    "title": "Introducing Showboat and Rodney, so agents can demo what they build",
    "description": "Simon Willison introduces two new tools for coding agents - Showboat and Rodney. These tools are designed for asynchronous coding workflows, providing coding agents with everything needed to effectively demonstrate and deploy their work. The tools address the growing need for AI agents to not just write code but also present and demo their creations.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/10/showboat-and-rodney/",
    "published_date": "2026-02-10",
    "topics": ["AI agents", "coding tools", "asynchronous workflows", "LLM tools"],
    "type": "technical"
  },
  {
    "title": "How StrongDM's AI team build serious software without even looking at the code",
    "description": "Simon Willison discusses how StrongDM's AI team builds sophisticated software without directly viewing the codebase. The article compares their approach to Simon's LLM tool's SQLite logging mechanism and explores advanced software building approaches using AI agents that can operate on codebases without traditional code review processes.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/7/software-factory/",
    "published_date": "2026-02-07",
    "topics": ["AI coding", "software development", "StrongDM", "code generation", "LLM tools"],
    "type": "technical"
  }
]
