[
  {
    "name": "GitHub Agentic Workflows",
    "url": "https://github.blog/changelog/2026-02-13-github-agentic-workflows-are-now-in-technical-preview/",
    "description": "GitHub's new feature allowing developers to automate repository tasks using AI agents within GitHub Actions, enabling CI/CD orchestration with AI agents through Markdown-based workflow definitions.",
    "release_date": "2026-02-13",
    "category": "workflow agent",
    "sources": ["GitHub Blog", "The New Stack", "SD Times"],
    "community_quotes": [
      "Developers can describe outcomes they want in plain language, AI agents execute them in CI/CD",
      "Natural language to GitHub Actions YAML conversion is a game-changer for automation",
      "Excitement about productivity potential but concerns about code quality in automated PRs",
      "Direct terminal integration for coding tools makes workflows more powerful"
    ]
  },
  {
    "name": "Entire Checkpoints",
    "url": "https://techcrunch.com/2026/02/10/former-github-ceo-raises-record-60m-dev-tool-seed-round-at-300m-valuation/",
    "description": "An open-source CLI tool by former GitHub CEO Thomas Dohmke that records reasoning and instructions behind AI-generated code, storing context and checkpoints directly in GitHub for traceability.",
    "release_date": "2026-02-10",
    "category": "open-source AI coding agent",
    "sources": ["TechCrunch", "GeekWire", "Bloomberg", "Axios"],
    "community_quotes": [
      "Agent context is the new technical debt - addressing the challenge of managing AI-generated code",
      "Checkpoints make AI-generated context 'durable' by storing it in Git",
      "First hands-on reviews show promise for making AI code reviewable and transparent",
      "$60M seed funding at $300M valuation signals confidence in agent-native development platform"
    ]
  },
  {
    "name": "SnowConvert AI CLI",
    "url": "https://www.snowflake.com/en/blog/snowconvert-ai-new-features-feb-2026/",
    "description": "Snowflake's CLI tool for end-to-end database code migration, featuring AI-powered code extraction, conversion, and verification with automated two-sided migration verification capabilities.",
    "release_date": "2026-02-11",
    "category": "AI coding CLI",
    "sources": ["Snowflake Blog", "Snowflake Documentation"],
    "community_quotes": [
      "Bringing AI-powered code conversion to general availability",
      "Two-sided migration verification is a significant improvement for database migrations",
      "AI agents automate legacy SQL and procedural code conversion",
      "End-to-end migration from command line addresses DevOps workflow needs"
    ]
  },
  {
    "name": "Xcode 26.3",
    "url": "https://www.apple.com/newsroom/2026/02/xcode-26-point-3-unlocks-the-power-of-agentic-coding/",
    "description": "Apple's Xcode 26.3 introduces native agentic coding support with deeper integrations with OpenAI and Anthropic, allowing AI coding agents to access expanded Xcode capabilities for autonomous programming assistance.",
    "release_date": "2026-02-03",
    "category": "AI IDE",
    "sources": ["Apple Newsroom", "TechCrunch", "InfoQ"],
    "community_quotes": [
      "Apple finally embraces 'agentic coding' - huge milestone for iOS/macOS developers",
      "Deep integration with Claude and Codex directly in Xcode is impressive",
      "Multi-model support via Model Context Protocol (MCP) expands tool ecosystem",
      "300+ upvotes on Reddit show strong developer interest"
    ]
  },
  {
    "name": "Microsoft AI Toolkit for VS Code (February 2026 Update)",
    "url": "https://techcommunity.microsoft.com/blog/azuredevcommunityblog/%F0%9F%9A%80-ai-toolkit-for-vs-code-%E2%80%94-february-2026-update/4493673",
    "description": "Microsoft's February 2026 update (v0.30.0) introducing a new Tool Catalog as a centralized hub for discovering and integrating tools into AI agents within VS Code.",
    "release_date": "2026-02-01",
    "category": "IDE integration",
    "sources": ["Microsoft Azure Dev Community Blog"],
    "community_quotes": [
      "Tool Catalog is a centralized hub for discovering and integrating tools into AI agents",
      "Version 0.30.0 brings significant capabilities for agent development in VS Code",
      "Continues Microsoft's push to make VS Code the home for multi-agent development"
    ]
  }
]
