[
  {
    "title": "State of AI in 2026: LLMs, Coding, Scaling Laws, China, Agents, GPUs, AGI",
    "description": "Lex Fridman's 4.5-hour comprehensive discussion with Nathan Lambert and Sebastian Raschka covering the state of AI in 2026. Key topics include: comparison of ChatGPT vs Claude vs Gemini vs Grok, best AI for coding, open source vs closed source LLMs, evolution of transformers since 2019, AI scaling laws, pre-training vs post-training, tool use, continual learning, long context, robotics, timeline to AGI, and whether AI will replace programmers. The episode provides in-depth technical analysis of current AI landscape trends.",
    "author": "Lex Fridman with Nathan Lambert and Sebastian Raschka",
    "source": "Podcast",
    "url": "https://lexfridman.com/ai-sota-2026/",
    "published_date": "2026-02-01",
    "topics": ["AI", "LLMs", "Coding", "Scaling Laws", "AGI", "Transformers", "Open Source", "GPU", "Robotics"],
    "type": "discussion"
  },
  {
    "title": "My LLM Coding Workflow Going Into 2026",
    "description": "Addy Osmani shares his comprehensive AI-assisted engineering workflow for 2026. Key insights: ~90% of Claude Code is written by Claude Code itself; emphasizes 'AI-assisted engineering' over automation; critical techniques include planning first (specs before code), breaking work into small iterative chunks, providing extensive context, choosing the right model for each task, keeping humans in the loop for verification and testing, committing often with clear version control, customizing AI behavior with rules and examples, and embracing testing/automation as force multipliers. Highlights that AI amplifies existing engineering skills rather than replacing them.",
    "author": "Addy Osmani",
    "source": "Blog",
    "url": "https://medium.com/@addyosmani/my-llm-coding-workflow-going-into-2026-52fe1681325e",
    "published_date": "2025-12-19",
    "topics": ["AI Coding", "LLM Workflow", "Software Engineering", "Best Practices", "Claude Code", "Planning", "Testing"],
    "type": "technical"
  },
  {
    "title": "3 Techniques to Effectively Utilize AI Agents for Coding",
    "description": "Eivind Kjosbakken shares three key techniques for effective AI-assisted coding: 1) Cursor Planning Mode - creates implementation plans to eliminate ambiguity in natural language prompts, 2) Cursor Browser Actions - enables agents to autonomously test implementations in browsers, read console logs, and iterate without manual intervention, 3) Check logs with Claude Code - agents scan through logs (CloudWatch, etc.) saving 10-60 minutes per day. Claims these techniques have made him at least 10x more effective as an engineer. Emphasizes shifting from implementer to orchestrator role.",
    "author": "Eivind Kjosbakken",
    "source": "Blog",
    "url": "https://towardsdatascience.com/3-techniques-to-effectively-utilize-ai-agents-for-coding/",
    "published_date": "2025-12-17",
    "topics": ["AI Agents", "Cursor", "Claude Code", "Planning", "Browser Testing", "Log Analysis", "Productivity"],
    "type": "tutorial"
  },
  {
    "title": "Arcee AI Built 400B-Parameter Open Source LLM to Best Meta's Llama",
    "description": "TechCrunch reports on tiny startup Arcee AI building a 400B-parameter open source LLM from scratch that outperforms Meta's Llama. The model combines predictive AI with contemporary tools to achieve state-of-the-art results. Notable for demonstrating that smaller, focused teams can compete with major tech companies in LLM development.",
    "author": "TechCrunch",
    "source": "TechMedia",
    "url": "https://techcrunch.com/2026/01/28/tiny-startup-arcee-ai-built-a-400b-open-source-llm-from-scratch-to-best-metas-llama/",
    "published_date": "2026-01-28",
    "topics": ["LLM", "Open Source", "Arcee AI", "Meta Llama", "Model Training", "Startup"],
    "type": "technical"
  },
  {
    "title": "Ask HN: Go Deep into AI/LLMs or Just Use Them as Tools?",
    "description": "Hacker News discussion on whether developers should deeply understand LLM internals or simply use them as tools. Reflects community debate on the depth of AI knowledge required for effective software engineering in the LLM era.",
    "author": "Hacker News Community",
    "source": "Community",
    "url": "https://news.ycombinator.com/item?id=44079303",
    "published_date": "2025-11-21",
    "topics": ["LLM", "Developer Tools", "AI Education", "Software Engineering", "Community Discussion"],
    "type": "discussion"
  },
  {
    "title": "A Guide to Gen AI / LLM Vibecoding for Expert Programmers",
    "description": "Hacker News discussion about 'vibecoding' with LLMs and its impact on expert programmers. The community debates the distinction between 'vibe coding' and proper AI-assisted engineering, with emphasis on maintaining code quality and engineering rigor while using AI tools.",
    "author": "Hacker News Community",
    "source": "Community",
    "url": "https://news.ycombinator.com/item?id=44985207",
    "published_date": "2025-11-21",
    "topics": ["Vibe Coding", "AI-Assisted Engineering", "Code Quality", "LLM Best Practices"],
    "type": "discussion"
  },
  {
    "title": "AI Coding Discussion on Hacker News",
    "description": "HN discussion describing LLM coding tools as 'search-based program synthesizers' that retrieve, generate, and iteratively edit code under constraints (tests, types, linters, CI). Community explores how these tools are changing software development workflows.",
    "author": "Hacker News Community",
    "source": "Community",
    "url": "https://news.ycombinator.com/item?id=45230677",
    "published_date": "2025-11-21",
    "topics": ["AI Coding", "Program Synthesis", "LLM Constraints", "Testing", "CI/CD"],
    "type": "discussion"
  },
  {
    "title": "Block Removal for Large Language Models Through Constrained Binary Optimization",
    "description": "ArXiv paper (cs.AI/2602.00161) presenting a technique for optimizing LLMs through block removal using constrained binary optimization. Addresses model efficiency and compression challenges for large language models.",
    "author": "D Jansen et al.",
    "source": "Paper",
    "url": "https://arxiv.org/abs/2602.00161",
    "published_date": "2026-02-01",
    "topics": ["LLM Optimization", "Model Compression", "Binary Optimization", "ArXiv"],
    "type": "technical"
  },
  {
    "title": "TDS Newsletter: Vibe Coding Is Great. Until It's Not",
    "description": "Towards Data Science newsletter examining LLM-based coding workflows and the criticism around 'vibe coding' approaches. Discusses the tension between rapid AI-assisted development and maintaining engineering rigor, code quality, and long-term maintainability.",
    "author": "Towards Data Science",
    "source": "Newsletter",
    "url": "https://towardsdatascience.com/tds-newsletter-vibe-coding-is-great-until-its-not/",
    "published_date": "2026-02-06",
    "topics": ["Vibe Coding", "LLM Workflow", "Code Quality", "Engineering Practices", "AI-Assisted Development"],
    "type": "opinion"
  },
  {
    "title": "AI Tools for ML Research - What Am I Missing?",
    "description": "Reddit discussion on r/MachineLearning about using GPT models for planning, code snippets, debugging, and technical writing in ML research. Community shares tools and workflows for leveraging AI in machine learning research.",
    "author": "Reddit r/MachineLearning Community",
    "source": "Community",
    "url": "https://www.reddit.com/r/MachineLearning/comments/1jqolkh/ai_tools_for_ml_research_what_am_i_missing_d/",
    "published_date": "2025-11-21",
    "topics": ["AI Tools", "ML Research", "GPT Models", "Debugging", "Technical Writing", "Code Generation"],
    "type": "discussion"
  },
  {
    "title": "Vibe Coding Is Not the Same as AI-Assisted Engineering",
    "description": "Addy Osmani's Medium article distinguishing between 'vibe coding' and proper AI-assisted engineering where AI acts as a collaborator under human oversight. Emphasizes that AI-assisted engineering requires maintaining code quality, testing, review, and accountability, while vibe coding risks creating low-quality, unmaintainable codebases.",
    "author": "Addy Osmani",
    "source": "Blog",
    "url": "https://medium.com/@addyosmani/vibe-coding-is-not-the-same-as-ai-assisted-engineering-3f81088d5b98",
    "published_date": "2025-11-21",
    "topics": ["Vibe Coding", "AI-Assisted Engineering", "Code Quality", "Best Practices", "Software Engineering"],
    "type": "opinion"
  }
]
