[
  {
    "name": "OpenAI Codex Desktop App",
    "url": "https://openai.com/index/introducing-the-codex-app/",
    "description": "A dedicated macOS desktop application that serves as a command center for managing multiple AI coding agents working in parallel on software development tasks with project-based workflows.",
    "release_date": "2026-02-02",
    "category": "AI coding CLI",
    "sources": ["TechCrunch", "VentureBeat", "DevOps.com", "OpenAI Official"],
    "community_quotes": [
      "OpenAI's answer to vibe-coding apps with native macOS experience",
      "A powerful command center for building with agents",
      "Allows developers to manage multiple AI agents working in parallel",
      "Less of an AI in my editor and more of an orchestration platform",
      "Represents a strategic pivot from simple code completion to autonomous team models"
    ]
  },
  {
    "name": "Qodo 2.0",
    "url": "https://www.qodo.ai/blog/introducing-qodo-2-0-agentic-code-review/",
    "description": "A multi-agent AI code review platform that introduces task-specific AI agents with memory-enabled capabilities, achieving the highest F1 score (60.1%) on industry benchmarks for automated code review.",
    "release_date": "2026-02-04",
    "category": "AI code review",
    "sources": ["Official Qodo Blog", "GlobeNewswire", "DevOps.com", "Reddit"],
    "community_quotes": [
      "Achieved highest overall F1 score at 60.1% on industry benchmarks",
      "Outperforms competing solutions by 9%",
      "First AI code review tool that addresses the noise problem",
      "11% better detection of critical issues compared to competing solutions",
      "Validated on real pull requests with enterprise trust focus"
    ]
  },
  {
    "name": "Kimi K2.5 in Microsoft Foundry",
    "url": "https://techcommunity.microsoft.com/blog/azure-ai-foundry-blog/kimi-k2-5-now-in-microsoft-foundry/4492321",
    "description": "Microsoft Azure AI Foundry announced availability of Moonshot AI's Kimi K2.5 model, a 1 trillion parameter open-weight model with agent swarm capability supporting up to 100 sub-agents and 76.8% SWE-bench score.",
    "release_date": "2026-02-06",
    "category": "AI coding model integration",
    "sources": ["Microsoft Azure AI Foundry Blog", "Moonshot AI Platform"],
    "community_quotes": [
      "1 trillion parameter Mixture-of-Experts architecture",
      "Agent swarm capability with up to 100 sub-agents",
      "Parallel workflows across up to 1,500 tools",
      "76.8% SWE-bench score for coding tasks",
      "China's strongest AI model entering the enterprise space"
    ]
  },
  {
    "name": "VS Code v1.109 with Agentic AI Workspace Priming",
    "url": "https://code.visualstudio.com/blogs/2026/02/05/multi-agent-development",
    "description": "VS Code January 2026 update (v1.109) introduces agentic AI workspace priming with /init command, transforming the editor into a multi-agent orchestration hub supporting Claude and Codex agents with unified management under GitHub Copilot subscription.",
    "release_date": "2026-01-29",
    "category": "IDE integration",
    "sources": ["Visual Studio Magazine", "Official VS Code Blog", "GitHub Copilot Changelog"],
    "community_quotes": [
      "Transforms VS Code into a multi-agent orchestration hub",
      "New /init command generates contextual understanding of your codebase",
      "Support for Claude and Codex agents (run locally or in the cloud)",
      "Represents a significant shift toward comprehensive multi-agent development platform",
      "Faster chat experience with richer agent sessions"
    ]
  }
]
