[
  {
    "name": "Kilo Code Reviewer",
    "url": "https://www.producthunt.com/products/kilocode",
    "description": "An automatic AI-powered code review tool that provides reviews the moment you open a Pull Request, part of the Kilo Code open-source AI coding assistant platform.",
    "release_date": "2026-01-27",
    "category": "AI code review",
    "sources": ["Product Hunt"],
    "community_quotes": [
      "Ranked #1 Product of the Day on Product Hunt for January 27th, 2026",
      "Automatic AI-powered code review that triggers the moment you open a PR",
      "This is Kilo Code's 3rd launch on Product Hunt"
    ]
  },
  {
    "name": "OpenAI Codex Desktop App",
    "url": "https://openai.com/index/introducing-gpt-5-3-codex/",
    "description": "A dedicated macOS desktop application for Codex that serves as a command center for managing multiple AI agents working in parallel on software development tasks with project-based workflows.",
    "release_date": "2026-02-02",
    "category": "AI coding CLI",
    "sources": ["Reuters", "MLQ", "Inc.com"],
    "community_quotes": [
      "OpenAI's answer to vibe-coding apps with native macOS experience",
      "Allows developers to manage multiple AI agents working in parallel",
      "Signals a shift from AI pair-programming to AI workforce management"
    ]
  },
  {
    "name": "Kilo CLI 1.0",
    "url": "https://blog.kilo.ai/p/kilo-cli",
    "description": "An open-source command-line interface that brings AI-powered coding assistance to the terminal with support for 500+ different AI models and agentic engineering capabilities.",
    "release_date": "2026-02-04",
    "category": "AI coding CLI",
    "sources": ["VentureBeat", "Product Hunt"],
    "community_quotes": [
      "Brings open-source vibe coding to your terminal",
      "Supports 500+ different AI models",
      "Built for speed and team adoption in 2026"
    ]
  },
  {
    "name": "Qodo 2.0",
    "url": "https://www.qodo.ai/blog/introducing-qodo-2-0-agentic-code-review/",
    "description": "A multi-agent AI code review platform that introduces task-specific AI agents with memory-enabled capabilities to improve code review accuracy and reduce noise.",
    "release_date": "2026-02-04",
    "category": "AI code review",
    "sources": ["Globe Newswire", "DevOps.com", "Reddit"],
    "community_quotes": [
      "Achieved highest overall F1 score at 60.1% on industry benchmarks",
      "Outperforms competing solutions by 9%",
      "First AI code review tool I've seen that addresses the noise problem"
    ]
  },
  {
    "name": "Kimi Code CLI",
    "url": "https://www.kimi.com/code",
    "description": "An open-source agentic coding CLI from Moonshot AI that runs in the terminal, can edit code, run commands, and fix itself autonomously with Kimi K2.5 model integration.",
    "release_date": "2026-02-06",
    "category": "AI coding CLI",
    "sources": ["Medium", "Juejin", "53ai.com"],
    "community_quotes": [
      "A truly autonomous AI coding partner that can write and run code",
      "China's strongest AI entering the terminal space",
      "Functions as both a coding agent and a shell"
    ]
  }
]
