[
  {
    "title": "Claude Opus 4.6: Anthropic's Most Advanced Model",
    "description": "Anthropic launches Claude Opus 4.6, their smartest model with significant improvements in agentic coding, computer use, tool use, search, and finance. Key features: 1M token context window (first for Opus-class), better planning and sustained agentic tasks, improved code review and debugging, state-of-the-art on Terminal-Bench 2.0 and Humanity's Last Exam. New features include adaptive thinking, effort controls (low/medium/high/max), context compaction for longer tasks, and agent teams in Claude Code. Partners praise its autonomous capabilities and complex multi-step coding abilities.",
    "author": "Anthropic",
    "source": "TechMedia",
    "url": "https://www.anthropic.com/news/claude-opus-4-6",
    "published_date": "2026-02-05",
    "topics": ["Claude Opus 4.6", "agentic coding", "long context", "AI agents", "code generation"],
    "type": "technical"
  },
  {
    "title": "OpenAI and Anthropic Release Dueling AI Models on the Same Day",
    "description": "On February 5, 2026, OpenAI launched GPT-5.3-Codex just minutes after Anthropic released Claude Opus 4.6, highlighting intense competition in the agentic coding space. OpenAI's model reportedly helped build itself, demonstrating AI self-improvement capabilities. The simultaneous releases showcase escalating rivalry between the two companies in the AI coding wars.",
    "author": "TechCrunch",
    "source": "TechMedia",
    "url": "https://techcrunch.com/2026/02/05/openai-launches-new-agentic-coding-model-only-minutes-after-anthropic-drops-its-own/",
    "published_date": "2026-02-05",
    "topics": ["OpenAI", "Anthropic", "agentic coding", "GPT-5.3-Codex", "AI competition"],
    "type": "news"
  },
  {
    "title": "Fundamental Raises $255M Series A for Large Tabular Model (LTM)",
    "description": "AI lab Fundamental emerges from stealth with $255M funding at $1.2B valuation to build 'Nexus,' a Large Tabular Model (LTM) designed for structured data analysis. Unlike LLMs that work with unstructured text/audio/video/code, Nexus handles tabular data deterministically, doesn't use transformer architecture, and can reason over extremely large datasets (billions of rows) without context window limitations. Led by CEO Jeremy Fraenkel, the company has seven-figure Fortune 100 contracts and AWS strategic partnership.",
    "author": "Russell Brandom",
    "source": "TechMedia",
    "url": "https://techcrunch.com/2026/02/05/fundamental-raises-255-million-series-a-with-a-new-take-on-big-data-analysis/",
    "published_date": "2026-02-05",
    "topics": ["structured data", "tabular models", "enterprise AI", "deterministic AI", "big data"],
    "type": "news"
  },
  {
    "title": "State of AI in 2026: LLMs, Coding, Scaling Laws, China, Agents, GPUs, AGI",
    "description": "Lex Fridman discusses with Nathan Lambert and Sebastian Raschka the state of AI in 2026, covering topics including: best AI for coding, open source vs closed source LLMs, transformer evolution since 2019, AI scaling laws, pre-training and post-training techniques, China vs US AI race, ChatGPT vs Claude vs Gemini vs Grok comparison, AGI timeline predictions, and whether AI will replace programmers. The episode features extensive discussion on AI development practices and future implications.",
    "author": "Lex Fridman with Nathan Lambert and Sebastian Raschka",
    "source": "Podcast",
    "url": "https://lexfridman.com/ai-sota-2026/",
    "published_date": "2026-02-01",
    "topics": ["LLM", "AI scaling laws", "coding", "open source vs closed source", "AGI", "China vs US", "transformers"],
    "type": "discussion"
  },
  {
    "title": "Claude Opus 4.6 Uncovers 500 Zero-Day Flaws in Open-Source",
    "description": "Thomas Ptacek discusses vulnerability research as THE MOST LLM-amenable software engineering problem, commenting on Axios report about Claude Opus 4.6 uncovering 500 zero-day flaws. He emphasizes that vulnerability research is pattern-driven with huge public corpus, closed loops, and search problems - making it ideal for LLMs. The vulnerability research outcomes are in frontier lab model cards, and these companies have massive resources to invest in this area.",
    "author": "Thomas Ptacek (via Simon Willison)",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/8/thomas-ptacek/",
    "published_date": "2026-02-08",
    "topics": ["vulnerability research", "LLM security", "Claude Opus 4.6", "AI security research"],
    "type": "opinion"
  },
  {
    "title": "Vouch: Mitchell Hashimoto's System to Combat AI-Generated PR Spam",
    "description": "Mitchell Hashimoto introduces 'Vouch,' a new system to help address the deluge of worthless AI-generated PRs faced by open source projects. The system allows unvouched users to be blocked from contributing, with users vouched or denounced by contributors via GitHub issues, discussions, or CLI. Integration into GitHub is simple via published GitHub actions. The system is generic to forges and not tied to GitHub specifically.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/7/vouch/",
    "published_date": "2026-02-07",
    "topics": ["open source", "AI spam", "GitHub", "vouching system", "AI ethics"],
    "type": "technical"
  },
  {
    "title": "Claude Fast Mode: 2.5x Faster at 6x the Price",
    "description": "Anthropic introduces '/fast' command in Claude Code for a 2.5x faster version of Claude Opus 4.6, but at 6x the normal price. Regular Opus costs $5/million input and $25/million output, while fast mode costs $30/million input and $150/million output. There's a 50% discount until February 16th (3x multiple). Opus 4.6 also offers up to 1M token context at 2x input price and 1.5x output price once you exceed 200,000 tokens.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/7/claude-fast-mode/",
    "published_date": "2026-02-07",
    "topics": ["Claude Opus 4.6", "pricing", "fast inference", "Claude Code", "LLM pricing"],
    "type": "technical"
  },
  {
    "title": "David Crawshaw on Eight Months of Agents: More Fun Programming Than Ever",
    "description": "David Crawshaw shares his experience after eight months of using AI coding agents: 'I am having more fun programming than I ever have, because so many more of the programs I wish I could find the time to write actually exist.' He acknowledges fear about the end-game of intelligence on tap in society, but in the limited domain of writing computer programs, these tools have brought exploration and joy to his work.",
    "author": "David Crawshaw (via Simon Willison)",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/7/david-crawshaw-agents/",
    "published_date": "2026-02-07",
    "topics": ["coding agents", "AI-assisted programming", "developer experience", "AI adoption"],
    "type": "opinion"
  },
  {
    "title": "How StrongDM's AI Team Build Software Without Looking at Code",
    "description": "Simon Willison reports on StrongDM's AI team implementing what Dan Shapiro called the 'Dark Factory' level of AI adoption, where no human even looks at the code that coding agents are producing. This represents level 5 of AI-assisted programming: the dark software factory, like a factory run by robots where the lights are out because robots don't need to see. The team's approach focuses on proving systems work through extensive testing and tooling.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/7/strongdm-dark-factory/",
    "published_date": "2026-02-07",
    "topics": ["coding agents", "Dark Factory pattern", "StrongDM", "agentic coding", "AI adoption levels"],
    "type": "technical"
  },
  {
    "title": "Tom Dale on Mental Health Crisis in Software Engineering",
    "description": "Tom Dale observes that nearly every software engineer he's talked to is experiencing some degree of mental health crisis. While many assume job loss anxiety, he's seeing near-manic episodes triggered by watching software shift from scarce to abundant, compulsive behaviors around agent usage, and dissociative awe at the temporal compression of change. It's cognitive overload from living in an inflection point.",
    "author": "Tom Dale (via Simon Willison)",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/6/tom-dale-mental-health/",
    "published_date": "2026-02-06",
    "topics": ["AI ethics", "careers", "mental health", "coding agents", "cognitive overload"],
    "type": "opinion"
  },
  {
    "title": "Running Pydantic's Monty Rust Sandbox in WebAssembly",
    "description": "Simon Willison explores running Pydantic's Monty, a custom Python-like language (subset of Python) in Rust, in WebAssembly - creating a sandbox-in-a-sandbox. This addresses the growing need for sandboxes to run untrusted code as AI agents become more prevalent. Monty provides both a Rust library and Python package for executing untrusted Python-like code safely.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/6/monty-webassembly/",
    "published_date": "2026-02-06",
    "topics": ["Python", "sandboxing", "AI", "Rust", "WebAssembly", "Pydantic", "coding agents", "Claude Code"],
    "type": "technical"
  },
  {
    "title": "Heroku Transitions to Sustaining Engineering Model",
    "description": "Heroku announces transition to a 'sustaining engineering model' focused on stability, security, reliability, and support rather than new features. They explain they're focusing investments on helping organizations build enterprise-grade AI. Simon notes this is frustrating corporate communication and plans to migrate his blog away from Heroku before Salesforce loses interest completely.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/6/heroku/",
    "published_date": "2026-02-06",
    "topics": ["Heroku", "Salesforce", "cloud infrastructure", "AI platform shifts"],
    "type": "news"
  },
  {
    "title": "Karel D'Oosterlinck: $10,000 to Automate Research with Codex",
    "description": "Karel D'Oosterlinck describes spending $10,000 to automate research at OpenAI using Codex. For quick experiments in unfamiliar code, he has Codex do extensive due diligence: exploring relevant Slack channels, reading discussions, fetching experimental branches, cherry-picking useful changes, and summarizing everything in extensive notes with links. Using these notes, Codex wires the experiment and makes hyperparameter decisions that would have required much more effort manually.",
    "author": "Karel D'Oosterlinck (via Simon Willison)",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/6/karel-codex-research/",
    "published_date": "2026-02-06",
    "topics": ["Codex CLI", "coding agents", "AI-assisted programming", "OpenAI", "research automation"],
    "type": "opinion"
  },
  {
    "title": "Mitchell Hashimoto's AI Adoption Journey",
    "description": "Mitchell Hashimoto shares unconventional tips for getting to a place with coding agents where they demonstrably improve workflow and productivity. Key tips include: 1) Reproduce your own work - do work manually, then recreate using agents without seeing your manual solution, 2) End-of-day agents - block out last 30 minutes daily to kick off agents, 3) Outsource the Slam Dunks - once you know an agent can handle a task, have it do that while you work on something more interesting.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/5/mitchell-hashimoto-ai-adoption/",
    "published_date": "2026-02-05",
    "topics": ["AI adoption", "coding agents", "workflow", "productivity", "best practices"],
    "type": "opinion"
  },
  {
    "title": "Opus 4.6 vs GPT-5.3-Codex: Pelican Bicycle Benchmark",
    "description": "Simon Willison compares Anthropic's Opus 4.6 and OpenAI's GPT-5.3-Codex, both released within 15 minutes of each other, using the 'pelican riding a bicycle' image generation benchmark. He finds both models really good, but struggles to find tasks that previous models (Codex 5.2 and Opus 4.5) couldn't handle. The most convincing capabilities demo comes from Nicholas Carlini at Anthropic talking about building a C compiler with a team of parallel Claudes.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/5/opus-4-6-vs-codex-5-3/",
    "published_date": "2026-02-05",
    "topics": ["LLM release", "Anthropic", "OpenAI", "model comparison", "pelican-riding-a-bicycle", "parallel agents", "C compiler"],
    "type": "technical"
  },
  {
    "title": "CIA World Factbook Sunset, Simon Willison Archives 2020 Version",
    "description": "CIA announces sunset of The World Factbook, their most useful public-facing publication since 1971, removing the entire site including archives. In response, Simon Willison downloads the 384MB 2020 zip file archive and creates simonw/cia-world-factbook-2020 GitHub repository with GitHub Pages enabled at simonw.github.io/cia-world-factbook-2020/ to preserve this valuable public domain resource.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/5/cia-world-factbook/",
    "published_date": "2026-02-05",
    "topics": ["CIA", "GitHub", "Internet Archive", "digital preservation"],
    "type": "news"
  },
  {
    "title": "Mistral Voxtral Transcribe 2: Real-Time Speech-to-Text",
    "description": "Mistral releases Voxtral Transcribe 2, a family of two new models for transcribing audio to text. Voxtral Realtime (Voxtral-Mini-4B-Realtime-2602) is open weights (Apache-2.0), available as 8.87GB download from Hugging Face. The closed weight model 'voxtral-mini-latest' is available via Mistral API at $0.003/minute ($0.18/hour). Simon was impressed by the live demo - it correctly transcribed text quickly with jargon like Django and WebAssembly.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/4/voxtral-transcribe/",
    "published_date": "2026-02-04",
    "topics": ["AI", "speech-to-text", "Mistral", "Hugging Face", "transcription", "real-time"],
    "type": "technical"
  },
  {
    "title": "Introducing the Codex App",
    "description": "OpenAI releases a new macOS app for their Codex coding agent, built with Electron and Node.js. The app provides a nice UI over Codex CLI agent capabilities and adds first-class support for Skills and Automations for running scheduled tasks. Automations track state in SQLite database. Since GPT-5.2-Codex launch in mid-December, overall Codex usage has doubled, and in the past month more than a million developers have used Codex. Cloud-based automations coming soon.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/2/codex-app/",
    "published_date": "2026-02-02",
    "topics": ["sandboxing", "SQLite", "AI", "Datasette", "Electron", "OpenAI", "AI agents", "coding agents", "Codex CLI"],
    "type": "technical"
  },
  {
    "title": "New York Times Features OpenClaw and Moltbook Social Network",
    "description": "Cade Metz writes for New York Times about OpenClaw and Moltbook, the social network for AI bots only with no humans allowed. Simon Willison was interviewed and photographed for the piece. He was 'entertained' by the way bots coaxed each other into talking like machines in classic sci-fi novels, seeing it as natural outcome of how chatbots are trained on vast collections including dystopian sci-fi. Simon notes most of it is 'complete slop' but shows AI agents have become significantly more powerful.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/2/nyt-openclaw/",
    "published_date": "2026-02-02",
    "topics": ["journalism", "New York Times", "photography", "AI", "AI agents", "OpenClaw", "AI slop"],
    "type": "news"
  },
  {
    "title": "Hacker News: How to Effectively Write Quality Code with AI",
    "description": "Massive Hacker News discussion (Feb 8, 2026) about writing quality code with AI assistants. Key themes: 1) Code as thinking mechanism - many developers worry about losing the cognitive benefits of writing code, 2) The 'Dark Factory' pattern - level 5 AI adoption where no human reviews code, 3) Spec-driven development vs. hands-on exploration, 4) AI productivity paradox - gains reported but questions about net value, 5) Career anxiety and the future of software engineering, 6) Linting, testing, and verification strategies for AI-generated code. The discussion reveals deep ambivalence about AI coding tools - excitement about productivity but fear of skill atrophy and job displacement.",
    "author": "Hacker News Community",
    "source": "Community",
    "url": "https://news.ycombinator.com/item?id=46916586",
    "published_date": "2026-02-08",
    "topics": ["AI-assisted programming", "code quality", "career anxiety", "spec-driven development", "linting", "testing", "Hacker News"],
    "type": "discussion"
  },
  {
    "title": "AI Coding Agents in 2026: Coherence Through Orchestration",
    "description": "Mike Mason publishes article on January 22, 2026 about the evolution of AI coding agents from autocomplete tools into genuine software producers. The piece discusses how orchestration and coherence have become the key challenges for agentic coding systems in 2026, with agents now capable of sustained multi-step reasoning and complex task breakdown.",
    "author": "Mike Mason",
    "source": "Blog",
    "url": "https://mikemason.ca/writing/ai-coding-agents-jan-2026/",
    "published_date": "2026-01-22",
    "topics": ["coding agents", "AI orchestration", "agentic systems", "software engineering"],
    "type": "opinion"
  },
  {
    "title": "ArXiv cs.AI Papers February 2026: Agent Research Surge",
    "description": "ArXiv publishes 1,288 papers in cs.AI for February 2026, with significant focus on AI agents. Notable papers include: 'Position: Agentic Evolution is the Path to Evolving LLMs' (Minhua Lin et al.), 'DockSmith: Scaling Reliable Coding Environments via an Agentic Docker Builder' (Jiaran Zhang et al.), 'Autonomous Data Processing using Meta-Agents' (Udayan Khurana), and multiple papers on multi-agent systems, agent benchmarks, and agentic reasoning. The volume and diversity of agent-related papers reflects the research community's intense focus on agentic AI.",
    "author": "ArXiv Contributors",
    "source": "Paper",
    "url": "https://arxiv.org/list/cs.AI/2026-02",
    "published_date": "2026-02-01",
    "topics": ["AI agents", "arxiv", "research papers", "agentic evolution", "multi-agent systems", "LLM agents"],
    "type": "research"
  },
  {
    "title": "Replit CEO Amjad Masad: Building for 1B Developers",
    "description": "Sequoia Capital podcast features Replit CEO Amjad Masad discussing his vision for democratizing software development and making programming accessible to a billion developers worldwide. Masad discusses AI's impact on coding jobs, emphasizing that AI holds enormous potential for software developers and that startups are already building agents designed to manage engineering workflows. Replit is actively implementing fixes to ensure AI tools don't cause production issues.",
    "author": "Amjad Masad (Sequoia Capital Podcast)",
    "source": "Podcast",
    "url": "https://sequoiacap.com/podcast/training-data-amjad-masad/",
    "published_date": "2026-02-01",
    "topics": ["Replit", "Amjad Masad", "AI coding tools", "developer tools", "democratization"],
    "type": "discussion"
  }
]
