[
  {
    "title": "Deep Blue: The Psychological Impact of AI on Software Developers",
    "description": "Simon Willison coins the term 'Deep Blue' to describe the psychological ennui and existential dread many software developers feel due to generative AI's encroachment on their field. Discusses how careers built on years of dedicated work feel threatened by chatbots, causing genuine mental anguish. Personal experience with ChatGPT Code Interpreter in 2023 and recent coding agents (Claude Opus 4.5/4.6, GPT-5.2/5.3) triggering feelings of obsolescence. Notes that 'the code they write isn't any good' defense no longer applies. Comparison to chess and Go players who went through similar transitions and emerged stronger.",
    "author": "Simon Willison",
    "source": "Blog",
    "url": "https://simonwillison.net/2026/Feb/15/deep-blue/",
    "published_date": "2026-02-15",
    "topics": ["AI psychology", "developer mental health", "AI anxiety", "career impact", "coding agents"],
    "type": "opinion"
  },
  {
    "title": "The AI hater's guide to code with LLMs",
    "description": "Hacker News discussion with ironic title exploring approaches for AI skeptics to effectively use LLMs for coding. Community shares practical perspectives on embracing AI assistance despite skepticism.",
    "author": "Hacker News Community",
    "source": "HN",
    "url": "https://news.ycombinator.com/item?id=47007593",
    "published_date": "2026-02-14",
    "topics": ["AI skepticism", "LLM coding", "developer workflow", "practical AI use"],
    "type": "discussion"
  },
  {
    "title": "Improving 15 LLMs at Coding in One Afternoon",
    "description": "Hacker News discussion about improving LLM coding effectiveness through 'low-hanging fruit' optimizations. Community explores techniques to vastly enhance existing model performance without architectural changes.",
    "author": "Hacker News Community",
    "source": "HN",
    "url": "https://news.ycombinator.com/item?id=46988596",
    "published_date": "2026-02-13",
    "topics": ["LLM optimization", "AI coding", "model improvement", "developer productivity"],
    "type": "discussion"
  },
  {
    "title": "Engineering AI Agents for Clinical Workflows: Architecture, MLOps, and Governance",
    "description": "Case study on engineering AI agents for clinical workflows, covering architecture design, MLOps practices, and governance considerations for AI in healthcare environments. Accepted for IEEE/ACM International Conference on AI Engineering 2026.",
    "author": "Cláudio Lúcio do Val Lopes, João Marcus Pitta, Fabiano Belém, et al.",
    "source": "ArXiv",
    "url": "https://arxiv.org/abs/2602.00751",
    "published_date": "2026-02-10",
    "topics": ["AI agents", "MLOps", "governance", "healthcare AI", "software engineering"],
    "type": "technical"
  },
  {
    "title": "The Best AI Models for Coding: Accuracy, Integration, and Developer Fit",
    "description": "JetBrains Developer Ecosystem 2025 report reveals GPT-5/GPT-5.1, Claude 3.7 Sonnet, and Gemini 2.5 Pro as top AI coding models. 85% of developers regularly use AI tools. Key selection criteria: code quality, IDE integration, cost, and data privacy. DeepSeek R1 emerging for cost-efficient local deployment. 8-step framework for choosing AI coding models based on workflow needs.",
    "author": "JetBrains AI Blog",
    "source": "TechMedia",
    "url": "https://blog.jetbrains.com/ai/2026/02/the-best-ai-models-for-coding-accuracy-integration-and-developer-fit/",
    "published_date": "2026-02-11",
    "topics": ["AI coding", "LLM comparison", "developer tools", "IDE integration", "AI adoption statistics"],
    "type": "technical"
  },
  {
    "title": "Stop generating, start thinking",
    "description": "Hacker News discussion on the role of AI and LLMs in programming. Explores how programmers use AI for solutions and bug detection, questioning whether AI represents the future of programming assistance.",
    "author": "Hacker News Community",
    "source": "HN",
    "url": "https://news.ycombinator.com/item?id=46938958",
    "published_date": "2026-02-09",
    "topics": ["AI philosophy", "programming", "LLM reasoning", "developer tools"],
    "type": "discussion"
  },
  {
    "title": "DockSmith: Scaling Reliable Coding Environments via an Agentic Docker Builder",
    "description": "Paper introducing DockSmith, an agentic Docker builder for scaling reliable coding environments. Addresses challenges in creating reproducible development environments at scale using AI agents. Relevant for DevOps and platform engineering teams.",
    "author": "Jiaran Zhang, Luck Ma, Yanhao Li, et al.",
    "source": "ArXiv",
    "url": "https://arxiv.org/abs/2602.00592",
    "published_date": "2026-02-09",
    "topics": ["AI agents", "development environments", "Docker", "reproducibility", "developer tools"],
    "type": "technical"
  },
  {
    "title": "PCBSchemaGen: Constraint-Guided Schematic Design via LLM for Printed Circuit Boards",
    "description": "Research on using LLMs for constraint-guided PCB schematic design, demonstrating AI's expanding role in hardware design and engineering workflows beyond software development.",
    "author": "Huanghaohe Zou, Peng Han, Emad Nazerian, Alex Q. Huang",
    "source": "ArXiv",
    "url": "https://arxiv.org/abs/2602.00510",
    "published_date": "2026-02-09",
    "topics": ["LLM applications", "hardware design", "PCB design", "AI engineering"],
    "type": "technical"
  },
  {
    "title": "Gated Subspace Steering for Selective Memorization Mitigation",
    "description": "Research on mitigating selective memorization in ML models using gated subspace steering, relevant for improving LLM reliability and reducing training data leakage. Addresses privacy and robustness concerns in deployed models.",
    "author": "Researchers from University of British Columbia, Vector Institute",
    "source": "ArXiv",
    "url": "https://arxiv.org/abs/2602.08901",
    "published_date": "2026-02-09",
    "topics": ["machine learning", "LLM safety", "memorization", "model reliability"],
    "type": "technical"
  },
  {
    "title": "From Gameplay Traces to Game Mechanics: Causal Induction with Large Language Models",
    "description": "Research on using LLMs for causal induction from gameplay traces to infer game mechanics, demonstrating applications in game development and AI reasoning. Submitted to ICPR 2026.",
    "author": "Mohit Jiwatode, Alexander Dockhorn, Bodo Rosenhahn",
    "source": "ArXiv",
    "url": "https://arxiv.org/abs/2602.00190",
    "published_date": "2026-02-09",
    "topics": ["LLM reasoning", "game development", "causal induction", "AI applications"],
    "type": "technical"
  },
  {
    "title": "Localizing and Correcting Errors for LLM-based Planners",
    "description": "Research on error localization and correction techniques for LLM-based planning systems, improving reliability of agentic AI workflows. Addresses key challenge in autonomous agent development.",
    "author": "Aditya Kumar, William W. Cohen",
    "source": "ArXiv",
    "url": "https://arxiv.org/abs/2602.00276",
    "published_date": "2026-02-09",
    "topics": ["LLM agents", "error correction", "planning systems", "AI reliability"],
    "type": "technical"
  },
  {
    "title": "Position: Agentic Evolution is the Path to Evolving LLMs",
    "description": "Position paper arguing that agentic evolution represents the path forward for evolving LLM capabilities, discussing implications for future AI development. Explores how agent-based approaches may lead to more advanced AI systems.",
    "author": "Minhua Lin, Hanqing Lu, Zhan Shi, et al.",
    "source": "ArXiv",
    "url": "https://arxiv.org/abs/2602.00359",
    "published_date": "2026-02-09",
    "topics": ["AI agents", "LLM evolution", "AGI", "future of AI"],
    "type": "opinion"
  },
  {
    "title": "SayNext-Bench: Why Do LLMs Struggle with Next-Utterance Prediction?",
    "description": "Introduction of SayNext-Bench, a benchmark for evaluating LLM performance on next-utterance prediction tasks, analyzing challenges in conversational AI and understanding dialogue context.",
    "author": "Yueyi Yang, Haotian Liu, Fang Kang, et al.",
    "source": "ArXiv",
    "url": "https://arxiv.org/abs/2602.00327",
    "published_date": "2026-02-09",
    "topics": ["LLM benchmarks", "conversational AI", "evaluation", "natural language processing"],
    "type": "technical"
  }
]
